<!DOCTYPE HTML>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
  <!-- hexo-inject:begin --><!-- hexo-inject:end --><meta charset="utf-8">
  
  <title>Blind Busy All Day | _kawaiiQ&#39;s blog</title>

  
  <meta name="author" content="_kawaiiQ">
  

  

  

  <meta id="viewport" name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no, minimal-ui">
  <meta name="apple-mobile-web-app-capable" content="yes">
  <meta name="apple-mobile-web-app-status-bar-style" content="black">

  

  <meta property="og:site_name" content="_kawaiiQ&#39;s blog">

  
  <meta property="og:image" content="/favicon.ico">
  

  <link href="/favicon.ico" rel="icon">
  <link rel="alternate" href="/atom.xml" title="_kawaiiQ&#39;s blog" type="application/atom+xml">
  <link rel="stylesheet" href="/css/style.css" media="screen" type="text/css">

  <link rel="dns-prefetch" href="https://cdnjs.cloudflare.com"><!-- hexo-inject:begin --><!-- hexo-inject:end -->

</head>


<body>
<!-- hexo-inject:begin --><!-- hexo-inject:end --><div class="blog">
  <div class="content">

    <header>
  <div class="site-branding">
    <h1 class="site-logo">
      <div>
        <a href="/"><img src="/images/logo.png"></a>
        
          <a href="/"><img id="logo-widget" src="/images/widget.png"></a>
        
      </div>
    </h1>
    <p class="site-description">Blind Busy All Day</p>
  </div>
  <nav class="site-navigation">
    <ul>
      
        <li><a href="/">主页</a></li>
      
        <li><a href="/categories">分类</a></li>
      
        <li><a href="/archives">所有文章</a></li>
      
        <li><a href="/about">关于我</a></li>
      
    </ul>
  </nav>
</header>

    <main class="site-main posts-loop">
    
  <article>

  
    
    <h3 class="article-title"><a href="/articles/12/"><span>简单讲讲，什么是贝叶斯决策？</span></a></h3>
    
  

  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/articles/12/" rel="bookmark">
        <time class="entry-date published" datetime="2018-03-08T13:59:47.000Z">
          2018-03-08
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <p>&#x8BDD;&#x8BF4;&#x8FD8;&#x5728;&#x5C71;&#x79D1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x53D1;&#x73B0;&#x8BA1;&#x7B97;&#x673A;&#x4E13;&#x4E1A;&#x4E00;&#x4E2A;&#x5F88;&#x6709;&#x610F;&#x601D;&#x7684;&#x73B0;&#x8C61;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x9AD8;&#x624B;&#x4EEC;&#x6700;&#x7EC8;&#x5F80;&#x5F80;&#x5206;&#x5316;&#x6210;&#x4E24;&#x6D3E;&#xFF0C;&#x4E00;&#x6D3E;&#x91CD;&#x89C6;&#x7406;&#x8BBA;&#x57FA;&#x7840;&#xFF0C;&#x4E00;&#x6D3E;&#x91CD;&#x89C6;&#x5B9E;&#x8DF5;&#x80FD;&#x529B;&#x3002;&#x7406;&#x8BBA;&#x6D3E;&#x90FD;&#x662F;&#x5B66;&#x795E;&#x5B66;&#x9738;&#xFF0C;&#x8003;&#x8BD5;&#x6781;&#x5176;&#x4F18;&#x79C0;&#xFF0C;&#x6210;&#x4E3A;&#x5927;&#x5BB6;&#x505A;&#x4F5C;&#x4E1A;&#x7684;&#x597D;&#x5E2E;&#x624B;&#xFF0C;&#x4F46;&#x662F;&#x51E0;&#x4E4E;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#x90FD;&#x5199;&#x4E0D;&#x51FA;&#x6765;&#xFF1B;&#x5B9E;&#x8DF5;&#x6D3E;&#x6210;&#x4E86;&#x5927;&#x795E;&#x5927;&#x4F6C;&#xFF0C;&#x4EE3;&#x7801;&#x80FD;&#x529B;&#x4E00;&#x6D41;&#xFF0C;&#x8BFE;&#x7A0B;&#x8BBE;&#x8BA1;&#x5927;&#x817F;&#xFF0C;&#x4F46;&#x662F;&#x8003;&#x8BD5;&#x5C31;&#x5F98;&#x5F8A;&#x5728;&#x53CA;&#x683C;&#x7EBF;&#x9644;&#x8FD1;&#x3002;&#x800C;&#x4E14;&#x4E24;&#x8FB9;&#x5F80;&#x5F80;&#x76F8;&#x4E92;&#x770B;&#x4E0D;&#x8D77;&#x5BF9;&#x65B9;&#xFF0C;&#x8FD9;&#x8FB9;&#x8BF4;&#x4F60;&#x5149;&#x4F1A;&#x5199;&#x4EE3;&#x7801;&#x6280;&#x6821;&#x6C34;&#x5E73;&#x4E00;&#x8F88;&#x5B50;&#x4E5F;&#x5C31;&#x642C;&#x7816;&#x7684;&#x547D;&#xFF0C;&#x53E6;&#x4E00;&#x8FB9;&#x5C31;&#x8BF4;&#x4F60;&#x4EEC;&#x5C31;&#x662F;&#x4E66;&#x5446;&#x5B50;&#x5149;&#x5403;&#x4E66;&#x5199;&#x4E0D;&#x51FA;&#x4EE3;&#x7801;&#x6765;&#x6709;&#x5375;&#x7528;&#x3002;</p>
<p>&#x4EC0;&#x4E48;&#xFF1F;&#x4F60;&#x95EE;&#x6211;&#x662F;&#x90A3;&#x4E00;&#x6D3E;&#xFF1F;&#x6211;&#x662F;&#x5B66;&#x6E23;&#x554A;&#x3002;</p>
<p><img src="/images/01.jpg" alt></p>
<p>&#x4E0D;&#x8FC7;&#x5766;&#x7387;&#x5730;&#x8BB2;&#xFF0C;&#x6211;&#x7B97;&#x662F;&#x7A0D;&#x5FAE;&#x504F;&#x5411;&#x5B9E;&#x8DF5;&#x6D3E;&#x90A3;&#x8FB9;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x7406;&#x8BBA;&#x6C34;&#x5E73;&#x76F8;&#x5BF9;&#x5C31;&#x6BD4;&#x8F83;&#x5F31;&#x9E21;&#xFF0C;&#x6211;&#x4E2A;&#x4EBA;&#x4E5F;&#x6BD4;&#x8F83;&#x503E;&#x5411;&#x4E8E;&#x5199;&#x4EE3;&#x7801;&#x800C;&#x4E0D;&#x662F;&#x63A8;&#x516C;&#x5F0F;&#x3002;&#x7ED3;&#x679C;&#x4E0A;&#x5B66;&#x671F;&#x6A21;&#x5F0F;&#x8BC6;&#x522B;&#x4E0E;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x90A3;&#x95E8;&#x8BFE;&#xFF0C;&#x672C;&#x6765;&#x4EE5;&#x4E3A;&#x662F;&#x8BB2;&#x5B9E;&#x8DF5;&#x8DDF;&#x5E94;&#x7528;&#xFF0C;&#x5C31;&#x50CF;&#x672C;&#x79D1;&#x90A3;&#x6837;&#xFF0C;&#x7ED3;&#x679C;&#x4E00;&#x4E0A;&#x6765;&#x8BB2;&#x8D1D;&#x53F6;&#x65AF;&#x51B3;&#x7B56;&#xFF0C;&#x76F4;&#x63A5;&#x5728;&#x6CA1;&#x6709;&#x4E00;&#x70B9;&#x70B9;&#x9632;&#x5907;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x88AB;&#x516C;&#x5F0F;&#x9A91;&#x8138;&#xFF0C;&#x516C;&#x5F0F;&#x9A91;&#x8138;&#x600E;&#x4E48;&#x8F93;&#xFF1F;&#x4E8E;&#x662F;&#x5FC3;&#x6001;&#x5C31;&#x5D29;&#x4E86;&#xFF0C;&#x4E8E;&#x662F;&#x671F;&#x672B;&#x8003;&#x8BD5;&#x5C31;&#x5D29;&#x76D8;&#x4E86;&#x2026;&#x2026;</p>
<p>&#x4F46;&#x8001;&#x5B9E;&#x8BF4;&#xFF0C;&#x8D1D;&#x53F6;&#x65AF;&#x51B3;&#x7B56;&#x5176;&#x5B9E;&#x5E76;&#x4E0D;&#x662F;&#x591A;&#x96BE;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5F53;&#x521D;&#x4E5F;&#x662F;&#x4E00;&#x5F00;&#x59CB;&#x6CA1;&#x9002;&#x5E94;&#x516C;&#x5F0F;&#x9A91;&#x8138;&#x7684;&#x5B66;&#x4E60;&#x65B9;&#x5F0F;&#xFF08;&#x771F;&#xB7;&#x4E0D;&#x7C98;&#x9505;&#xFF09;&#x3002;&#x90A3;&#x8FD9;&#x4E00;&#x6B21;&#xFF0C;&#x5C31;&#x6574;&#x7406;&#x4E00;&#x4E0B;&#xFF0C;&#x8D1D;&#x53F6;&#x65AF;&#x51B3;&#x7B56;&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#x3002;</p>
        <center>
          <p>......</p>
          <nav class="pagination">
          
            <a href="/articles/12/" class="pagination-prev"><big><b>查看原文</b></big></a>
          
          </nav>

        </center>
      
    </div>

  </div>

  <div class="article-footer">
    <div class="article-meta pull-left">

    
      

    <span class="post-categories">
      <i class="icon-categories"></i>
        <a href="/categories/简单讲讲/">简单讲讲</a>
    </span>
    

    
    

    <span class="post-tags">
      <i class="icon-tags"></i>
        <a href="/tags/模式识别/">模式识别</a><a href="/tags/机器学习/">机器学习</a><a href="/tags/统计决策/">统计决策</a>
    </span>
    

    </div>

    
  </div>
</article>



  <article>

  
    
    <h3 class="article-title"><a href="/articles/11/"><span>多线程程序开发踩坑记</span></a></h3>
    
  

  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/articles/11/" rel="bookmark">
        <time class="entry-date published" datetime="2018-03-02T02:29:52.000Z">
          2018-03-02
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <p>&#x4E0A;&#x5B66;&#x671F;&#x7684;&#x5E76;&#x53D1;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E0E;&#x591A;&#x6838;&#x7F16;&#x7A0B;&#x8FD9;&#x95E8;&#x8BFE;&#x6700;&#x540E;&#x7559;&#x4E86;&#x4E00;&#x4E2A;&#x7F16;&#x7A0B;&#x4F5C;&#x4E1A;&#xFF0C;&#x8981;&#x6C42;&#x5B9E;&#x73B0;&#x7528;&#x4E8E;&#x5217;&#x8F66;&#x552E;&#x7968;&#x7684;&#x53EF;&#x7EBF;&#x6027;&#x5316;&#x5E76;&#x53D1;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x5E76;&#x4E14;&#x5BF9;&#x6B63;&#x786E;&#x6027;&#x7279;&#x6027;&#x505A;&#x51FA;&#x4E86;&#x8981;&#x6C42;&#x3002;&#x4F5C;&#x4E3A;&#x521A;&#x521A;&#x63A5;&#x89E6;&#x5E76;&#x53D1;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x7684;&#x5C0F;&#x767D;&#xFF0C;&#x5728;&#x5B9E;&#x73B0;&#x7684;&#x8FC7;&#x7A0B;&#x5F53;&#x4E2D;&#x8E29;&#x5230;&#x4E86;&#x8BF8;&#x591A;&#x7684;&#x5751;&#xFF0C;&#x6574;&#x7406;&#x4E8E;&#x6B64;&#xFF0C;&#x4E5F;&#x7B97;&#x662F;&#x7EC8;&#x4E8E;&#x8BA4;&#x8BC6;&#x5230;&#x5E76;&#x53D1;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x7684;&#x590D;&#x6742;&#x6027;&#x4E86;&#x3002;</p>
<p>&#x8E29;&#x5230;&#x7684;&#x8FD9;&#x4E9B;&#x5751;&#x91CC;&#xFF0C;&#x4E3B;&#x8981;&#x95EE;&#x9898;&#x51FA;&#x5728;&#x7B97;&#x6CD5;&#x4E0E;&#x7A0B;&#x5E8F;&#x7ED3;&#x6784;&#x4E0A;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x662F;&#x4E3A;&#x4E86;&#x4F18;&#x5316;&#x800C;&#x63D0;&#x51FA;&#x7684;&#x4E00;&#x4E9B;&#x7B97;&#x6CD5;&#x548C;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x758F;&#x5FFD;&#x4E86;&#x67D0;&#x4E9B;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x800C;&#x9020;&#x6210;&#x7684;&#x7A0B;&#x5E8F;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x6B63;&#x786E;&#x6027;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5728;&#x8DDF;&#x5927;&#x5BB6;&#x7684;&#x8BA8;&#x8BBA;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x53D1;&#x73B0;&#x5176;&#x5B9E;&#x4E0D;&#x5C11;&#x4EBA;&#x90FD;&#x8E29;&#x4E86;&#x8FD9;&#x4E9B;&#x5751;&#x3002;&#x800C;&#x4E14;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x662F;&#x5728;&#x4E00;&#x4E9B;&#x5F88;&#x7279;&#x6B8A;&#x7684;&#x60C5;&#x51B5;&#x624D;&#x4F1A;&#x53D1;&#x751F;&#xFF0C;&#x76F4;&#x63A5;&#x6D4B;&#x8BD5;&#x662F;&#x6781;&#x96BE;&#x53D1;&#x73B0;&#x4E14;&#x590D;&#x73B0;&#x7684;&#xFF0C;&#x5F80;&#x5F80;&#x8981;&#x9760;&#x624B;&#x52A8;&#x63A8;&#x6F14;&#x624D;&#x80FD;&#x53D1;&#x73B0;&#x3002;&#x4F46;&#x662F;&#x6781;&#x96BE;&#x51FA;&#x73B0;&#x7684;&#x60C5;&#x51B5;&#x5E76;&#x4E0D;&#x7B49;&#x4E8E;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E9B;&#x5173;&#x952E;&#x7CFB;&#x7EDF;&#x6765;&#x8BF4;&#x8FD9;&#x5C31;&#x50CF;&#x4E2A;&#x85CF;&#x5F97;&#x5F88;&#x6DF1;&#x7684;&#x70B8;&#x5F39;&#xFF0C;&#x4E0D;&#x70B8;&#x5219;&#x5DF2;&#xFF0C;&#x4E00;&#x70B8;&#x5C31;&#x8981;&#x4E86;&#x547D;&#x3002;&#x6240;&#x4EE5;&#x8BF4;&#xFF0C;&#x5E76;&#x53D1;&#x7A0B;&#x5E8F;&#x662F;&#x5F88;&#x590D;&#x6742;&#x7684;&#xFF0C;&#x591A;&#x7EBF;&#x7A0B;&#x7684;&#x6267;&#x884C;&#x5F80;&#x5F80;&#x4F1A;&#x5E26;&#x6765;&#x5F88;&#x591A;&#x60F3;&#x4E0D;&#x5230;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5728;&#x5F00;&#x53D1;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x9700;&#x8981;&#x66F4;&#x5168;&#x9762;&#x4E25;&#x8C28;&#x5730;&#x8003;&#x8651;&#xFF0C;&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x56E0;&#x4E3A;&#x8001;&#x5E08;&#x8BF4;&#x8FC7;&#x4E0D;&#x8981;&#x628A;&#x4EE3;&#x7801;&#x53D1;&#x51FA;&#x6765;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x5C31;&#x53EA;&#x7B80;&#x5355;&#x8BB2;&#x8BB2;&#x601D;&#x8DEF;&#x8DDF;&#x8E29;&#x7684;&#x5751;&#x3002;</p>
<p>&#x8BDD;&#x8BF4;&#x5F53;&#x5E74;&#x62A2;&#x4E0D;&#x5230;&#x7968;&#x7684;&#x65F6;&#x5019;&#x8DDF;&#x5927;&#x5BB6;&#x4E00;&#x8D77;&#x55B7;12306&#x70C2;&#xFF0C;&#x73B0;&#x5728;&#x518D;&#x60F3;&#x60F3;&#xFF0C;12306&#x786E;&#x5B9E;&#x662F;&#x4E0D;&#x5BB9;&#x6613;&#x554A;&#x2026;&#x2026;</p>
        <center>
          <p>......</p>
          <nav class="pagination">
          
            <a href="/articles/11/" class="pagination-prev"><big><b>查看原文</b></big></a>
          
          </nav>

        </center>
      
    </div>

  </div>

  <div class="article-footer">
    <div class="article-meta pull-left">

    
      

    <span class="post-categories">
      <i class="icon-categories"></i>
        <a href="/categories/实践/">实践</a>
    </span>
    

    
    

    <span class="post-tags">
      <i class="icon-tags"></i>
        <a href="/tags/并发程序设计/">并发程序设计</a>
    </span>
    

    </div>

    
  </div>
</article>



  <article>

  
    
    <h3 class="article-title"><a href="/articles/10/"><span>服务改到了Coding Pages上</span></a></h3>
    
  

  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/articles/10/" rel="bookmark">
        <time class="entry-date published" datetime="2018-02-28T11:51:16.000Z">
          2018-02-28
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <p>&#x539F;&#x5148;&#x7528;Github Pages&#x65F6;&#xFF0C;&#x5728;&#x5C06;&#x535A;&#x5BA2;&#x63A5;&#x5165;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x65F6;&#x9047;&#x5230;&#x4E86;&#x4E00;&#x70B9;&#x9EBB;&#x70E6;&#x3002;&#x8C37;&#x6B4C;&#x548C;&#x5FC5;&#x5E94;&#x5F88;&#x6B63;&#x5E38;&#xFF0C;&#x4F46;&#x662F;&#x56FD;&#x5185;&#x7684;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x5C45;&#x7136;&#x5168;&#x90FD;&#x4E0D;&#x7BA1;&#x7528;&#x3002;&#x540E;&#x6765;&#x53D1;&#x73B0;&#x539F;&#x6765;&#x662F;Github&#x628A;&#x56FD;&#x5185;&#x7684;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x5C4F;&#x853D;&#x6389;&#x4E86;&#x5BFC;&#x81F4;&#x8FD9;&#x4E9B;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x7684;&#x722C;&#x866B;&#x6293;&#x4E0D;&#x5230;&#x4FE1;&#x606F;&#xFF0C;&#x8FD9;&#x5C31;&#x6BD4;&#x8F83;&#x5C34;&#x5C2C;&#x4E86;&#x2026;&#x2026;</p>
<p>&#x672C;&#x6765;&#x662F;&#x6253;&#x7B97;&#x7528;Github Pages + Coding Pages&#x540C;&#x6B65;&#x66F4;&#x65B0;&#x7136;&#x540E;&#x6309;&#x5730;&#x533A;&#x89E3;&#x6790;&#x7684;&#x65B9;&#x6848;&#x7684;&#xFF0C;&#x4E0D;&#x8FC7;&#x540E;&#x6765;&#x610F;&#x5916;&#x53D1;&#x73B0;Coding Pages&#x7ED1;&#x5B9A;&#x57DF;&#x540D;&#x4E4B;&#x540E;&#x53EF;&#x4EE5;&#x652F;&#x6301;https&#xFF01;&#x800C;Github&#x4E0A;&#x7528;&#x4E86;&#x81EA;&#x5B9A;&#x4E49;&#x7684;&#x57DF;&#x540D;&#x4E4B;&#x540E;&#x5C31;&#x4E0D;&#x652F;&#x6301;https&#x4E86;&#x3002;&#x8FD9;&#x5C31;&#x5BF9;&#x6211;&#x6BD4;&#x8F83;&#x6709;&#x8BF1;&#x60D1;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x60F3;&#x4E86;&#x60F3;&#xFF0C;&#x50CF;&#x6211;&#x8FD9;&#x6837;&#x6BD4;&#x8F83;&#x6CA1;&#x4EC0;&#x4E48;&#x5B58;&#x5728;&#x611F;&#x7684;&#xFF0C;&#x597D;&#x50CF;&#x56FD;&#x5185;&#x90FD;&#x6CA1;&#x51E0;&#x4E2A;&#x4EBA;&#x4F1A;&#x770B;&#x4F55;&#x51B5;&#x56FD;&#x5916;&#x2026;&#x2026;&#x4E8E;&#x662F;DNSPod&#x4E0A;&#x5C31;&#x5E72;&#x8106;&#x5C31;&#x76F4;&#x63A5;&#x5168;&#x89E3;&#x6790;&#x5230;Coding Pages&#x4E0A;&#x4E86;&#x3002;&#x539F;&#x6765;Github Pages&#x4E0A;&#x7684;&#x7F51;&#x7AD9;&#x4E5F;&#x540C;&#x6B65;&#x66F4;&#x65B0;&#xFF0C;&#x4E0D;&#x8FC7;&#x53EA;&#x7559;&#x7ED9;&#x8C37;&#x6B4C;&#x548C;&#x5FC5;&#x5E94;&#x6293;&#x4E86;&#xFF0C;&#x6BD5;&#x7ADF;&#x611F;&#x60C5;&#x4E0A;&#x8FD8;&#x662F;&#x6709;&#x70B9;&#x820D;&#x4E0D;&#x5F97;Github&#x2026;&#x2026;</p>
<p>&#x561B;&#xFF0C;&#x5C31;&#x662F;&#x8FD9;&#x4E9B;&#x4E8B;&#x60C5;&#x4E86;&#x3002;</p>

      
    </div>

  </div>

  <div class="article-footer">
    <div class="article-meta pull-left">

    
      

    <span class="post-categories">
      <i class="icon-categories"></i>
        <a href="/categories/日常/">日常</a>
    </span>
    

    
    

    <span class="post-tags">
      <i class="icon-tags"></i>
        <a href="/tags/Nothing-Important/">Nothing Important</a>
    </span>
    

    </div>

    
  </div>
</article>



  <article>

  
    
    <h3 class="article-title"><a href="/articles/9/"><span>简单讲讲，并发程序设计有啥原则?</span></a></h3>
    
  

  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/articles/9/" rel="bookmark">
        <time class="entry-date published" datetime="2018-02-24T08:13:26.000Z">
          2018-02-24
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <p>&#x8BDD;&#x8BF4;&#x81EA;&#x4ECE;&#x6211;&#x8FDB;&#x5165;&#x8BA1;&#x7B97;&#x673A;&#x4E13;&#x4E1A;&#x5F00;&#x59CB;&#x5B66;&#x4E60;&#x4EE5;&#x6765;&#xFF0C;&#x6240;&#x5B66;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5404;&#x79CD;&#x8BED;&#x8A00;&#x554A;&#x3001;&#x7B97;&#x6CD5;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x554A;&#xFF0C;&#x57FA;&#x672C;&#x90FD;&#x8FD8;&#x5728;&#x5355;&#x7EBF;&#x7A0B;&#x7684;&#x9636;&#x6BB5;&#x6216;&#x8005;&#x6216;&#x8005;&#x7ED5;&#x8FC7;&#x4E86;&#x591A;&#x7EBF;&#x7A0B;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x6216;&#x8005;&#x53EA;&#x662F;&#x5F88;&#x6D45;&#x5730;&#x5728;&#x591A;&#x7EBF;&#x7A0B;&#x7684;&#x8FB9;&#x7F18;&#x4E0A;&#x201C;&#x8BD5;&#x63A2;&#x201D;&#x4E86;&#x4E00;&#x5708;&#xFF0C;&#x50CF;&#x662F;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x4E5F;&#x53EA;&#x662F;&#x7B80;&#x5355;&#x8BB2;&#x4E86;&#x8BB2;&#x9965;&#x997F;&#x548C;&#x6B7B;&#x9501;&#x3002;&#x5927;&#x5B66;&#x9636;&#x6BB5;&#x591A;&#x7EBF;&#x7A0B;&#x5F00;&#x53D1;&#x7684;&#x5DC5;&#x5CF0;&#x65F6;&#x523B;&#x5927;&#x6982;&#x5C31;&#x662F;&#x5927;&#x4E09;&#x7528;Java&#x5199;&#x4E86;&#x4E2A;&#x591A;&#x7EBF;&#x7A0B;&#x7684;&#x98DE;&#x673A;&#x5927;&#x6218;&#x4E86;&#x3002;&#x4EE5;&#x81F4;&#x4E8E;&#x6211;&#x4E00;&#x5EA6;&#x6709;&#x79CD;&#x591A;&#x7EBF;&#x7A0B;&#x5F00;&#x53D1;&#x5176;&#x5B9E;&#x4E5F;&#x6CA1;&#x5565;&#xFF0C;&#x65E0;&#x975E;&#x5C31;&#x662F;&#x9965;&#x997F;&#x4E0E;&#x6B7B;&#x9501;&#x7684;&#x9519;&#x89C9;&#x3002;</p>
<img src="/articles/9/pic1.jpg" alt="&#x5728;&#x591A;&#x7EBF;&#x7A0B;&#x5F00;&#x53D1;&#x7684;&#x8FB9;&#x7F18;&#x8BD5;&#x63A2;" title="&#x5728;&#x591A;&#x7EBF;&#x7A0B;&#x5F00;&#x53D1;&#x7684;&#x8FB9;&#x7F18;&#x8BD5;&#x63A2;">
<p>&#x53BB;&#x5E74;&#x79CB;&#x5B63;&#x5B66;&#x671F;&#x9009;&#x4FEE;&#x4E86;&#x5E76;&#x53D1;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E0E;&#x591A;&#x6838;&#x7F16;&#x7A0B;&#x8FD9;&#x95E8;&#x8BFE;&#x4E4B;&#x540E;&#xFF0C;&#x7B97;&#x662F;&#x9010;&#x6E10;&#x5F00;&#x59CB;&#x63A5;&#x89E6;&#x4E86;&#x5E76;&#x53D1;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x3002;&#x5176;&#x5B9E;&#x591A;&#x7EBF;&#x7A0B;&#x5F00;&#x53D1;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x5E76;&#x53D1;&#x7A0B;&#x5E8F;&#x7684;&#x5F00;&#x53D1;&#xFF0C;&#x662F;&#x6709;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#x7684;&#x3002;&#x7531;&#x4E8E;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x76F8;&#x5BF9;&#x72EC;&#x7ACB;&#x5730;&#x5E76;&#x884C;&#x8FD0;&#x884C;&#xFF0C;&#x5176;&#x6267;&#x884C;&#x7684;&#x987A;&#x5E8F;&#x662F;&#x590D;&#x6742;&#x591A;&#x53D8;&#x96BE;&#x4EE5;&#x9884;&#x6D4B;&#x7684;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x4F55;&#x4FDD;&#x8BC1;&#x5404;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x4E0D;&#x4F1A;&#x5F7C;&#x6B64;&#x5E72;&#x6270;&#x51B2;&#x7A81;&#xFF0C;&#x4FDD;&#x8BC1;&#x7A0B;&#x5E8F;&#x7684;&#x76F8;&#x5BF9;&#x6B63;&#x786E;&#xFF0C;&#x5C31;&#x6210;&#x4E3A;&#x4E86;&#x9700;&#x8981;&#x7814;&#x7A76;&#x7684;&#x91CD;&#x70B9;&#x3002;&#x5728;&#x5B66;&#x4E60;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x89C9;&#x5F97;&#x751A;&#x4E3A;&#x6709;&#x8DA3;&#xFF0C;&#x6545;&#x6574;&#x7406;&#x4E8E;&#x6B64;&#xFF0C;&#x4EC5;&#x4F5C;&#x6D45;&#x8C08;&#x3002;</p>
        <center>
          <p>......</p>
          <nav class="pagination">
          
            <a href="/articles/9/" class="pagination-prev"><big><b>查看原文</b></big></a>
          
          </nav>

        </center>
      
    </div>

  </div>

  <div class="article-footer">
    <div class="article-meta pull-left">

    
      

    <span class="post-categories">
      <i class="icon-categories"></i>
        <a href="/categories/简单讲讲/">简单讲讲</a>
    </span>
    

    
    

    <span class="post-tags">
      <i class="icon-tags"></i>
        <a href="/tags/并发程序设计/">并发程序设计</a>
    </span>
    

    </div>

    
  </div>
</article>



  <article>

  
    
    <h3 class="article-title"><a href="/articles/8/"><span>Coursera《机器学习》学习笔记（八）：OCR篇</span></a></h3>
    
  

  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/articles/8/" rel="bookmark">
        <time class="entry-date published" datetime="2018-02-09T08:18:38.000Z">
          2018-02-09
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <p>&#x8FD9;&#x4E00;&#x7BC7;&#x662F;<a href="https://www.coursera.org/learn/machine-learning" target="_blank" rel="external">&#x300A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x300B;</a>&#x6700;&#x540E;&#x4E00;&#x5468;&#x77E5;&#x8BC6;&#x70B9;&#x7684;&#x603B;&#x7ED3;&#xFF0C;&#x4E3B;&#x8981;&#x4ECB;&#x7ECD;&#x4E86;OCR&#x6280;&#x672F;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;OCR&#x7684;&#x4F8B;&#x5B50;&#x4ECB;&#x7ECD;&#x4E86;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6D41;&#x6C34;&#x7EBF;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x5E76;&#x7B80;&#x5355;&#x4ECB;&#x7ECD;&#x5BF9;&#x4E8E;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6D41;&#x6C34;&#x7EBF;&#x5982;&#x4F55;&#x627E;&#x5230;&#x8FDB;&#x4E00;&#x6B65;&#x6539;&#x8FDB;&#x6548;&#x76CA;&#x6700;&#x9AD8;&#x7684;&#x70B9;&#x3002;</p>
        <center>
          <p>......</p>
          <nav class="pagination">
          
            <a href="/articles/8/" class="pagination-prev"><big><b>查看原文</b></big></a>
          
          </nav>

        </center>
      
    </div>

  </div>

  <div class="article-footer">
    <div class="article-meta pull-left">

    
      

    <span class="post-categories">
      <i class="icon-categories"></i>
        <a href="/categories/学习笔记/">学习笔记</a>
    </span>
    

    
    

    <span class="post-tags">
      <i class="icon-tags"></i>
        <a href="/tags/机器学习/">机器学习</a><a href="/tags/Coursera/">Coursera</a>
    </span>
    

    </div>

    
  </div>
</article>



  <article>

  
    
    <h3 class="article-title"><a href="/articles/7/"><span>Coursera《机器学习》学习笔记（七）：大规模机器学习篇</span></a></h3>
    
  

  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/articles/7/" rel="bookmark">
        <time class="entry-date published" datetime="2018-02-04T11:00:23.000Z">
          2018-02-04
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <p>&#x8FD9;&#x4E00;&#x7BC7;&#x662F;<a href="https://www.coursera.org/learn/machine-learning" target="_blank" rel="external">&#x300A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x300B;</a>&#x7B2C;&#x5341;&#x5468;&#x77E5;&#x8BC6;&#x70B9;&#x7684;&#x603B;&#x7ED3;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x9488;&#x5BF9;&#x5927;&#x89C4;&#x6A21;&#x6570;&#x636E;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5BF9;&#x539F;&#x6765;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x6240;&#x505A;&#x7684;&#x6539;&#x8FDB;&#x3002;</p>
<p>&#x8981;&#x8BF4;&#x8FD9;&#x5927;&#x6570;&#x636E;&#x554A;&#xFF0C;&#x5F53;&#x5E74;&#x8FD8;&#x5728;&#x5C71;&#x79D1;&#x7684;&#x65F6;&#x5019;&#x5230;&#x5904;&#x90FD;&#x5728;&#x8BB2;&#x4E91;&#x8BA1;&#x7B97;&#x8DDF;&#x5927;&#x6570;&#x636E;&#xFF0C;&#x54EA;&#x6015;&#x6211;&#x8003;&#x7814;&#x62A5;&#x540D;&#x7684;&#x65F6;&#x5019;&#x5927;&#x6570;&#x636E;&#x4E5F;&#x662F;&#x8D85;&#x7EA7;&#x70ED;&#x95E8;&#x7684;&#x65B9;&#x5411;&#xFF0C;&#x7ED3;&#x679C;&#x8003;&#x5B8C;&#x7814;&#x4E86;&#x5927;&#x5B66;&#x8FD8;&#x6CA1;&#x6BD5;&#x4E1A;&#x5927;&#x6570;&#x636E;&#x5C31;&#x201C;&#x9000;&#x70E7;&#x201D;&#x4E86;&#xFF0C;&#x6539;&#x6210;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x706B;&#x4E86;&#x3002;&#x9AD8;&#x7EA7;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x8BFE;&#x4E0A;&#x6C88;&#x534E;&#x4F1F;&#x8001;&#x5E08;&#x8BF4;&#xFF0C;&#x5F53;&#x5E74;&#x5927;&#x6570;&#x636E;&#x706B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8DD1;&#x5F97;&#x5FEB;&#x7684;&#x5B66;&#x6821;&#x5DF2;&#x7ECF;&#x7387;&#x5148;&#x6210;&#x7ACB;&#x4E86;&#x5927;&#x6570;&#x636E;&#x5B66;&#x9662;&#xFF0C;&#x8DD1;&#x5F97;&#x6162;&#x7684;&#x5B66;&#x6821;&#x5927;&#x6570;&#x636E;&#x5B66;&#x9662;&#x8FD8;&#x6CA1;&#x6210;&#x7ACB;&#xFF0C;&#x7136;&#x540E;&#x6539;&#x6210;&#x5EFA;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x5B66;&#x9662;&#x4E86;&#x3002;&#x4E0D;&#x77E5;&#x9053;&#x4E3A;&#x5565;&#xFF0C;&#x8001;&#x5E08;&#x8FD9;&#x4E48;&#x8BF4;&#x7684;&#x65F6;&#x5019;&#x6211;&#x603B;&#x662F;&#x4E0D;&#x7531;&#x81EA;&#x4E3B;&#x5730;&#x60F3;&#x5230;&#x56FD;&#x79D1;&#x5927;&#x7684;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x5B66;&#x9662;&#x2026;&#x2026;</p>
<p>&#x4E0D;&#x8FC7;&#xFF0C;&#x6211;&#x4E2A;&#x4EBA;&#x89C9;&#x5F97;&#xFF0C;&#x8FD9;&#x4E00;&#x6CE2;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x7684;&#x5174;&#x8D77;&#xFF0C;&#x5176;&#x5B9E;&#x7EE7;&#x627F;&#x4E86;&#x5927;&#x6570;&#x636E;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x4E1C;&#x897F;&#x7684;&#xFF0C;&#x5C31;&#x50CF;&#x8001;&#x5E08;&#x8BF4;&#x7684;&#xFF0C;&#x6458;&#x4E86;&#x5927;&#x6570;&#x636E;&#x7684;&#x679C;&#x5B50;&#x3002;&#x4E4B;&#x524D;&#x7684;&#x8BFE;&#x7A0B;&#x4E5F;&#x63D0;&#x5230;&#x8FC7;&#xFF0C;&#x5F53;&#x8BAD;&#x7EC3;&#x96C6;&#x975E;&#x5E38;&#x5927;&#x7684;&#x65F6;&#x5019;&#x5176;&#x5B9E;&#x5C31;&#x53EF;&#x4EE5;&#x4E0D;&#x600E;&#x4E48;&#x9700;&#x8981;&#x8003;&#x8651;&#x9AD8;&#x65B9;&#x5DEE;&#x7684;&#x95EE;&#x9898;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x6D77;&#x91CF;&#x7684;&#x6570;&#x636E;&#x662F;&#x5BF9;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x662F;&#x6709;&#x5F88;&#x5927;&#x5E2E;&#x52A9;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5F53;&#x6570;&#x636E;&#x91CF;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x65F6;&#xFF0C;&#x5904;&#x7406;&#x4E0E;&#x8BA1;&#x7B97;&#x7684;&#x6548;&#x7387;&#x4E5F;&#x8D8A;&#x6765;&#x8D8A;&#x6162;&#xFF0C;&#x56E0;&#x6B64;&#x5C31;&#x9700;&#x8981;&#x5BF9;&#x4F20;&#x7EDF;&#x7684;&#x8BA1;&#x7B97;&#x8FDB;&#x884C;&#x6539;&#x8FDB;&#x3002;</p>
        <center>
          <p>......</p>
          <nav class="pagination">
          
            <a href="/articles/7/" class="pagination-prev"><big><b>查看原文</b></big></a>
          
          </nav>

        </center>
      
    </div>

  </div>

  <div class="article-footer">
    <div class="article-meta pull-left">

    
      

    <span class="post-categories">
      <i class="icon-categories"></i>
        <a href="/categories/学习笔记/">学习笔记</a>
    </span>
    

    
    

    <span class="post-tags">
      <i class="icon-tags"></i>
        <a href="/tags/机器学习/">机器学习</a><a href="/tags/Coursera/">Coursera</a>
    </span>
    

    </div>

    
  </div>
</article>



  <article>

  
    
    <h3 class="article-title"><a href="/articles/6/"><span>Coursera《机器学习》学习笔记（六）：推荐系统篇</span></a></h3>
    
  

  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/articles/6/" rel="bookmark">
        <time class="entry-date published" datetime="2018-02-02T16:01:42.000Z">
          2018-02-03
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <p>&#x8FD9;&#x4E00;&#x7BC7;&#x662F;<a href="https://www.coursera.org/learn/machine-learning" target="_blank" rel="external">&#x300A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x300B;</a>&#x7B2C;&#x516B;&#x5468;&#x5230;&#x7B2C;&#x4E5D;&#x5468;&#x540E;&#x534A;&#x90E8;&#x5206;&#x77E5;&#x8BC6;&#x70B9;&#x7684;&#x603B;&#x7ED3;&#xFF0C;&#x4ECB;&#x7ECD;&#x4E86;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x7684;&#x65B9;&#x5411;&#xFF1A;&#x63A8;&#x8350;&#x7CFB;&#x7EDF;&#x3002;&#x63A8;&#x8350;&#x7CFB;&#x7EDF;&#x5728;&#x5F88;&#x591A;&#x5730;&#x65B9;&#x90FD;&#x6709;&#x5E94;&#x7528;&#xFF0C;&#x6DD8;&#x5B9D;&#x4EAC;&#x4E1C;&#x7684;&#x63A8;&#x8350;&#x5546;&#x54C1;&#x3001;&#x7535;&#x5F71;&#x7F51;&#x7AD9;&#x7684;&#x63A8;&#x8350;&#x7535;&#x5F71;&#x3001;&#x7F51;&#x6613;&#x4E91;&#x97F3;&#x4E50;&#x7684;&#x7684;&#x63A8;&#x8350;&#x97F3;&#x4E50;,&#x6211;&#x4EEC;&#x51E0;&#x4E4E;&#x5230;&#x5904;&#x90FD;&#x80FD;&#x770B;&#x5230;&#x63A8;&#x8350;&#x7CFB;&#x7EDF;&#x7684;&#x5F71;&#x5B50;&#x3002;&#x901A;&#x8FC7;&#x63A8;&#x8350;&#x7CFB;&#x7EDF;&#xFF0C;&#x5382;&#x5546;&#x53EF;&#x4EE5;&#x66F4;&#x597D;&#x5730;&#x63D0;&#x4F9B;&#x4E2A;&#x6027;&#x5316;&#x670D;&#x52A1;&#xFF0C;&#x63D0;&#x5347;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#xFF0C;&#x4ECE;&#x800C;&#x4ECE;&#x4F60;&#x53E3;&#x888B;&#x91CC;&#x638F;&#x51FA;&#x66F4;&#x591A;&#x7684;&#x94B1;&#x3002;</p>
        <center>
          <p>......</p>
          <nav class="pagination">
          
            <a href="/articles/6/" class="pagination-prev"><big><b>查看原文</b></big></a>
          
          </nav>

        </center>
      
    </div>

  </div>

  <div class="article-footer">
    <div class="article-meta pull-left">

    
      

    <span class="post-categories">
      <i class="icon-categories"></i>
        <a href="/categories/学习笔记/">学习笔记</a>
    </span>
    

    
    

    <span class="post-tags">
      <i class="icon-tags"></i>
        <a href="/tags/机器学习/">机器学习</a><a href="/tags/Coursera/">Coursera</a>
    </span>
    

    </div>

    
  </div>
</article>



  <article>

  
    
    <h3 class="article-title"><a href="/articles/5/"><span>Coursera《机器学习》学习笔记（五）：PCA、K均值与高斯分布篇</span></a></h3>
    
  

  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/articles/5/" rel="bookmark">
        <time class="entry-date published" datetime="2018-02-01T16:45:21.000Z">
          2018-02-02
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <p>&#x4E3A;&#x4EC0;&#x4E48;&#x8DDD;&#x79BB;&#x4E0A;&#x4E00;&#x7BC7;&#x53C8;&#x95F4;&#x65AD;&#x4E86;&#x8FD9;&#x4E48;&#x4E45;&#x5462;&#xFF0C;&#x56E0;&#x4E3A;&#x53C8;&#x9047;&#x5230;&#x8003;&#x8BD5;&#x4E86;&#xFF0C;&#x800C;&#x4E14;&#x6700;&#x540E;&#x4E00;&#x5468;&#x8FDE;&#x8003;&#x4E09;&#x95E8;&#x5B66;&#x4F4D;&#x8BFE;&#xFF0C;&#x751A;&#x4E3A;&#x9178;&#x723D;&#x3002;&#x90A3;&#x53E5;&#x8BDD;&#x600E;&#x4E48;&#x8BB2;&#x7684;&#xFF0C;&#x73B0;&#x5728;&#x8003;&#x8BD5;&#x6D41;&#x7684;&#x6CEA;&#x90FD;&#x662F;&#x5F53;&#x521D;&#x9009;&#x8BFE;&#x8111;&#x5B50;&#x8FDB;&#x7684;&#x6C34;&#x3002;&#x8FD9;&#x79CD;&#x8003;&#x7406;&#x8BBA;&#x63A8;&#x516C;&#x5F0F;&#x7684;&#x786C;&#x8BFE;&#xFF0C;&#x5BF9;&#x4E8E;&#x6570;&#x5B66;&#x57FA;&#x7840;&#x672C;&#x6765;&#x5C31;&#x662F;&#x6587;&#x79D1;&#x751F;&#x6C34;&#x5E73;&#x7684;&#x6211;&#x6765;&#x8BF4;&#xFF0C;&#x57FA;&#x672C;&#x5C31;&#x770B;&#x8001;&#x5E08;&#x613F;&#x4E0D;&#x613F;&#x610F;&#x770B;&#x5728;&#x6D53;&#x6D53;&#x5E08;&#x751F;&#x60C5;&#x7684;&#x4EFD;&#x4E0A;&#x62AC;&#x6211;&#x4E00;&#x624B;&#x4E86;&#x2026;&#x2026;</p>
<p>&#x4F5C;&#x4E3A;&#x5B66;&#x9165;&#x771F;&#x662F;&#x60E8;&#xFF0C;&#x8003;&#x5F97;&#x5B66;&#x6E23;&#x4E00;&#x6837;&#x7684;&#x6210;&#x7EE9;&#x8FD8;&#x8981;&#x88AB;&#x4EBA;&#x55B7;&#x662F;&#x5B66;&#x5A4A;&#x2026;&#x2026;</p>
<p><img src="/images/give-me-a-knife.jpg" alt></p>
<p>&#x8FD9;&#x4E00;&#x7BC7;&#x662F;<a href="https://www.coursera.org/learn/machine-learning" target="_blank" rel="external">&#x300A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x300B;</a>&#x7B2C;&#x516B;&#x5468;&#x5230;&#x7B2C;&#x4E5D;&#x5468;&#x524D;&#x534A;&#x90E8;&#x5206;&#x77E5;&#x8BC6;&#x70B9;&#x7684;&#x603B;&#x7ED3;&#xFF0C;&#x4E3B;&#x8981;&#x4ECB;&#x7ECD;&#x4E86;&#x65E0;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x7684;&#x4E24;&#x79CD;&#x7B97;&#x6CD5;&#xFF1A;K&#x5747;&#x503C;&#x548C;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#xFF0C;&#x548C;&#x7EF4;&#x5EA6;&#x7EA6;&#x51CF;&#x7684;&#x7B97;&#x6CD5;&#xFF1A;&#x4E3B;&#x6210;&#x5206;&#x5206;&#x6790;&#x3002;&#x672C;&#x7BC7;&#x7684;&#x65E0;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x6D89;&#x53CA;&#x7684;&#x95EE;&#x9898;&#x662F;&#x805A;&#x7C7B;&#x95EE;&#x9898;&#x548C;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x95EE;&#x9898;&#xFF0C;&#x524D;&#x8005;&#x662F;&#x5C06;&#x539F;&#x59CB;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x5212;&#x5206;&#xFF0C;&#x540E;&#x8005;&#x662F;&#x5728;&#x4F7F;&#x7528;&#x5927;&#x91CF;&#x201C;&#x6B63;&#x5E38;&#x201D;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#x540E;&#xFF0C;&#x7ED9;&#x51FA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x6837;&#x672C;&#xFF0C;&#x5224;&#x65AD;&#x8BE5;&#x6837;&#x672C;&#x662F;&#x5426;&#x51FA;&#x73B0;&#x201C;&#x5F02;&#x5E38;&#x201D;&#x3002;</p>
        <center>
          <p>......</p>
          <nav class="pagination">
          
            <a href="/articles/5/" class="pagination-prev"><big><b>查看原文</b></big></a>
          
          </nav>

        </center>
      
    </div>

  </div>

  <div class="article-footer">
    <div class="article-meta pull-left">

    
      

    <span class="post-categories">
      <i class="icon-categories"></i>
        <a href="/categories/学习笔记/">学习笔记</a>
    </span>
    

    
    

    <span class="post-tags">
      <i class="icon-tags"></i>
        <a href="/tags/机器学习/">机器学习</a><a href="/tags/Coursera/">Coursera</a>
    </span>
    

    </div>

    
  </div>
</article>



  <article>

  
    
    <h3 class="article-title"><a href="/articles/4/"><span>Coursera《机器学习》学习笔记（四）：支持向量机篇</span></a></h3>
    
  

  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/articles/4/" rel="bookmark">
        <time class="entry-date published" datetime="2018-01-11T13:26:21.000Z">
          2018-01-11
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <p>&#x8FD9;&#x4E00;&#x7BC7;&#x662F;<a href="https://www.coursera.org/learn/machine-learning" target="_blank" rel="external">&#x300A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x300B;</a>&#x7B2C;&#x4E03;&#x5468;&#x77E5;&#x8BC6;&#x70B9;&#x7684;&#x603B;&#x7ED3;&#xFF0C;&#x4ECB;&#x7ECD;&#x4E86;&#x672C;&#x8FD9;&#x95E8;&#x8BFE;&#x7A0B;&#x6240;&#x6D89;&#x53CA;&#x7684;&#x6700;&#x540E;&#x4E00;&#x79CD;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#xFF1A;&#x652F;&#x6301;&#x5411;&#x91CF;&#x673A;&#xFF08;Support Vector Machine&#xFF0C;&#x7B80;&#x79F0;SVM&#xFF09;&#xFF0C;&#x7528;&#x4E8E;&#x89E3;&#x51B3;&#x590D;&#x6742;&#x7684;&#x975E;&#x7EBF;&#x6027;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x603B;&#x4F53;&#x4E0A;&#xFF0C;&#x652F;&#x6301;&#x5411;&#x91CF;&#x673A;&#x603B;&#x4F53;&#x4E0A;&#x548C;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x7684;&#x65B9;&#x6CD5;&#x5341;&#x5206;&#x76F8;&#x4F3C;&#xFF0C;&#x5728;&#x8FD9;&#x4E00;&#x7BC7;&#x4E2D;&#xFF0C;&#x4F1A;&#x4ECE;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x51FA;&#x53D1;&#xFF0C;&#x9010;&#x6B65;&#x6539;&#x8FDB;&#xFF0C;&#x5F97;&#x5230;&#x652F;&#x6301;&#x5411;&#x91CF;&#x673A;&#x7684;&#x7B97;&#x6CD5;&#x3002;</p>
        <center>
          <p>......</p>
          <nav class="pagination">
          
            <a href="/articles/4/" class="pagination-prev"><big><b>查看原文</b></big></a>
          
          </nav>

        </center>
      
    </div>

  </div>

  <div class="article-footer">
    <div class="article-meta pull-left">

    
      

    <span class="post-categories">
      <i class="icon-categories"></i>
        <a href="/categories/学习笔记/">学习笔记</a>
    </span>
    

    
    

    <span class="post-tags">
      <i class="icon-tags"></i>
        <a href="/tags/机器学习/">机器学习</a><a href="/tags/Coursera/">Coursera</a><a href="/tags/支持向量机（SVM）/">支持向量机（SVM）</a>
    </span>
    

    </div>

    
  </div>
</article>



  <article>

  
    
    <h3 class="article-title"><a href="/articles/3/"><span>Coursera《机器学习》学习笔记（三）：算法评估篇</span></a></h3>
    
  

  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/articles/3/" rel="bookmark">
        <time class="entry-date published" datetime="2018-01-10T18:00:00.000Z">
          2018-01-11
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <p>&#x4E3A;&#x4EC0;&#x4E48;&#x8DDD;&#x79BB;&#x4E0A;&#x4E00;&#x7BC7;&#x603B;&#x7ED3;&#x4F1A;&#x8FC7;&#x4E86;&#x8FD9;&#x4E48;&#x4E45;&#x5462;&#xFF0C;&#x56E0;&#x4E3A;&#x4F5C;&#x4E1A;&#x548C;&#x8003;&#x8BD5;&#x592A;&#x591A;&#x2026;&#x2026;</p>
<p>&#x8FD9;&#x5B66;&#x671F;&#x9009;&#x4E86;&#x9AD8;&#x7EA7;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x8BFE;&#xFF0C;&#x8BFE;&#x7A0B;&#x7684;&#x5927;&#x4F5C;&#x4E1A;&#x662F;&#x6307;&#x5B9A;&#x53C2;&#x52A0;CCF&#x7684;&#x5927;&#x6570;&#x636E;&#x7ADE;&#x8D5B;&#xFF0C;&#x7136;&#x540E;&#x521D;&#x751F;&#x725B;&#x728A;&#x4E0D;&#x6015;&#x864E;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x5149;&#x77E5;&#x9053;&#x8FD9;&#x56DB;&#x4E2A;&#x5B57;&#x7684;&#x6211;&#x5355;&#x67AA;&#x5339;&#x9A6C;&#x5730;&#x6740;&#x4E86;&#x8FDB;&#x53BB;&#xFF0C;&#x7136;&#x540E;&#x88AB;&#x8650;&#x5F97;&#x9F3B;&#x9752;&#x8138;&#x80BF;&#x3002;&#x773C;&#x770B;&#x7740;&#x7FA4;&#x91CC;&#x7684;&#x5927;&#x795E;&#x4E00;&#x4E2A;&#x4E2A;&#x54C0;&#x568E;&#x4E0D;&#x4F1A;&#x505A;&#x4E0D;&#x4F1A;&#x505A;&#x5206;&#x6570;&#x592A;&#x4F4E;&#x5206;&#x6570;&#x592A;&#x4F4E;&#xFF0C;&#x7ED3;&#x679C;&#x6210;&#x7EE9;&#x51FA;&#x6765;&#x6BD4;&#x8C01;&#x90FD;&#x597D;&#xFF0C;&#x50CF;&#x6211;&#x8FD9;&#x6837;&#x7684;&#x5C31;&#x89C9;&#x5F97;&#x2026;&#x2026;</p>
<p><img src="/images/buddha-is-compassionate.jpg" alt></p>
<p>&#x53CD;&#x6B63;&#x662F;&#x77E5;&#x8BC6;&#x8DDF;&#x7ECF;&#x9A8C;&#x6CA1;&#x5B66;&#x5230;&#x591A;&#x5C11;&#xFF0C;&#x6F14;&#x6280;&#x5927;&#x6709;&#x957F;&#x8FDB;&#x3002;&#x8FD9;&#x5468;&#x4E8C;&#x665A;&#x4E0A;&#x5927;&#x4F5C;&#x4E1A;&#x7B54;&#x8FA9;&#xFF0C;&#x53F0;&#x4E0B;&#x8001;&#x5E08;&#x5F20;&#x53E3;&#x5C31;&#x662F;&#x4E00;&#x53E5;&#x56FD;&#x79D1;&#x5927;&#x7684;&#x5B66;&#x751F;&#x80FD;&#x529B;&#x5E94;&#x8BE5;&#x5F88;&#x5F3A;&#x7684;&#xFF0C;&#x8FD9;&#x79CD;&#x6BD4;&#x8D5B;&#x6211;&#x4EEC;&#x7684;&#x540D;&#x6B21;&#x5E94;&#x8BE5;&#x5F88;&#x597D;&#x7684;&#x3002;&#x5C31;&#x89C9;&#x5F97;&#x5B9E;&#x5728;&#x662F;&#x65E0;&#x989C;&#x4EE5;&#x5BF9;&#xFF0C;&#x7ED9;&#x5927;&#x4F6C;&#x4EEC;&#x62D6;&#x540E;&#x817F;&#x4E86;&#x2026;&#x2026;</p>
<p><img src="/images/i-can-do-nothing.jpg" alt></p>
<p>&#x8FD9;&#x4E00;&#x7BC7;&#x662F;<a href="https://www.coursera.org/learn/machine-learning" target="_blank" rel="external">&#x300A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x300B;</a>&#x7B2C;&#x516D;&#x5468;&#x77E5;&#x8BC6;&#x70B9;&#x7684;&#x603B;&#x7ED3;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x201C;&#x4E8B;&#x540E;&#x68C0;&#x67E5;&#x201D;&#xFF0C;&#x4E3B;&#x8981;&#x6D89;&#x53CA;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x7684;&#x8BC4;&#x4F30;&#x3001;&#x53D1;&#x73B0;&#x95EE;&#x9898;&#x540E;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</p>
        <center>
          <p>......</p>
          <nav class="pagination">
          
            <a href="/articles/3/" class="pagination-prev"><big><b>查看原文</b></big></a>
          
          </nav>

        </center>
      
    </div>

  </div>

  <div class="article-footer">
    <div class="article-meta pull-left">

    
      

    <span class="post-categories">
      <i class="icon-categories"></i>
        <a href="/categories/学习笔记/">学习笔记</a>
    </span>
    

    
    

    <span class="post-tags">
      <i class="icon-tags"></i>
        <a href="/tags/机器学习/">机器学习</a><a href="/tags/Coursera/">Coursera</a>
    </span>
    

    </div>

    
  </div>
</article>




<nav class="pagination">
  
  
  <a href="/page/2/" class="pagination-next">下一页</a>
  
</nav>
    </main>

    <footer class="site-footer">
  <p class="site-info">
    Proudly powered by <a href="https://hexo.io/" target="_blank">Hexo</a> and
    Theme by <a href="https://github.com/kawaiiQ/kawaiiHacker" target="_blank">kawaiiHacker</a>
    <br>
    
    &copy; 2019 _kawaiiQ
    
  </p>
</footer>
    
    
<script>
  widget_settings = {
    maxDistance: 15,
    sensitive: 0.01
  };
</script>
<script src="/js/logo-widget.js"></script>



<script type="text/x-mathjax-config">
  MathJax.Hub.Config({
    tex2jax: {
      inlineMath: [['$','$'], ["\\(","\\)"] ],
      processEscapes: true
    }
  });
</script>
<script type="text/javascript" async src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/MathJax.js?config=TeX-MML-AM_CHTML">
</script>


  </div>
</div><!-- hexo-inject:begin --><!-- hexo-inject:end -->
</body>
</html>