<!DOCTYPE HTML>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
  <!-- hexo-inject:begin --><!-- hexo-inject:end --><meta charset="utf-8">
  
  <title>Coursera《机器学习》学习笔记（五）：PCA、K均值与高斯分布篇 | _kawaiiQ&#39;s blog</title>

  
  <meta name="author" content="_kawaiiQ">
  

  
  <meta name="description" content="&amp;#x4E3A;&amp;#x4EC0;&amp;#x4E48;&amp;#x8DDD;&amp;#x79BB;&amp;#x4E0A;&amp;#x4E00;&amp;#x7BC7;&amp;#x53C8;&amp;#x95F4;&amp;#x65AD;&amp;#x4E86;&amp;#x8FD9;&amp;#x4E48;&amp;#x4E45;&amp;#x5462;&amp;#xFF0C;&amp;#x56E0;&amp;#x4E3A;&amp;#x53C8;&amp;#x9047;&amp;#x5230;&amp;#x8003;&amp;#x8BD5;&amp;#x4E86;&amp;#xFF0C;&amp;#x800C;&amp;#x4E14;&amp;#x6700;&amp;#x540E;&amp;#x4E00;&amp;#x5468;&amp;#x8FDE;&amp;#x8003;&amp;#x4E09;&amp;#x95E8;&amp;#x5B66;&amp;#x4F4D;&amp;#x8BFE;&amp;#xFF0C;&amp;#x751A;&amp;#x4E3A;&amp;#x9178;&amp;#x723D;&amp;#x3002;&amp;#x90A3;&amp;#x53E5;&amp;#x8BDD;&amp;#x600E;&amp;#x4E48;&amp;#x8BB2;&amp;#x7684;&amp;#xFF0C;&amp;#x73B0;&amp;#x5728;&amp;#x8003;&amp;#x8BD5;&amp;#x6D41;&amp;#x7684;&amp;#x6CEA;&amp;#x90FD;&amp;#x662F;&amp;#x5F53;&amp;#x521D;&amp;#x9009;&amp;#x8BFE;&amp;#x8111;&amp;#x5B50;&amp;#x8FDB;&amp;#x7684;&amp;#x6C34;&amp;#x3002;&amp;#x8FD9;&amp;#x79CD;&amp;#x8003;&amp;#x7406;&amp;#x8BBA;&amp;#x63A8;&amp;#x516C;&amp;#x5F0F;&amp;#x7684;&amp;#x786C;&amp;#x8BFE;&amp;#xFF0C;&amp;#x5BF9;&amp;#x4E8E;&amp;#x6570;&amp;#x5B66;&amp;#x57FA;&amp;#x7840;&amp;#x672C;&amp;#x6765;&amp;#x5C31;&amp;#x662F;&amp;#x6587;&amp;#x79D1;&amp;#x751F;&amp;#x6C34;&amp;#x5E73;&amp;#x7684;&amp;#x6211;&amp;#x6765;&amp;#x8BF4;&amp;#xFF0C;&amp;#x57FA;&amp;#x672C;&amp;#x5C31;&amp;#x770B;&amp;#x8001;&amp;#x5E08;&amp;#x613F;&amp;#x4E0D;&amp;#x613F;&amp;#x610F;&amp;#x770B;&amp;#x5728;&amp;#x6D53;&amp;#x6D53;&amp;#x5E08;&amp;#x751F;&amp;#x60C5;&amp;#x7684;&amp;#x4EFD;&amp;#x4E0A;&amp;#x62AC;&amp;#x6211;&amp;#x4E00;&amp;#x624B;&amp;#x4E86;&amp;#x2026;&amp;#x2026;
&amp;#x4F5C;&amp;#x4E3A;&amp;#x5B66;&amp;#x9165;&amp;#x771F;&amp;#x662F;&amp;#x60E8;&amp;#xFF0C;&amp;#x8003;&amp;#x5F97;&amp;#x5B66;&amp;#x6E23;&amp;#x4E00;&amp;#x6837;&amp;#x7684;&amp;#x6210;&amp;#x7EE9;&amp;#x8FD8;&amp;#x8981;&amp;#x88AB;&amp;#x4EBA;&amp;#x55B7;&amp;#x662F;&amp;#x5B66;&amp;#x5A4A;&amp;#x2026;&amp;#x2026;

&amp;#x8FD9;&amp;#x4E00;&amp;#x7BC7;&amp;#x662F;&amp;#x300A;&amp;#x673A;&amp;#x5668;&amp;#x5B66;&amp;#x4E60;&amp;#x300B;&amp;#x7B2C;&amp;#x516B;&amp;#x5468;&amp;#x5230;&amp;#x7B2C;&amp;#x4E5D;&amp;#x5468;&amp;#x524D;&amp;#x534A;&amp;#x90E8;&amp;#x5206;&amp;#x77E5;&amp;#x8BC6;&amp;#x70B9;&amp;#x7684;&amp;#x603B;&amp;#x7ED3;&amp;#xFF0C;&amp;#x4E3B;&amp;#x8981;&amp;#x4ECB;&amp;#x7ECD;&amp;#x4E86;&amp;#x65E0;&amp;#x76D1;&amp;#x7763;&amp;#x5B66;&amp;#x4E60;&amp;#x7684;&amp;#x4E24;&amp;#x79CD;&amp;#x7B97;&amp;#x6CD5;&amp;#xFF1A;K&amp;#x5747;&amp;#x503C;&amp;#x548C;&amp;#x9AD8;&amp;#x65AF;&amp;#x5206;&amp;#x5E03;&amp;#xFF0C;&amp;#x548C;&amp;#x7EF4;&amp;#x5EA6;&amp;#x7EA6;&amp;#x51CF;&amp;#x7684;&amp;#x7B97;&amp;#x6CD5;&amp;#xFF1A;&amp;#x4E3B;&amp;#x6210;&amp;#x5206;&amp;#x5206;&amp;#x6790;&amp;#x3002;&amp;#x672C;&amp;#x7BC7;&amp;#x7684;&amp;#x65E0;&amp;#x76D1;&amp;#x7763;&amp;#x5B66;&amp;#x4E60;&amp;#x6D89;&amp;#x53CA;&amp;#x7684;&amp;#x95EE;&amp;#x9898;&amp;#x662F;&amp;#x805A;&amp;#x7C7B;&amp;#x95EE;&amp;#x9898;&amp;#x548C;&amp;#x5F02;&amp;#x5E38;&amp;#x68C0;&amp;#x6D4B;&amp;#x95EE;&amp;#x9898;&amp;#xFF0C;&amp;#x524D;&amp;#x8005;&amp;#x662F;&amp;#x5C06;&amp;#x539F;&amp;#x59CB;&amp;#x6570;&amp;#x636E;&amp;#x8FDB;&amp;#x884C;&amp;#x5212;&amp;#x5206;&amp;#xFF0C;&amp;#x540E;&amp;#x8005;&amp;#x662F;&amp;#x5728;&amp;#x4F7F;&amp;#x7528;&amp;#x5927;&amp;#x91CF;&amp;#x201C;&amp;#x6B63;&amp;#x5E38;&amp;#x201D;&amp;#x6570;&amp;#x636E;&amp;#x8FDB;&amp;#x884C;&amp;#x8BAD;&amp;#x7EC3;&amp;#x540E;&amp;#xFF0C;&amp;#x7ED9;&amp;#x51FA;&amp;#x4E00;&amp;#x4E2A;&amp;#x65B0;&amp;#x7684;&amp;#x6837;&amp;#x672C;&amp;#xFF0C;&amp;#x5224;&amp;#x65AD;&amp;#x8BE5;&amp;#x6837;&amp;#x672C;&amp;#x662F;&amp;#x5426;&amp;#x51FA;&amp;#x73B0;&amp;#x201C;&amp;#x5F02;&amp;#x5E38;&amp;#x201D;&amp;#x3002;">
  

  
  
  <meta name="keywords" content="机器学习,Coursera">
  

  <meta id="viewport" name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no, minimal-ui">
  <meta name="apple-mobile-web-app-capable" content="yes">
  <meta name="apple-mobile-web-app-status-bar-style" content="black">

  <meta property="og:title" content="Coursera《机器学习》学习笔记（五）：PCA、K均值与高斯分布篇">

  <meta property="og:site_name" content="_kawaiiQ&#39;s blog">

  
  <meta property="og:image" content="/favicon.ico">
  

  <link href="/favicon.ico" rel="icon">
  <link rel="alternate" href="/atom.xml" title="_kawaiiQ&#39;s blog" type="application/atom+xml">
  <link rel="stylesheet" href="/css/style.css" media="screen" type="text/css">

  <link rel="dns-prefetch" href="https://cdnjs.cloudflare.com"><!-- hexo-inject:begin --><!-- hexo-inject:end -->

</head>


<body>
<!-- hexo-inject:begin --><!-- hexo-inject:end --><div class="blog">
  <div class="content">

    <header>
  <div class="site-branding">
    <h1 class="site-logo">
      <div>
        <a href="/"><img src="/images/logo.png"></a>
        
          <a href="/"><img id="logo-widget" src="/images/widget.png"></a>
        
      </div>
    </h1>
    <p class="site-description">Blind Busy All Day</p>
  </div>
  <nav class="site-navigation">
    <ul>
      
        <li><a href="/">主页</a></li>
      
        <li><a href="/categories">分类</a></li>
      
        <li><a href="/archives">所有文章</a></li>
      
        <li><a href="/about">关于我</a></li>
      
    </ul>
  </nav>
</header>

    <main class="site-main posts-loop">
    <article>

  
    
    <h3 class="article-title"><span>Coursera《机器学习》学习笔记（五）：PCA、K均值与高斯分布篇</span></h3>
    
  

  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/articles/5/" rel="bookmark">
        <time class="entry-date published" datetime="2018-02-01T16:45:21.000Z">
          2018-02-02
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <p>&#x4E3A;&#x4EC0;&#x4E48;&#x8DDD;&#x79BB;&#x4E0A;&#x4E00;&#x7BC7;&#x53C8;&#x95F4;&#x65AD;&#x4E86;&#x8FD9;&#x4E48;&#x4E45;&#x5462;&#xFF0C;&#x56E0;&#x4E3A;&#x53C8;&#x9047;&#x5230;&#x8003;&#x8BD5;&#x4E86;&#xFF0C;&#x800C;&#x4E14;&#x6700;&#x540E;&#x4E00;&#x5468;&#x8FDE;&#x8003;&#x4E09;&#x95E8;&#x5B66;&#x4F4D;&#x8BFE;&#xFF0C;&#x751A;&#x4E3A;&#x9178;&#x723D;&#x3002;&#x90A3;&#x53E5;&#x8BDD;&#x600E;&#x4E48;&#x8BB2;&#x7684;&#xFF0C;&#x73B0;&#x5728;&#x8003;&#x8BD5;&#x6D41;&#x7684;&#x6CEA;&#x90FD;&#x662F;&#x5F53;&#x521D;&#x9009;&#x8BFE;&#x8111;&#x5B50;&#x8FDB;&#x7684;&#x6C34;&#x3002;&#x8FD9;&#x79CD;&#x8003;&#x7406;&#x8BBA;&#x63A8;&#x516C;&#x5F0F;&#x7684;&#x786C;&#x8BFE;&#xFF0C;&#x5BF9;&#x4E8E;&#x6570;&#x5B66;&#x57FA;&#x7840;&#x672C;&#x6765;&#x5C31;&#x662F;&#x6587;&#x79D1;&#x751F;&#x6C34;&#x5E73;&#x7684;&#x6211;&#x6765;&#x8BF4;&#xFF0C;&#x57FA;&#x672C;&#x5C31;&#x770B;&#x8001;&#x5E08;&#x613F;&#x4E0D;&#x613F;&#x610F;&#x770B;&#x5728;&#x6D53;&#x6D53;&#x5E08;&#x751F;&#x60C5;&#x7684;&#x4EFD;&#x4E0A;&#x62AC;&#x6211;&#x4E00;&#x624B;&#x4E86;&#x2026;&#x2026;</p>
<p>&#x4F5C;&#x4E3A;&#x5B66;&#x9165;&#x771F;&#x662F;&#x60E8;&#xFF0C;&#x8003;&#x5F97;&#x5B66;&#x6E23;&#x4E00;&#x6837;&#x7684;&#x6210;&#x7EE9;&#x8FD8;&#x8981;&#x88AB;&#x4EBA;&#x55B7;&#x662F;&#x5B66;&#x5A4A;&#x2026;&#x2026;</p>
<p><img src="/images/give-me-a-knife.jpg" alt></p>
<p>&#x8FD9;&#x4E00;&#x7BC7;&#x662F;<a href="https://www.coursera.org/learn/machine-learning" target="_blank" rel="external">&#x300A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x300B;</a>&#x7B2C;&#x516B;&#x5468;&#x5230;&#x7B2C;&#x4E5D;&#x5468;&#x524D;&#x534A;&#x90E8;&#x5206;&#x77E5;&#x8BC6;&#x70B9;&#x7684;&#x603B;&#x7ED3;&#xFF0C;&#x4E3B;&#x8981;&#x4ECB;&#x7ECD;&#x4E86;&#x65E0;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x7684;&#x4E24;&#x79CD;&#x7B97;&#x6CD5;&#xFF1A;K&#x5747;&#x503C;&#x548C;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#xFF0C;&#x548C;&#x7EF4;&#x5EA6;&#x7EA6;&#x51CF;&#x7684;&#x7B97;&#x6CD5;&#xFF1A;&#x4E3B;&#x6210;&#x5206;&#x5206;&#x6790;&#x3002;&#x672C;&#x7BC7;&#x7684;&#x65E0;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x6D89;&#x53CA;&#x7684;&#x95EE;&#x9898;&#x662F;&#x805A;&#x7C7B;&#x95EE;&#x9898;&#x548C;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x95EE;&#x9898;&#xFF0C;&#x524D;&#x8005;&#x662F;&#x5C06;&#x539F;&#x59CB;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x5212;&#x5206;&#xFF0C;&#x540E;&#x8005;&#x662F;&#x5728;&#x4F7F;&#x7528;&#x5927;&#x91CF;&#x201C;&#x6B63;&#x5E38;&#x201D;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#x540E;&#xFF0C;&#x7ED9;&#x51FA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x6837;&#x672C;&#xFF0C;&#x5224;&#x65AD;&#x8BE5;&#x6837;&#x672C;&#x662F;&#x5426;&#x51FA;&#x73B0;&#x201C;&#x5F02;&#x5E38;&#x201D;&#x3002;</p>
<a id="more"></a>
<h2 id="&#x4E3B;&#x8981;&#x5185;&#x5BB9;"><a href="#&#x4E3B;&#x8981;&#x5185;&#x5BB9;" class="headerlink" title="&#x4E3B;&#x8981;&#x5185;&#x5BB9;"></a>&#x4E3B;&#x8981;&#x5185;&#x5BB9;</h2><ul>
<li>&#x4E3B;&#x6210;&#x5206;&#x5206;&#x6790;</li>
<li>K&#x5747;&#x503C;</li>
<li>&#x591A;&#x5143;&#x9AD8;&#x65AF;&#x5206;&#x5E03;</li>
</ul>
<p><br></p>
<h2 id="&#x4E3B;&#x6210;&#x5206;&#x5206;&#x6790;"><a href="#&#x4E3B;&#x6210;&#x5206;&#x5206;&#x6790;" class="headerlink" title="&#x4E3B;&#x6210;&#x5206;&#x5206;&#x6790;"></a>&#x4E3B;&#x6210;&#x5206;&#x5206;&#x6790;</h2><p>&#x5728;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x4E2D;&#xFF0C;&#x5F80;&#x5F80;&#x8981;&#x5904;&#x7406;&#x5927;&#x91CF;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x6837;&#x672C;&#x70B9;&#x7684;&#x7EF4;&#x5EA6;&#x662F;&#x5F88;&#x9AD8;&#x7684;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x663E;&#x7136;&#x7684;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x662F;&#xFF0C;&#x7279;&#x5F81;&#x6570;&#x91CF;&#x8D8A;&#x591A;&#xFF0C;&#x6570;&#x636E;&#x5360;&#x7528;&#x7684;&#x7A7A;&#x95F4;&#x4E5F;&#x5C31;&#x8D8A;&#x591A;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x5904;&#x7406;&#x8D77;&#x6765;&#x4E5F;&#x5C31;&#x8D8A;&#x6162;&#x3002;&#x5F53;&#x7279;&#x5F81;&#x6570;&#x91CF;&#x975E;&#x5E38;&#x591A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x9700;&#x8981;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x5C31;&#x5F88;&#x5927;&#xFF0C;&#x800C;&#x8FDB;&#x884C;&#x5B66;&#x4E60;&#x4E5F;&#x4F1A;&#x5F88;&#x6162;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x7EF4;&#x6570;&#x7EA6;&#x51CF;&#xFF08;Dimensionality Reduction&#xFF09;&#x6765;&#x51CF;&#x5C11;&#x7279;&#x5F81;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x5373;&#x51CF;&#x5C0F;&#x8F93;&#x5165;&#x7684;&#x7EF4;&#x5EA6;&#xFF0C;&#x4EE5;&#x8282;&#x7EA6;&#x7A7A;&#x95F4;&#xFF0C;&#x52A0;&#x5FEB;&#x8FD0;&#x7B97;&#x901F;&#x5EA6;&#xFF0C;&#x4F46;&#x540C;&#x65F6;&#x4F9D;&#x7136;&#x80FD;&#x4FDD;&#x6301;&#x8F83;&#x597D;&#x7684;&#x5B66;&#x4E60;&#x6548;&#x679C;&#x3002;&#x867D;&#x7136;&#x8BFE;&#x7A0B;&#x91CC;&#x628A;&#x7EF4;&#x5EA6;&#x7EA6;&#x51CF;&#x7B97;&#x4F5C;&#x662F;&#x65E0;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x4E2D;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4E2A;&#x4EBA;&#x8BA4;&#x4E3A;&#x8FD9;&#x5176;&#x5B9E;&#x662F;&#x5904;&#x7406;&#x6570;&#x636E;&#x7684;&#x4E00;&#x79CD;&#x624B;&#x6BB5;&#xFF0C;&#x5E76;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x7528;&#x4E8E;&#x65E0;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x4E2D;&#x7528;&#x4E8E;&#x538B;&#x7F29;&#x6570;&#x636E;&#x3002;</p>
<h3 id="&#x5197;&#x4F59;&#x7279;&#x5F81;"><a href="#&#x5197;&#x4F59;&#x7279;&#x5F81;" class="headerlink" title="&#x5197;&#x4F59;&#x7279;&#x5F81;"></a>&#x5197;&#x4F59;&#x7279;&#x5F81;</h3><p>&#x5F88;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x5F53;&#x7279;&#x5F81;&#x6570;&#x91CF;&#x975E;&#x5E38;&#x591A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x56E0;&#x4E3A;&#x79CD;&#x79CD;&#x539F;&#x56E0;&#x51FA;&#x73B0;&#x4E00;&#x4E9B;&#x5197;&#x4F59;&#x7684;&#x7279;&#x5F81;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x9884;&#x6D4B;&#x623F;&#x4EF7;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x623F;&#x5B50;&#x7684;&#x5E73;&#x65B9;&#x7C73;&#x4E3A;&#x5355;&#x4F4D;&#x7684;&#x9762;&#x79EF;&#x548C;&#x5E73;&#x65B9;&#x82F1;&#x5C3A;&#x4E3A;&#x5355;&#x4F4D;&#x7684;&#x9762;&#x79EF;&#x8FD9;&#x4E24;&#x8005;&#x5C31;&#x663E;&#x7136;&#x591A;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x5197;&#x4F59;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x56E0;&#x4E3A;&#x4E24;&#x8005;&#x8868;&#x793A;&#x7684;&#x5B9E;&#x9645;&#x4E0A;&#x90FD;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x7279;&#x5F81;&#x2014;&#x2014;&#x9762;&#x79EF;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x5728;&#x56E2;&#x961F;&#x5408;&#x4F5C;&#x4E2D;&#x5C31;&#x6709;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x3002;&#x4F8B;&#x5982;&#x4E00;&#x4E2A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x9879;&#x76EE;&#x7684;&#x7279;&#x5F81;&#x53EF;&#x80FD;&#x7531;&#x591A;&#x4E2A;&#x56E2;&#x961F;&#x5171;&#x540C;&#x63D0;&#x4F9B;&#xFF0C;&#x4E8E;&#x662F;&#x5C31;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x4E0D;&#x540C;&#x56E2;&#x961F;&#x63D0;&#x4F9B;&#x7684;&#x7279;&#x5F81;&#x91CC;&#x6709;&#x91CD;&#x590D;&#x7684;&#x7279;&#x5F81;&#x7684;&#x60C5;&#x51B5;&#x3002;</p>
<p>&#x5197;&#x4F59;&#x7684;&#x7279;&#x5F81;&#x5BF9;&#x4E8E;&#x63D0;&#x9AD8;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x6548;&#x679C;&#x5E76;&#x6CA1;&#x6709;&#x5E2E;&#x52A9;&#xFF0C;&#x53CD;&#x800C;&#x4F1A;&#x589E;&#x52A0;&#x65F6;&#x95F4;&#x548C;&#x7A7A;&#x95F4;&#x7684;&#x5F00;&#x9500;&#xFF0C;&#x56E0;&#x6B64;&#x9700;&#x8981;&#x53BB;&#x6389;&#x3002;</p>
<h3 id="&#x6295;&#x5F71;"><a href="#&#x6295;&#x5F71;" class="headerlink" title="&#x6295;&#x5F71;"></a>&#x6295;&#x5F71;</h3><p>&#x66F4;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E00;&#x4E9B;&#x7279;&#x5F81;&#x5E76;&#x4E0D;&#x662F;&#x5B8C;&#x5168;&#x5197;&#x4F59;&#x7684;&#xFF0C;&#x800C;&#x662F;&#x76F8;&#x4E92;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x4E00;&#x5B9A;&#x76F8;&#x4E92;&#x5F71;&#x54CD;&#x7684;&#x5173;&#x7CFB;&#x4F46;&#x5E76;&#x4E0D;&#x80FD;&#x5B8C;&#x5168;&#x66FF;&#x4EE3;&#x5BF9;&#x65B9;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x80FD;&#x591F;&#x5C06;&#x6570;&#x636E;&#x964D;&#x7EF4;&#x7684;&#x540C;&#x65F6;&#x4F9D;&#x7136;&#x4FDD;&#x6301;&#x4E0D;&#x540C;&#x6837;&#x672C;&#x95F4;&#x826F;&#x597D;&#x7684;&#x533A;&#x5206;&#x5EA6;&#x3002;&#x505A;&#x6CD5;&#x5C31;&#x662F;&#xFF0C;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x4F4E;&#x7EF4;&#x5E73;&#x9762;&#xFF08;&#x76F4;&#x7EBF;&#xFF09;&#x4E0A;&#xFF0C;&#x4F7F;&#x5F97;&#x6570;&#x636E;&#x6295;&#x5F71;&#x5230;&#x8BE5;&#x5E73;&#x9762;&#xFF08;&#x76F4;&#x7EBF;&#xFF09;&#x4E0A;&#x4F9D;&#x7136;&#x80FD;&#x591F;&#x4FDD;&#x6301;&#x826F;&#x597D;&#x7684;&#x533A;&#x5206;&#x5EA6;&#x3002;</p>
<p>&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x6570;&#x636E;&#xFF1A;</p>
<img src="/articles/5/pic1.jpg" alt="&#x4F8B;&#x5B50;" title="&#x4F8B;&#x5B50;">
<p>&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x5C06;&#x6570;&#x636E;&#x964D;&#x81F3;&#x4E00;&#x7EF4;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5C31;&#x5C06;&#x6240;&#x6709;&#x70B9;&#x6295;&#x5F71;&#x5230;&#x8FD9;&#x4E00;&#x6761;&#x76F4;&#x7EBF;&#x4E0A;&#xFF1A;</p>
<img src="/articles/5/pic2.jpg" alt="&#x4F8B;&#x5B50;" title="&#x4F8B;&#x5B50;">
<p>&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x6295;&#x5F71;&#x540E;&#xFF0C;&#x65E2;&#x964D;&#x4F4E;&#x4E86;&#x7EF4;&#x5EA6;&#xFF0C;&#x53C8;&#x6700;&#x5927;&#x5730;&#x4FDD;&#x6301;&#x4E86;&#x5404;&#x6837;&#x672C;&#x95F4;&#x7684;&#x53EF;&#x533A;&#x5206;&#x5EA6;&#x3002;&#x5728;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x4E2D;&#xFF0C;&#x901A;&#x5E38;&#x662F;&#x5C06;&#x66F4;&#x9AD8;&#x7EF4;&#x7684;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x964D;&#x7EF4;&#x3002;</p>
<h3 id="&#x4E3B;&#x6210;&#x5206;&#x5206;&#x6790;&#xFF08;Principal-Component-Analysis&#xFF0C;&#x7B80;&#x79F0;PCA&#xFF09;"><a href="#&#x4E3B;&#x6210;&#x5206;&#x5206;&#x6790;&#xFF08;Principal-Component-Analysis&#xFF0C;&#x7B80;&#x79F0;PCA&#xFF09;" class="headerlink" title="&#x4E3B;&#x6210;&#x5206;&#x5206;&#x6790;&#xFF08;Principal Component Analysis&#xFF0C;&#x7B80;&#x79F0;PCA&#xFF09;"></a>&#x4E3B;&#x6210;&#x5206;&#x5206;&#x6790;&#xFF08;Principal Component Analysis&#xFF0C;&#x7B80;&#x79F0;PCA&#xFF09;</h3><p>&#x4E3B;&#x6210;&#x5206;&#x5206;&#x6790;&#x6240;&#x505A;&#x7684;&#x5C31;&#x662F;&#x4E0A;&#x9762;&#x6240;&#x4ECB;&#x7ECD;&#x7684;&#x6295;&#x5F71;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x4EE5;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x6765;&#x8BB2;&#xFF1A;</p>
<img src="/articles/5/pic2.jpg" alt="&#x597D;&#x7684;&#x4F8B;&#x5B50;" title="&#x597D;&#x7684;&#x4F8B;&#x5B50;">
<p>&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x9009;&#x53D6;&#x4E86;&#x4E00;&#x6761;&#x5F88;&#x597D;&#x7684;&#x76F4;&#x7EBF;&#x3002;</p>
<img src="/articles/5/pic3.jpg" alt="&#x574F;&#x7684;&#x4F8B;&#x5B50;" title="&#x574F;&#x7684;&#x4F8B;&#x5B50;">
<p>&#x8FD9;&#x6761;&#x76F4;&#x7EBF;&#x9009;&#x62E9;&#x7684;&#x5C31;&#x5F88;&#x4E0D;&#x597D;&#x3002;</p>
<p>&#x89C2;&#x5BDF;&#x4E0A;&#x9762;&#x597D;&#x7684;&#x4F8B;&#x5B50;&#x548C;&#x574F;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x4E0D;&#x96BE;&#x53D1;&#x73B0;&#xFF0C;&#x5728;&#x597D;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x5404;&#x70B9;&#x5230;&#x76F4;&#x7EBF;&#x7684;&#x8DDD;&#x79BB;&#x6BD4;&#x574F;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#x8981;&#x77ED;&#x3002;&#x800C;&#x4E3B;&#x6210;&#x5206;&#x5206;&#x6790;&#x6240;&#x8981;&#x627E;&#x7684;&#x76F4;&#x7EBF;&#xFF0C;&#x5C31;&#x662F;&#x662F;&#x5404;&#x70B9;&#x5230;&#x5176;&#x8DDD;&#x79BB;&#x6700;&#x77ED;&#x7684;&#x90A3;&#x6761;&#x76F4;&#x7EBF;&#x6216;&#x5E73;&#x9762;&#x3002;&#x4ECE;&#x6570;&#x5B66;&#x4E0A;&#x7CBE;&#x786E;&#x5730;&#x5B9A;&#x4E49;&#xFF0C;&#x5176;&#x5B9E;&#x662F;&#x6700;&#x5C0F;&#x5316;&#x5E73;&#x65B9;&#x6295;&#x5F71;&#x8BEF;&#x5DEE;&#xFF0C;&#x5728;&#x540E;&#x9762;&#x4F1A;&#x5177;&#x4F53;&#x8BF4;&#x660E;&#x3002;</p>
<h4 id="&#x6570;&#x636E;&#x9884;&#x5904;&#x7406;"><a href="#&#x6570;&#x636E;&#x9884;&#x5904;&#x7406;" class="headerlink" title="&#x6570;&#x636E;&#x9884;&#x5904;&#x7406;"></a>&#x6570;&#x636E;&#x9884;&#x5904;&#x7406;</h4><p>&#x5728;&#x8FDB;&#x884C;&#x4E3B;&#x6210;&#x5206;&#x5206;&#x6790;&#x4E4B;&#x524D;&#xFF0C;&#x901A;&#x5E38;&#x9700;&#x8981;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x9884;&#x5904;&#x7406;&#xFF0C;&#x4E00;&#x822C;&#x4F1A;&#x5148;&#x8FDB;&#x884C;&#x5747;&#x503C;&#x5F52;&#x4E00;&#x5316;&#xFF08;Mean Normalization&#xFF09;&#x6216;&#x8005;&#x7279;&#x5F81;&#x7F29;&#x653E;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x5747;&#x503C;&#x5F52;&#x4E00;&#x5316;&#xFF0C;&#x5176;&#x5904;&#x7406;&#x6B65;&#x9AA4;&#x5982;&#x4E0B;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x8BA1;&#x7B97;&#x6BCF;&#x4E2A;&#x7279;&#x5F81;&#x7684;&#x5747;&#x503C;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8F93;&#x5165;&#x6570;&#x636E;&#x6BCF;&#x4E2A;&#x7EF4;&#x5EA6;&#x5BF9;&#x5E94;&#x5206;&#x91CF;&#x4E0A;&#x7684;&#x5747;&#x503C;&#xFF0C;&#x6709;</p>
<script type="math/tex; mode=display">u_j = \frac{1}{m} \sum_{i=1}^m x_j^{(i)}</script><p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;<script type="math/tex">x^{(i)}</script>&#xFF0C;&#x4FEE;&#x6539;&#x6BCF;&#x4E2A;&#x5206;&#x91CF;<script type="math/tex">x_j^{(i)}</script>&#xFF0C;&#x6709;</p>
<script type="math/tex; mode=display">x_j^{(i)} = x_j^{(i)} - u_j</script><h4 id="&#x83B7;&#x53D6;&#x65B0;&#x7684;&#x7279;&#x5F81;"><a href="#&#x83B7;&#x53D6;&#x65B0;&#x7684;&#x7279;&#x5F81;" class="headerlink" title="&#x83B7;&#x53D6;&#x65B0;&#x7684;&#x7279;&#x5F81;"></a>&#x83B7;&#x53D6;&#x65B0;&#x7684;&#x7279;&#x5F81;</h4><p>&#x9996;&#x5148;&#xFF0C;&#x8BA1;&#x7B97;&#x534F;&#x65B9;&#x5DEE;&#x77E9;&#x9635;&#xFF08;Covariance Matrix&#xFF09;&#xFF0C;&#x6709;</p>
<script type="math/tex; mode=display">\Sigma = \frac{1}{m} \sum_{i=1}^m (x^{(i)})(x^{(i)})^T</script><p>&#x5BF9;&#x4E8E;&#x5411;&#x91CF;&#x5316;&#x7684;&#x7279;&#x5F81;&#x96C6;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x5F97;&#x5230;&#x534F;&#x65B9;&#x5DEE;</p>
<script type="math/tex; mode=display">\Sigma = \frac{1}{m} X^T X</script><p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x5BF9;&#x534F;&#x65B9;&#x5DEE;&#x77E9;&#x9635;&#x8FDB;&#x884C;&#x5947;&#x5F02;&#x503C;&#x5206;&#x89E3;&#xFF0C;&#x5F97;&#x5230;&#x5206;&#x89E3;&#x540E;&#x7684;&#x4E09;&#x90E8;&#x5206;&#xFF1A;<script type="math/tex">U</script>&#x3001;<script type="math/tex">S</script>&#x3001;<script type="math/tex">V</script>&#xFF0C;&#x5177;&#x4F53;&#x5206;&#x89E3;&#x5728;&#x5404;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#x6709;&#x5BF9;&#x5E94;&#x7684;&#x5E93;&#x6765;&#x8BA1;&#x7B97;&#xFF0C;&#x5728;Octave&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;<code>svd</code>&#x51FD;&#x6570;&#x8FDB;&#x884C;&#xFF0C;&#x8FD4;&#x56DE;&#x503C;&#x4E3A;<code>[U, S, V]</code>&#x3002;</p>
<p>&#x5176;&#x4E2D;&#xFF0C;&#x771F;&#x6B63;&#x9700;&#x8981;&#x7684;&#x662F;&#x77E9;&#x9635;<script type="math/tex">U</script>&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;<script type="math/tex">n \times n</script>&#x7684;&#x77E9;&#x9635;&#xFF0C;&#x4EE5;&#x5217;&#x4E3A;&#x5355;&#x4F4D;&#xFF0C;&#x6709;</p>
<script type="math/tex; mode=display">
U = \left[\begin{matrix}
\vert & \vert & \vert & \cdots & \vert \\
u^{(1)} & u^{(2)} & u^{(3)} & \cdots & u^{(n)} \\
\vert & \vert & \vert & \cdots & \vert \\
\end{matrix}\right] \in \mathbb{R}^{n \times n}</script><p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x5C06;&#x7EF4;&#x5EA6;&#x964D;&#x5230;<script type="math/tex">k</script>&#x7684;&#x8BDD;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x9009;&#x53D6;&#x524D;<script type="math/tex">k</script>&#x5217;&#xFF0C;&#x6784;&#x9020;&#x4E00;&#x4E2A;<script type="math/tex">n \times k</script>&#x7684;&#x77E9;&#x9635;&#xFF0C;&#x5F97;&#x5230;</p>
<script type="math/tex; mode=display">
U_{reduce} = \left[\begin{matrix}
\vert & \vert & \vert & \cdots & \vert \\
u^{(1)} & u^{(2)} & u^{(3)} & \cdots & u^{(k)} \\
\vert & \vert & \vert & \cdots & \vert \\
\end{matrix}\right] \in \mathbb{R}^{n \times k}</script><p>&#x63A5;&#x4E0B;&#x6765;&#x5229;&#x7528;<script type="math/tex">U_{reduce}</script>&#x6765;&#x5B9E;&#x73B0;&#x7EF4;&#x6570;&#x7EA6;&#x51CF;&#xFF0C;&#x5373;&#x901A;&#x8FC7;&#x53D8;&#x6362;&#xFF0C;&#x5B9E;&#x73B0;</p>
<script type="math/tex; mode=display">x^{(i)} \in \mathbb{R}^n \rightarrow z^{(i)} \in \mathbb{R}^k</script><p>&#x8BA1;&#x7B97;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x4EE4;</p>
<script type="math/tex; mode=display">z^{(i)} = U_{reduce}^Tx^{(i)}</script><p>&#x56E0;&#x4E3A;<script type="math/tex">U_reduce^T</script>&#x662F;<script type="math/tex">k \times n</script>&#x7684;&#x5411;&#x91CF;&#xFF0C;&#x800C;<script type="math/tex">x</script>&#x662F;<script type="math/tex">n \times 1</script>&#x7684;&#x5411;&#x91CF;&#xFF0C;&#x56E0;&#x6B64;<script type="math/tex">z</script>&#x662F;<script type="math/tex">k \times 1</script>&#x7684;&#x5411;&#x91CF;&#xFF0C;&#x5B9E;&#x73B0;&#x4E86;&#x964D;&#x7EF4;&#x3002;</p>
<p>&#x4E0D;&#x8FC7;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x7279;&#x5F81;&#x96C6;&#x90FD;&#x662F;&#x5411;&#x91CF;&#x5316;&#x540E;&#x7684;&#x7248;&#x672C;&#xFF0C;&#x4E4B;&#x524D;&#x63D0;&#x5230;&#x8FC7;&#xFF0C;&#x7279;&#x5F81;&#x96C6;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x8FD9;&#x4E2A;&#x6837;&#x5B50;</p>
<script type="math/tex; mode=display">X = \begin{bmatrix} (x^{(1)})^T \newline (x^{(2)})^T \newline \vdots \newline (x^{(m)})^T \newline \end{bmatrix}</script><p>&#x6240;&#x4EE5;&#xFF0C;&#x5B9E;&#x9645;&#x5B9E;&#x73B0;&#x7684;&#x53D8;&#x6362;&#x662F;</p>
<script type="math/tex; mode=display">X \in \mathbb{R}^{n \times n} \rightarrow Z \in \mathbb{R}^{n \times k}</script><p>&#x800C;&#x8BA1;&#x7B97;&#x4E3A;</p>
<script type="math/tex; mode=display">Z = XU_{reduce}</script><h4 id="&#x9009;&#x53D6;k&#x7684;&#x503C;"><a href="#&#x9009;&#x53D6;k&#x7684;&#x503C;" class="headerlink" title="&#x9009;&#x53D6;k&#x7684;&#x503C;"></a>&#x9009;&#x53D6;k&#x7684;&#x503C;</h4><p>&#x8FDB;&#x884C;PCA&#x7684;&#x8FC7;&#x7A0B;&#x9700;&#x8981;&#x9009;&#x53D6;&#x4E00;&#x4E2A;&#x5408;&#x9002;&#x7684;k&#x503C;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4E3B;&#x5143;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x7136;&#x800C;k&#x503C;&#x5E94;&#x8BE5;&#x600E;&#x4E48;&#x9009;&#x5462;&#xFF1F;</p>
<p>&#x4E3A;&#x4E86;&#x8FBE;&#x5230;&#x4E0A;&#x9762;&#x7684;&#x76EE;&#x7684;&#xFF0C;&#x9996;&#x5148;&#x6765;&#x89E3;&#x51B3;&#x53E6;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x901A;&#x8FC7;<script type="math/tex">U_{reduce}</script>&#xFF0C;&#x5C06;&#x4E00;&#x7EC4;&#x7279;&#x5F81;<script type="math/tex">x^{(i)}</script>&#x6295;&#x5F71;&#x5230;&#x4F4E;&#x7EF4;&#x7A7A;&#x95F4;&#x53D8;&#x6362;&#x6210;&#x4E86;<script type="math/tex">z^{(i)}</script>&#xFF0C;&#x90A3;&#x4E48;&#x5982;&#x4F55;&#x5F97;&#x5230;&#x53D8;&#x6362;&#x540E;&#x7684;&#x5728;&#x6295;&#x5F71;&#x9762;&#x4E0A;&#x7684;&#x65B0;&#x7279;&#x5F81;&#x5728;&#x539F;&#x7A7A;&#x95F4;&#x4E2D;&#x7684;&#x8868;&#x793A;&#x5462;&#xFF1F;&#x8BA1;&#x7B97;&#x4E5F;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x53EA;&#x9700;&#x8FDB;&#x884C;&#x5982;&#x4E0B;&#x8BA1;&#x7B97;</p>
<script type="math/tex; mode=display">x_{approx}^   {(i)} = U_{reduce}z^{(i)}</script><p>&#x5C31;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x539F;&#x6837;&#x672C;&#x6295;&#x5F71;&#x540E;&#x7684;&#x7279;&#x5F81;&#x5728;&#x539F;&#x9AD8;&#x7EF4;&#x7A7A;&#x95F4;&#x4E2D;&#x7684;&#x8868;&#x793A;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;<script type="math/tex">x_{approx}</script>&#x8868;&#x793A;&#x7684;&#x662F;&#x4E0E;&#x539F;&#x6837;&#x672C;&#x70B9;&#x8FD1;&#x4F3C;&#x7684;&#x70B9;&#x3002;&#x5177;&#x4F53;&#x5730;&#x8BF4;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E0B;&#x9762;&#x7684;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;</p>
<img src="/articles/5/pic4.jpg" alt="PCA&#x4F8B;&#x5B50;" title="PCA&#x4F8B;&#x5B50;">
<p>&#x5F97;&#x5230;&#x7684;<script type="math/tex">x_{approx}</script>&#x5C31;&#x662F;&#x76F4;&#x7EBF;&#x4E0A;&#x7684;&#x8FD9;&#x4E9B;&#x70B9;&#xFF1A;</p>
<img src="/articles/5/pic5.jpg" alt="PCA&#x4F8B;&#x5B50;" title="PCA&#x4F8B;&#x5B50;">
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x4E3A;&#x4E86;&#x8BC4;&#x4EF7;&#x9009;&#x53D6;&#x7684;k&#x503C;&#xFF0C;&#x6709;&#x5982;&#x4E0B;&#x4E24;&#x4E2A;&#x8BA1;&#x7B97;&#x3002;</p>
<ul>
<li>&#x5E73;&#x5747;&#x5E73;&#x65B9;&#x6295;&#x5F71;&#x8BEF;&#x5DEE;&#xFF08;Average Squared Projected Error&#xFF09;</li>
</ul>
<script type="math/tex; mode=display">\frac{1}{m} \sum_{i=1}^m \left\| x^{(i)} - x_{approx}^{(i)} \right\|^2</script><p>&#x8FD9;&#x4E2A;&#x5C31;&#x662F;&#x524D;&#x9762;&#x6240;&#x8BF4;&#x7684;&#x201C;&#x5404;&#x6837;&#x672C;&#x70B9;&#x5230;&#x6295;&#x5F71;&#x9762;&#x7684;&#x8DDD;&#x79BB;&#x201D;&#x7684;&#x548C;&#x3002;</p>
<ul>
<li>&#x6570;&#x636E;&#x7684;&#x603B;&#x53D8;&#x5DEE;&#xFF08;Total Variation&#xFF09;</li>
</ul>
<script type="math/tex; mode=display">\frac{1}{m} \sum_{i=1}^m \left\| x^{(i)} \right\|^2</script><p>&#x901A;&#x5E38;&#xFF0C;&#x5BF9;&#x4E8E;k&#xFF0C;&#x6240;&#x8981;&#x9009;&#x62E9;&#x7684;&#x662F;&#x6EE1;&#x8DB3;&#x4E0B;&#x9762;&#x6761;&#x4EF6;&#x7684;&#x6700;&#x5C0F;&#x7684;&#x503C;</p>
<script type="math/tex; mode=display">\frac{\frac{1}{m} \sum_{i=1}^m \left\| x^{(i)} - x_{approx}^{(i)} \right\|^2}{\frac{1}{m} \sum_{i=1}^m \left\| x^{(i)} \right\|^2} \leq 0.01</script><p>&#x4E5F;&#x5C31;&#x662F;&#x5E73;&#x5747;&#x5E73;&#x65B9;&#x6295;&#x5F71;&#x8BEF;&#x5DEE;&#x548C;&#x603B;&#x53D8;&#x5DEE;&#x7684;&#x6BD4;&#x503C;&#x5C0F;&#x4E8E;<script type="math/tex">0.01</script>&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;<script type="math/tex">99\%</script>&#x7684;&#x5DEE;&#x5F02;&#x6027;&#x5F97;&#x4EE5;&#x4FDD;&#x7559;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x4E5F;&#x4E0D;&#x4E00;&#x5B9A;&#x9700;&#x8981;&#x9009;&#x62E9;<script type="math/tex">0.01</script>&#x4F5C;&#x4E3A;&#x9009;&#x53D6;&#x7684;&#x6807;&#x51C6;&#xFF0C;<script type="math/tex">0.05</script>&#x3001;<script type="math/tex">0.1</script>&#x7B49;&#x4E5F;&#x662F;&#x901A;&#x5E38;&#x88AB;&#x9009;&#x53D6;&#x7684;&#x6807;&#x51C6;&#xFF0C;&#x5206;&#x522B;&#x8868;&#x793A;&#x4FDD;&#x7559;&#x4E86;<script type="math/tex">95\%</script>&#x3001;<script type="math/tex">90\%</script>&#x7684;&#x5DEE;&#x5F02;&#x6027;&#x3002;</p>
<p>&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x5219;&#x662F;&#x4ECE;<script type="math/tex">k = 1</script>&#x5F00;&#x59CB;&#xFF0C;&#x901A;&#x8FC7;&#x8BA1;&#x7B97;<script type="math/tex">U_{reduce}</script>&#x3001;&#x6240;&#x6709;&#x7684;<script type="math/tex">z^{(i)}</script>&#x3001;&#x6240;&#x6709;&#x7684;<script type="math/tex">x_{approx}^{(i)}</script>&#xFF0C;&#x7136;&#x540E;&#x68C0;&#x67E5;&#x5E73;&#x5747;&#x5E73;&#x65B9;&#x6295;&#x5F71;&#x8BEF;&#x5DEE;&#x548C;&#x603B;&#x53D8;&#x5DEE;&#x7684;&#x6BD4;&#x503C;&#x662F;&#x5426;&#x6EE1;&#x8DB3;&#x6761;&#x4EF6;&#x3002;&#x5982;&#x679C;&#x6EE1;&#x8DB3;&#x5219;&#x4E3A;&#x6240;&#x9700;&#x7684;k&#xFF0C;&#x5426;&#x5219;&#x5C1D;&#x8BD5;&#x4E0B;&#x4E00;&#x4E2A;k&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x4E0A;&#x9762;&#x7684;&#x8BA1;&#x7B97;&#x91CF;&#x662F;&#x5F88;&#x5927;&#x7684;&#xFF0C;&#x7136;&#x800C;&#xFF0C;&#x6211;&#x4EEC;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x8BA1;&#x7B97;&#x51FA;<script type="math/tex">z^{(i)}</script>&#x548C;<script type="math/tex">x_{approx}^{(i)}</script>&#x7136;&#x540E;&#x518D;&#x5957;&#x7528;&#x516C;&#x5F0F;&#x8BA1;&#x7B97;&#x6BD4;&#x503C;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5728;&#x5BF9;&#x534F;&#x65B9;&#x5DEE;&#x8FDB;&#x884C;&#x5947;&#x5F02;&#x503C;&#x5206;&#x89E3;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5229;&#x7528;<script type="math/tex">U</script>&#x3001;<script type="math/tex">S</script>&#x3001;<script type="math/tex">V</script>&#x4E2D;&#x7684;<script type="math/tex">S</script>&#x6765;&#x8BA1;&#x7B97;&#x6700;&#x540E;&#x7684;&#x6BD4;&#x503C;&#x3002;<script type="math/tex">S</script>&#x662F;&#x4E00;&#x4E2A;&#x5BF9;&#x89D2;&#x77E9;&#x9635;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x9664;&#x4E86;<script type="math/tex">S_{ii}</script>&#xFF0C;&#x5373;&#x5BF9;&#x89D2;&#x7EBF;&#x4E0A;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x5176;&#x4ED6;&#x4F4D;&#x7F6E;&#x7684;&#x5143;&#x7D20;&#x5747;&#x4E3A;<script type="math/tex">0</script>&#x3002;&#x800C;&#x6700;&#x540E;&#x7684;&#x6240;&#x9700;&#x6EE1;&#x8DB3;&#x7684;&#x6761;&#x4EF6;&#xFF0C;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x4E3A;</p>
<script type="math/tex; mode=display">1 - \frac{\sum_{i=1}^k S_{ii}}{\sum_{i=1}^n S_{ii}} \leq 0.01</script><p>&#x6216;&#x8005;</p>
<script type="math/tex; mode=display">\frac{\sum_{i=1}^k S_{ii}}{\sum_{i=1}^n S_{ii}} \geq 0.99</script><p><br></p>
<h2 id="K&#x5747;&#x503C;"><a href="#K&#x5747;&#x503C;" class="headerlink" title="K&#x5747;&#x503C;"></a>K&#x5747;&#x503C;</h2><p>K&#x5747;&#x503C;&#x662F;&#x8FD9;&#x95E8;&#x8BFE;&#x7A0B;&#x4ECB;&#x7ECD;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x65E0;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x7528;&#x6765;&#x89E3;&#x51B3;&#x805A;&#x7C7B;&#xFF08;Clustering&#xFF09;&#x95EE;&#x9898;&#x3002;</p>
<h3 id="&#x805A;&#x7C7B;&#x95EE;&#x9898;"><a href="#&#x805A;&#x7C7B;&#x95EE;&#x9898;" class="headerlink" title="&#x805A;&#x7C7B;&#x95EE;&#x9898;"></a>&#x805A;&#x7C7B;&#x95EE;&#x9898;</h3><p>&#x7B80;&#x5355;&#x5730;&#x8BF4;&#xFF0C;&#x5C31;&#x662F;&#x5C06;&#x4E00;&#x5806;&#x672A;&#x6807;&#x8BB0;&#x7684;&#x6570;&#x636E;&#x5212;&#x5206;&#x4E3A;&#x4E0D;&#x540C;&#x7684;&#x7C7B;&#x6216;&#x8005;&#x96C6;&#x7FA4;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x4EE5;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x7684;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#x4E3A;&#x4F8B;&#xFF0C;&#x5728;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x8FD9;&#x4E48;&#x4E00;&#x4E9B;&#x5E26;&#x6807;&#x8BB0;&#x7684;&#x6570;&#x636E;&#xFF1A;</p>
<img src="/articles/5/pic6.jpg" alt="&#x805A;&#x7C7B;&#x4E0E;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#x7684;&#x533A;&#x522B; - &#x5206;&#x7C7B;&#x95EE;&#x9898;" title="&#x805A;&#x7C7B;&#x4E0E;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#x7684;&#x533A;&#x522B; - &#x5206;&#x7C7B;&#x95EE;&#x9898;">
<p>&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x9700;&#x8981;&#x505A;&#x7684;&#x662F;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x5224;&#x522B;&#x754C;&#x9762;&#x5C06;&#x4E24;&#x7C7B;&#x5206;&#x5F00;&#xFF0C;&#x5F53;&#x8F93;&#x5165;&#x65B0;&#x7684;&#x4E00;&#x7EC4;&#x7279;&#x5F81;&#x65F6;&#x80FD;&#x591F;&#x6839;&#x636E;&#x5224;&#x522B;&#x754C;&#x9762;&#x5224;&#x65AD;&#x8F93;&#x5165;&#x7684;&#x6570;&#x636E;&#x5C5E;&#x4E8E;&#x54EA;&#x4E00;&#x7C7B;&#x3002;</p>
<p>&#x800C;&#x5728;&#x805A;&#x7C7B;&#x95EE;&#x9898;&#x5F53;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x6570;&#x636E;&#x662F;&#x4E0D;&#x5E26;&#x6807;&#x7B7E;&#x7684;&#xFF0C;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;</p>
<img src="/articles/5/pic7.jpg" alt="&#x805A;&#x7C7B;&#x4E0E;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#x7684;&#x533A;&#x522B; - &#x65E0;&#x6807;&#x7B7E;&#x6570;&#x636E;" title="&#x805A;&#x7C7B;&#x4E0E;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#x7684;&#x533A;&#x522B; - &#x65E0;&#x6807;&#x7B7E;&#x6570;&#x636E;">
<p>&#x800C;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x5219;&#x662F;&#x5C06;&#x4E0A;&#x9762;&#x7684;&#x70B9;&#x5206;&#x4E3A;&#x4E0D;&#x540C;&#x7684;&#x7C7B;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x5206;&#x4E3A;&#x4E24;&#x7C7B;&#xFF1A;</p>
<img src="/articles/5/pic6.jpg" alt="&#x805A;&#x7C7B;&#x4E0E;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#x7684;&#x533A;&#x522B; - &#x805A;&#x7C7B;&#x95EE;&#x9898;&#x6C42;&#x89E3;&#x7684;&#x76EE;&#x6807;" title="&#x805A;&#x7C7B;&#x4E0E;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#x7684;&#x533A;&#x522B; - &#x805A;&#x7C7B;&#x95EE;&#x9898;&#x6C42;&#x89E3;&#x7684;&#x76EE;&#x6807;">
<p>&#x805A;&#x7C7B;&#x95EE;&#x9898;&#x5728;&#x5B9E;&#x9645;&#x751F;&#x6D3B;&#x4E2D;&#x5E94;&#x7528;&#x662F;&#x5F88;&#x5E7F;&#x7684;&#xFF0C;&#x4F8B;&#x5982;&#x5546;&#x573A;&#x5BA2;&#x6237;&#x7684;&#x7EC6;&#x5206;&#x3001;&#x793E;&#x4EA4;&#x7F51;&#x7EDC;&#x7528;&#x6237;&#x7684;&#x5206;&#x7C7B;&#x3001;&#x5929;&#x6587;&#x6570;&#x636E;&#x7684;&#x5206;&#x6790;&#x7B49;&#xFF0C;&#x6709;&#x52A9;&#x4E8E;&#x6211;&#x4EEC;&#x4ECE;&#x6570;&#x636E;&#x4E2D;&#x6316;&#x6398;&#x51FA;&#x4E00;&#x4E9B;&#x53EF;&#x80FD;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x4FE1;&#x606F;&#x3002;</p>
<h3 id="K&#x5747;&#x503C;&#x7B97;&#x6CD5;"><a href="#K&#x5747;&#x503C;&#x7B97;&#x6CD5;" class="headerlink" title="K&#x5747;&#x503C;&#x7B97;&#x6CD5;"></a>K&#x5747;&#x503C;&#x7B97;&#x6CD5;</h3><p>&#x5BF9;&#x4E8E;K&#x5747;&#x503C;&#x7B97;&#x6CD5;&#xFF0C;&#x9996;&#x5148;&#x9700;&#x8981;&#x5982;&#x4E0B;&#x53C2;&#x6570;&#xFF1A;</p>
<ul>
<li><p>&#x5E0C;&#x671B;&#x5206;&#x51FA;&#x7684;&#x805A;&#x7C7B;&#x7684;&#x6570;&#x91CF;K</p>
</li>
<li><p>&#x8BAD;&#x7EC3;&#x96C6;<script type="math/tex">\left\{ x^{(1)}, x^{(2)}, \cdots, x^{(m)} \right\}</script>&#xFF0C;&#x5176;&#x4E2D;&#xFF0C;<script type="math/tex">x \in \mathbb{R}^n</script></p>
</li>
</ul>
<p>&#x7136;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x5982;&#x4E0B;&#x53D8;&#x91CF;</p>
<ul>
<li><p><script type="math/tex">u_i \in \mathbb{R}^n (1 \leq i \leq K)</script>&#x8868;&#x793A;&#x7B2C;i&#x4E2A;&#x805A;&#x7C7B;&#x4E2D;&#x5FC3;&#x70B9;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x70B9;&#xFF0C;&#x79BB;&#x90A3;&#x4E2A;&#x805A;&#x7C7B;&#x4E2D;&#x5FC3;&#x66F4;&#x8FD1;&#xFF0C;&#x8FD9;&#x4E2A;&#x70B9;&#x5C31;&#x5C5E;&#x4E8E;&#x54EA;&#x4E2A;&#x805A;&#x7C7B;&#x3002;</p>
</li>
<li><p><script type="math/tex">c^{(i)} \in \left[ 1, K \right] (1 \leq i \leq K)</script>&#x8868;&#x793A;&#x7B2C;<script type="math/tex">i</script>&#x7EC4;&#x7279;&#x5F81;<script type="math/tex">x^{(i)}</script>&#x6240;&#x5C5E;&#x7684;&#x805A;&#x7C7B;&#xFF08;&#x5C5E;&#x4E8E;&#x7B2C;&#x51E0;&#x4E2A;&#x805A;&#x7C7B;&#xFF09;&#x3002;</p>
</li>
</ul>
<p>&#x5176;&#x5B9E;K&#x5747;&#x503C;&#x7B97;&#x6CD5;&#x7684;&#x6B65;&#x9AA4;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x60F3;&#x8981;&#x5C06;&#x6570;&#x636E;&#x5206;&#x4E3A;K&#x4E2A;&#x805A;&#x7C7B;&#xFF0C;&#x53EA;&#x9700;&#x9075;&#x5FAA;&#x4EE5;&#x4E0B;&#x7684;&#x6B65;&#x9AA4;&#x5373;&#x53EF;&#xFF1A;</p>
<ol>
<li><p>&#x968F;&#x673A;&#x521D;&#x59CB;&#x5316;K&#x4E2A;&#x70B9;&#x4F5C;&#x4E3A;&#x805A;&#x7C7B;&#x4E2D;&#x5FC3;<script type="math/tex">u_1, u_2, \cdots, u_K \in \mathbb{R}^n</script></p>
</li>
<li><p>&#x91CD;&#x590D;&#x5982;&#x4E0B;&#x6B65;&#x9AA4;&#x76F4;&#x5230;&#x7A33;&#x5B9A;</p>
<ol>
<li>&#x5BF9;&#x4E8E;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x70B9;&#xFF0C;&#x4EE4;<script type="math/tex">c^{(i)}</script>&#x7B49;&#x4E8E;&#x8DDD;&#x79BB;<script type="math/tex">x^{(i)}</script>&#x6700;&#x8FD1;&#x7684;&#x805A;&#x7C7B;&#x5BF9;&#x5E94;&#x7684;&#x7F16;&#x53F7;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5982;&#x679C;<script type="math/tex">u_j</script>&#x8DDD;&#x79BB;<script type="math/tex">x^{(i)}</script>&#x6700;&#x8FD1;&#xFF0C;&#x5219;&#x4EE4;<script type="math/tex">c^{(i)}=j</script>&#x3002;</li>
<li>&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x805A;&#x7C7B;&#x4E2D;&#x5FC3;<script type="math/tex">u_j</script>&#xFF0C;&#x5C06;&#x5176;&#x79FB;&#x52A8;&#x5230;&#x6240;&#x6709;&#x6EE1;&#x8DB3;<script type="math/tex">c^{(i)} = j</script>&#x7684;&#x70B9;<script type="math/tex">x^{(i)}</script>&#x7684;&#x5747;&#x503C;&#x70B9;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5C5E;&#x4E8E;&#x8BE5;&#x805A;&#x7C7B;&#x7684;&#x6240;&#x6709;<script type="math/tex">x^{(i)}</script>&#x5404;&#x5206;&#x91CF;&#x53D6;&#x5E73;&#x5747;&#x503C;&#x540E;&#x5F97;&#x5230;&#x7684;&#x70B9;&#x3002;</li>
</ol>
</li>
</ol>
<p>&#x4E0B;&#x56FE;&#x5C55;&#x793A;&#x4E86;&#x4E00;&#x4E2A;&#x4F7F;&#x7528;K&#x5747;&#x503C;&#x7B97;&#x6CD5;&#x8FDB;&#x884C;&#x8BA1;&#x7B97;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p>
<img src="/articles/5/pic8.jpg" alt="K&#x5747;&#x503C;&#x8BA1;&#x7B97;&#x5B9E;&#x4F8B;" title="K&#x5747;&#x503C;&#x8BA1;&#x7B97;&#x5B9E;&#x4F8B;">
<h3 id="&#x4EE3;&#x4EF7;&#x51FD;&#x6570;"><a href="#&#x4EE3;&#x4EF7;&#x51FD;&#x6570;" class="headerlink" title="&#x4EE3;&#x4EF7;&#x51FD;&#x6570;"></a>&#x4EE3;&#x4EF7;&#x51FD;&#x6570;</h3><p>&#x5BB9;&#x6613;&#x53D1;&#x73B0;&#xFF0C;&#x805A;&#x7C7B;&#x6570;&#x91CF;K&#x7684;&#x9009;&#x53D6;&#xFF0C;&#x4EE5;&#x53CA;&#x6BCF;&#x4E2A;&#x805A;&#x7C7B;&#x4E2D;&#x5FC3;&#x521D;&#x59CB;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x90FD;&#x4F1A;&#x5F71;&#x54CD;&#x5206;&#x7C7B;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4E0E;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x7C7B;&#x4F3C;&#xFF0C;&#x4E3A;&#x4E86;&#x68C0;&#x67E5;&#x7B97;&#x6CD5;&#x7684;&#x5206;&#x7C7B;&#x6548;&#x679C;&#xFF0C;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x8BC4;&#x4EF7;&#x5206;&#x7C7B;&#x6548;&#x679C;&#x7684;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#xFF0C;&#x4E3A;</p>
<script type="math/tex; mode=display">J\left( c^{(1)}, \cdots, c^{(m)}, u_1, \cdots, u_K \right) = frac{1}{m} \sum_{i=1}^m \left\| x^{(i)} - u_{c^{(i)}} \right\|</script><p>&#x5176;&#x4E2D;&#xFF0C;<script type="math/tex">u_{c^{(i)}}</script>&#x8868;&#x793A;<script type="math/tex">x^{(i)}</script>&#x6240;&#x5C5E;&#x7684;&#x805A;&#x7C7B;&#x4E2D;&#x5FC3;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x662F;&#x6BCF;&#x4E2A;&#x6837;&#x672C;&#x70B9;&#x4E0E;&#x5176;&#x6240;&#x5C5E;&#x7684;&#x805A;&#x7C7B;&#x4E2D;&#x5FC3;&#x5E73;&#x65B9;&#x8DDD;&#x79BB;&#x548C;&#x7684;&#x5E73;&#x5747;&#x6570;&#x3002;&#x800C;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x5C31;&#x662F;&#x6C42;&#x5F97;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x7684;&#x6700;&#x5C0F;&#x503C;&#xFF0C;&#x5373;</p>
<script type="math/tex; mode=display">\min_{ c^{(1)}, \cdots, c^{(m)} \\ u_1, \cdots, u_K} J\left( c^{(1)}, \cdots, c^{(m)}, u_1, \cdots, u_K \right)</script><p>&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x4EE3;&#x4EF7;&#x5B9E;&#x9645;&#x4E0A;&#x4E0E;&#x5BF9;&#x6BCF;&#x4E2A;&#x70B9;&#x7684;&#x5206;&#x914D;<script type="math/tex">c^{(i)}</script>&#x4EE5;&#x53CA;&#x805A;&#x7C7B;&#x4E2D;&#x5FC3;<script type="math/tex">u_j</script>&#x7684;&#x4F4D;&#x7F6E;&#x6709;&#x5173;&#xFF0C;&#x4F46;&#x662F;&#x4E24;&#x90E8;&#x5206;&#x53C8;&#x76F8;&#x4E92;&#x5173;&#x8054;&#x4E0D;&#x597D;&#x540C;&#x65F6;&#x8C03;&#x6574;&#xFF0C;&#x56E0;&#x6B64;&#x5C31;&#x91C7;&#x53D6;&#x4E86;K&#x5747;&#x503C;&#x7B97;&#x6CD5;&#x4E2D;&#x201C;&#x5206;&#x4E24;&#x6B65;&#x8D70;&#x201D;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5148;&#x56FA;&#x5B9A;<script type="math/tex">u_j</script>&#x5206;&#x914D;<script type="math/tex">c^{(i)}</script>&#xFF0C;&#x518D;&#x56FA;&#x5B9A;<script type="math/tex">c^{(i)}</script>&#x79FB;&#x52A8;<script type="math/tex">u_j</script>&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x53EF;&#x4EE5;&#x8BC1;&#x660E;&#xFF0C;&#x8FD9;&#x4E24;&#x6B65;&#x7684;&#x6BCF;&#x4E00;&#x6B65;&#x90FD;&#x662F;&#x5728;&#x6700;&#x4F18;&#x5316;&#x4EE3;&#x4EF7;<script type="math/tex">J\left( c^{(1)}, \cdots, c^{(m)}, u_1, \cdots, u_K \right)</script>&#x3002;</p>
<h3 id="&#x968F;&#x673A;&#x521D;&#x59CB;&#x5316;"><a href="#&#x968F;&#x673A;&#x521D;&#x59CB;&#x5316;" class="headerlink" title="&#x968F;&#x673A;&#x521D;&#x59CB;&#x5316;"></a>&#x968F;&#x673A;&#x521D;&#x59CB;&#x5316;</h3><p>&#x867D;&#x7136;&#x6211;&#x4EEC;&#x9009;&#x62E9;&#x4E86;&#x968F;&#x673A;&#x521D;&#x59CB;&#x5316;&#x5404;&#x4E2A;&#x805A;&#x7C7B;&#x4E2D;&#x5FC3;&#xFF0C;&#x7136;&#x800C;&#xFF0C;&#x540C;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x5F97;&#x5230;&#x7684;&#x662F;&#x5C40;&#x90E8;&#x6700;&#x5C0F;&#x503C;&#x800C;&#x4E0D;&#x662F;&#x5168;&#x5C40;&#x6700;&#x5C0F;&#x503C;&#x4E00;&#x6837;&#xFF0C;&#x4E00;&#x65F6;&#x5165;&#x975E;&#xFF0C;&#x53EF;&#x80FD;&#x968F;&#x673A;&#x51FA;&#x7684;&#x805A;&#x7C7B;&#x4E2D;&#x5FC3;&#x6267;&#x884C;K&#x5747;&#x503C;&#x7B97;&#x6CD5;&#x9677;&#x5165;&#x5C40;&#x90E8;&#x6700;&#x4F18;&#xFF0C;&#x5F97;&#x5230;&#x7684;&#x603B;&#x4F53;&#x6548;&#x679C;&#x975E;&#x5E38;&#x4E0D;&#x597D;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p>
<img src="/articles/5/pic9.jpg" alt="K&#x5747;&#x503C;&#x8BA1;&#x7B97;&#x5B9E;&#x4F8B;" title="K&#x5747;&#x503C;&#x8BA1;&#x7B97;&#x5B9E;&#x4F8B;">
<p>&#x7136;&#x800C;&#x5982;&#x679C;&#x968F;&#x673A;&#x521D;&#x59CB;&#x5316;&#x7684;&#x4F4D;&#x7F6E;&#x4E0D;&#x597D;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x60C5;&#x51B5;&#x4E5F;&#x662F;&#x5B8C;&#x5168;&#x53EF;&#x80FD;&#x7684;&#xFF1A;</p>
<img src="/articles/5/pic10.jpg" alt="K&#x5747;&#x503C;&#x8BA1;&#x7B97;&#x5B9E;&#x4F8B;" title="K&#x5747;&#x503C;&#x8BA1;&#x7B97;&#x5B9E;&#x4F8B;">
<p>&#x800C;&#x5BF9;&#x6B64;&#x89E3;&#x51B3;&#x7684;&#x65B9;&#x6CD5;&#x4E5F;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7C97;&#x66B4;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x591A;&#x6B21;&#x968F;&#x673A;&#x521D;&#x59CB;&#x5316;&#x4E4B;&#x540E;&#x9009;&#x53D6;&#x4EE3;&#x4EF7;<script type="math/tex">J\left( c^{(1)}, \cdots, c^{(m)}, u_1, \cdots, u_K \right)</script>&#x6700;&#x5C0F;&#x7684;&#x4E00;&#x7EC4;&#x5373;&#x53EF;&#x3002;</p>
<h3 id="&#x9009;&#x53D6;K&#x7684;&#x503C;"><a href="#&#x9009;&#x53D6;K&#x7684;&#x503C;" class="headerlink" title="&#x9009;&#x53D6;K&#x7684;&#x503C;"></a>&#x9009;&#x53D6;K&#x7684;&#x503C;</h3><p>&#x8FD8;&#x5269;&#x4E0B;&#x4E00;&#x4E2A;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5BF9;&#x4E8E;&#x521A;&#x521A;&#x5230;&#x624B;&#x7684;&#x6D77;&#x91CF;&#x6570;&#x636E;&#xFF0C;&#x5982;&#x4F55;&#x51B3;&#x5B9A;&#x805A;&#x7C7B;&#x7684;&#x6570;&#x91CF;<script type="math/tex">K</script>&#x5462;&#xFF1F;</p>
<p>&#x5F88;&#x9057;&#x61BE;&#x7684;&#x662F;&#xFF0C;&#x7B54;&#x6848;&#x5F80;&#x5F80;&#x662F;&#x6A21;&#x68F1;&#x4E24;&#x53EF;&#x7684;&#xFF0C;&#x5F88;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x805A;&#x7C7B;&#x770B;&#x4E0A;&#x53BB;&#x5F80;&#x5F80;&#x4E0D;&#x662F;&#x4E00;&#x76EE;&#x4E86;&#x7136;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;</p>
<img src="/articles/5/pic11.jpg" alt="K&#x503C;&#x9009;&#x53D6;&#x5B9E;&#x4F8B;" title="K&#x503C;&#x9009;&#x53D6;&#x5B9E;&#x4F8B;">
<p>&#x4F60;&#x89C9;&#x5F97;&#x6709;&#x51E0;&#x4E2A;&#x805A;&#x7C7B;&#xFF1F;&#x8BF4;&#x6709;&#x4FE9;&#x4E5F;&#x884C;&#xFF0C;&#x8BF4;&#x6709;&#x56DB;&#x4E2A;&#x4E5F;&#x4E0D;&#x662F;&#x4E0D;&#x53EF;&#x4EE5;&#x3002;&#x6240;&#x4EE5;&#x4E0B;&#x9762;&#x4ECB;&#x7ECD;&#x7684;&#x51E0;&#x79CD;&#x9009;&#x53D6;<script type="math/tex">K</script>&#x7684;&#x503C;&#x7684;&#x65B9;&#x6CD5;&#x4F1A;&#x5BF9;&#x9009;&#x53D6;&#x8D77;&#x5230;&#x4E00;&#x5B9A;&#x7684;&#x5E2E;&#x52A9;&#xFF0C;&#x4F46;&#x5E76;&#x4E0D;&#x662F;&#x7EDD;&#x5BF9;&#x7684;&#x3002;</p>
<h4 id="&#x8098;&#x90E8;&#x6CD5;&#x5219;&#xFF08;Elbow-Method&#xFF09;"><a href="#&#x8098;&#x90E8;&#x6CD5;&#x5219;&#xFF08;Elbow-Method&#xFF09;" class="headerlink" title="&#x8098;&#x90E8;&#x6CD5;&#x5219;&#xFF08;Elbow Method&#xFF09;"></a>&#x8098;&#x90E8;&#x6CD5;&#x5219;&#xFF08;Elbow Method&#xFF09;</h4><p>&#x8098;&#x90E8;&#x6CD5;&#x5219;&#x5C31;&#x662F;&#xFF0C;&#x5F53;&#x4F60;&#x753B;&#x51FA;<script type="math/tex">K</script>&#x4E0E;&#x4EE3;&#x4EF7;&#x7684;&#x5173;&#x7CFB;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x53D1;&#x73B0;&#x66F2;&#x7EBF;&#x51FA;&#x73B0;&#x4E86;&#x7C7B;&#x4F3C;&#x8098;&#x90E8;&#x4E00;&#x6837;&#x7684;&#x201C;&#x6025;&#x8F6C;&#x5F2F;&#x201D;&#xFF0C;&#x90A3;&#x4E48;<script type="math/tex">K</script>&#x5C31;&#x9009;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x4F8B;&#x5982;&#x8FD9;&#x6837;&#x7684;&#x60C5;&#x5F62;&#xFF1A;</p>
<img src="/articles/5/pic12.jpg" alt="K&#x503C;&#x9009;&#x53D6;&#x5B9E;&#x4F8B; - &#x8098;&#x90E8;&#x6CD5;&#x5219; - &#x597D;&#x7684;&#x4F8B;&#x5B50;" title="K&#x503C;&#x9009;&#x53D6;&#x5B9E;&#x4F8B; - &#x8098;&#x90E8;&#x6CD5;&#x5219; - &#x597D;&#x7684;&#x4F8B;&#x5B50;">
<p>&#x90A3;&#x4E48;<script type="math/tex">K</script>&#x5C31;&#x53D6;3&#x3002;</p>
<p>&#x7136;&#x800C;&#x9057;&#x61BE;&#x5730;&#x662F;&#xFF0C;&#x5F88;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#x6211;&#x4EEC;&#x627E;&#x4E0D;&#x51FA;&#x8098;&#x90E8;&#x6765;&#xFF0C;&#x4F8B;&#x5982;&#x8FD9;&#x6837;&#xFF1A;</p>
<img src="/articles/5/pic13.jpg" alt="K&#x503C;&#x9009;&#x53D6;&#x5B9E;&#x4F8B; - &#x8098;&#x90E8;&#x6CD5;&#x5219; - &#x574F;&#x7684;&#x4F8B;&#x5B50;" title="K&#x503C;&#x9009;&#x53D6;&#x5B9E;&#x4F8B; - &#x8098;&#x90E8;&#x6CD5;&#x5219; - &#x574F;&#x7684;&#x4F8B;&#x5B50;">
<p>&#x66F2;&#x7EBF;&#x592A;&#x8FC7;&#x5E73;&#x6ED1;&#xFF0C;&#x627E;&#x4E0D;&#x5230;&#x8098;&#x90E8;&#x7684;&#x70B9;&#x3002;</p>
<h4 id="&#x670D;&#x52A1;&#x4E8E;&#x9700;&#x6C42;"><a href="#&#x670D;&#x52A1;&#x4E8E;&#x9700;&#x6C42;" class="headerlink" title="&#x670D;&#x52A1;&#x4E8E;&#x9700;&#x6C42;"></a>&#x670D;&#x52A1;&#x4E8E;&#x9700;&#x6C42;</h4><p>&#x5176;&#x5B9E;&#x6700;&#x597D;&#x7684;&#x529E;&#x6CD5;&#x8FD8;&#x662F;&#x5177;&#x4F53;&#x60C5;&#x51B5;&#x5177;&#x4F53;&#x5206;&#x6790;&#xFF0C;&#x6839;&#x636E;&#x9879;&#x76EE;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x770B;&#x9009;&#x53D6;&#x7684;&#x805A;&#x7C7B;&#x6570;&#x91CF;&#x80FD;&#x4E3A;&#x540E;&#x7EED;&#x7684;&#x76EE;&#x7684;&#x63D0;&#x4F9B;&#x591A;&#x597D;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x4F8B;&#x5982;&#x5BF9;&#x4E8E;T&#x6064;&#x751F;&#x4EA7;&#x5546;&#xFF0C;&#x60F3;&#x5236;&#x9020;&#x5927;&#x4E2D;&#x5C0F;&#x4E09;&#x79CD;&#x578B;&#x53F7;&#x7684;T&#x6064;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x53EF;&#x4EE5;&#x4ECE;&#x6F5C;&#x5728;&#x76EE;&#x6807;&#x5BA2;&#x6237;&#x7684;&#x8EAB;&#x9AD8;&#x6570;&#x636E;&#x4E2D;&#x6316;&#x6398;&#x51FA;&#x4E09;&#x4E2A;&#x805A;&#x7C7B;&#x6765;&#xFF1B;&#x800C;&#x5982;&#x679C;&#x751F;&#x4EA7;&#x5546;&#x60F3;&#x8981;&#x66F4;&#x52A0;&#x7EC6;&#x5206;&#x5730;&#x5207;&#x5165;&#x5E02;&#x573A;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x80FD;&#x5C31;&#x9700;&#x8981;&#x66F4;&#x591A;&#x805A;&#x7C7B;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x8BF4;&#xFF0C;&#x5728;&#x805A;&#x7C7B;&#x6570;&#x91CF;&#x7684;&#x9009;&#x53D6;&#x4E0A;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x7EDD;&#x5BF9;&#x7684;&#x6807;&#x51C6;&#xFF0C;&#x66F4;&#x591A;&#x7684;&#x8FD8;&#x662F;&#x8981;&#x9760;&#x4EBA;&#x5DE5;&#x7684;&#x51B3;&#x65AD;&#x3002;</p>
<p><br></p>
<h2 id="&#x9AD8;&#x65AF;&#x5206;&#x5E03;"><a href="#&#x9AD8;&#x65AF;&#x5206;&#x5E03;" class="headerlink" title="&#x9AD8;&#x65AF;&#x5206;&#x5E03;"></a>&#x9AD8;&#x65AF;&#x5206;&#x5E03;</h2><p>&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#xFF0C;&#x4E5F;&#x53EB;&#x6B63;&#x6001;&#x5206;&#x5E03;&#xFF08;&#x5176;&#x5B9E;&#x4E00;&#x822C;&#x5927;&#x5BB6;&#x90FD;&#x53EB;&#x6B63;&#x6001;&#x5206;&#x5E03;&#x2026;&#x2026;&#xFF09;&#xFF0C;&#x662F;&#x5728;&#x6982;&#x7387;&#x7EDF;&#x8BA1;&#x5F53;&#x4E2D;&#x7ECF;&#x5E38;&#x7528;&#x5230;&#x7684;&#x4E00;&#x79CD;&#x7EDF;&#x8BA1;&#x6A21;&#x578B;&#x3002;&#x8FD9;&#x91CC;&#x4E3B;&#x8981;&#x5229;&#x7528;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#x6765;&#x89E3;&#x51B3;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x95EE;&#x9898;&#x3002;</p>
<h3 id="&#x5F02;&#x5E38;&#x68C0;&#x6D4B;"><a href="#&#x5F02;&#x5E38;&#x68C0;&#x6D4B;" class="headerlink" title="&#x5F02;&#x5E38;&#x68C0;&#x6D4B;"></a>&#x5F02;&#x5E38;&#x68C0;&#x6D4B;</h3><p>&#x5047;&#x8BBE;&#x73B0;&#x5728;&#x6211;&#x4EEC;</p>
<p>&#x5047;&#x5982;&#x5BF9;&#x4E8E;&#x98DE;&#x673A;&#x5F15;&#x64CE;&#xFF0C;&#x6211;&#x4EEC;&#x63D0;&#x53D6;&#x51FA;&#x53D1;&#x70ED;&#x548C;&#x9707;&#x52A8;&#x4E24;&#x9879;&#x6027;&#x80FD;&#x6307;&#x6807;&#x4F5C;&#x4E3A;&#x7279;&#x5F81;&#xFF0C;&#x5E76;&#x83B7;&#x53D6;&#x4E86;&#x5927;&#x91CF;&#x53D1;&#x52A8;&#x673A;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#xFF1A;</p>
<img src="/articles/5/pic14.jpg" alt="&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x4F8B;&#x5B50; - &#x98DE;&#x673A;&#x5F15;&#x64CE;" title="&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x4F8B;&#x5B50; - &#x98DE;&#x673A;&#x5F15;&#x64CE;">
<p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x9020;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5F15;&#x64CE;&#xFF0C;&#x5176;&#x7279;&#x5F81;&#x5982;&#x4E0B;&#x56FE;&#xFF0C;&#x90A3;&#x4E48;&#x770B;&#x8D77;&#x6765;&#x5B83;&#x5C31;&#x5F88;&#x53EF;&#x80FD;&#x662F;&#x6B63;&#x5E38;&#x7684;&#xFF1A;</p>
<img src="/articles/5/pic15.jpg" alt="&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x4F8B;&#x5B50; - &#x98DE;&#x673A;&#x5F15;&#x64CE; - &#x6B63;&#x5E38;&#x7684;&#x6837;&#x672C;" title="&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x4F8B;&#x5B50; - &#x98DE;&#x673A;&#x5F15;&#x64CE; - &#x6B63;&#x5E38;&#x7684;&#x6837;&#x672C;">
<p>&#x800C;&#x5982;&#x679C;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF0C;&#x90A3;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x5B83;&#x6709;&#x5F88;&#x5927;&#x6982;&#x7387;&#x662F;&#x4E0D;&#x592A;&#x6B63;&#x5E38;&#x7684;&#xFF1A;</p>
<img src="/articles/5/pic16.jpg" alt="&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x4F8B;&#x5B50; - &#x98DE;&#x673A;&#x5F15;&#x64CE; - &#x5F02;&#x5E38;&#x7684;&#x6837;&#x672C;" title="&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x4F8B;&#x5B50; - &#x98DE;&#x673A;&#x5F15;&#x64CE; - &#x5F02;&#x5E38;&#x7684;&#x6837;&#x672C;">
<p>&#x4E00;&#x8A00;&#x4EE5;&#x853D;&#x4E4B;&#xFF0C;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x7ED9;&#x4F60;&#x4E00;&#x5927;&#x5806;&#x6B63;&#x5E38;&#x7684;&#x6837;&#x672C;&#xFF08;&#x5176;&#x4E2D;&#x6709;&#x90A3;&#x4E48;&#x51E0;&#x4E2A;&#x4E0D;&#x6B63;&#x5E38;&#x7684;&#x5176;&#x5B9E;&#x4E5F;&#x6CA1;&#x5173;&#x7CFB;&#xFF09;&#x8BAD;&#x7EC3;&#xFF0C;&#x7136;&#x540E;&#x7ED9;&#x51FA;&#x65B0;&#x7684;&#x6837;&#x672C;&#xFF0C;&#x8BA9;&#x4F60;&#x5224;&#x65AD;&#x65B0;&#x7684;&#x6837;&#x672C;&#x662F;&#x5426;&#x6B63;&#x5E38;&#x3002;</p>
<p>&#x5F62;&#x5F0F;&#x5316;&#x5730;&#x8BB2;&#xFF0C;&#x5C31;&#x662F;&#x5728;&#x5DF2;&#x7ECF;&#x83B7;&#x5F97;&#x4E00;&#x4E9B;&#x6570;&#x636E;<script type="math/tex">\left\{ x^{(1)}, x^{(2)}, \cdots, x^{(m)} \right\}</script>&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF08;&#x901A;&#x5E38;&#x5047;&#x5B9A;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x90FD;&#x662F;&#x6B63;&#x5E38;&#x7684;&#xFF09;&#xFF0C;&#x7ED9;&#x51FA;<script type="math/tex">x_{test}</script>&#xFF0C;&#x5224;&#x65AD;&#x5176;&#x662F;&#x5426;&#x662F;&#x6B63;&#x5E38;&#x7684;&#x3002;</p>
<p>&#x901A;&#x5E38;&#x7684;&#x505A;&#x6CD5;&#x662F;&#xFF0C;&#x9488;&#x5BF9;&#x6570;&#x636E;&#xFF0C;&#x6839;&#x636E;&#x5DF2;&#x6709;&#x6570;&#x636E;&#x5EFA;&#x7ACB;&#x6709;&#x5173;<script type="math/tex">x</script>&#x7684;&#x6982;&#x7387;&#x5206;&#x5E03;<script type="math/tex">p(x)</script>&#x8868;&#x793A;&#x6837;&#x672C;<script type="math/tex">x</script>&#x6B63;&#x5E38;&#x7684;&#x6982;&#x7387;&#xFF0C;&#x5F53;&#x7ED9;&#x51FA;<script type="math/tex">x_{test}</script>&#x65F6;&#xFF0C;&#x5224;&#x65AD;<script type="math/tex">p(x_{test})</script>&#x662F;&#x5426;&#x5C0F;&#x4E8E;&#x8BBE;&#x5B9A;&#x9608;&#x503C;&#xFF0C;&#x5982;&#x679C;&#x5C0F;&#x4E8E;&#xFF0C;&#x5219;&#x5224;&#x5B9A;&#x4E3A;&#x5F02;&#x5E38;&#xFF0C;&#x5426;&#x5219;&#x5219;&#x89C6;&#x4E3A;&#x6B63;&#x5E38;&#x3002;</p>
<p>&#x800C;&#x81F3;&#x4E8E;&#x9884;&#x6D4B;&#x6548;&#x679C;&#x7684;&#x8BC4;&#x4F30;&#xFF0C;&#x663E;&#x7136;&#xFF0C;&#x7531;&#x4E8E;&#x5F02;&#x5E38;&#x7684;&#x60C5;&#x51B5;&#x53EA;&#x662F;&#x6781;&#x4E2A;&#x522B;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x8FD9;&#x5C5E;&#x4E8E;&#x504F;&#x659C;&#x6570;&#x636E;&#xFF0C;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x4E0A;&#x4E00;&#x7BC7;&#x4E2D;&#x6709;&#x5173;&#x504F;&#x659C;&#x6570;&#x636E;&#x7684;&#x76F8;&#x5173;&#x8BC4;&#x4F30;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x901A;&#x5E38;&#x662F;&#x7528;&#x4E8E;&#x89E3;&#x51B3;&#x65E0;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x95EE;&#x9898;&#xFF0C;&#x4E0D;&#x8FC7;&#x5B83;&#x5176;&#x5B9E;&#x548C;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x50CF;&#x3002;&#x5176;&#x5E94;&#x7528;&#x4E5F;&#x975E;&#x5E38;&#x5E7F;&#x6CDB;&#xFF0C;&#x4F8B;&#x5982;&#x751F;&#x4EA7;&#x4E0A;&#x5224;&#x65AD;&#x4EA7;&#x54C1;&#x662F;&#x5426;&#x5408;&#x683C;&#xFF0C;&#x7F51;&#x7AD9;&#x6839;&#x636E;&#x7528;&#x6237;&#x884C;&#x4E3A;&#x5224;&#x65AD;&#x662F;&#x5426;&#x662F;&#x6076;&#x610F;&#x7528;&#x6237;&#xFF0C;&#x6839;&#x636E;&#x7CFB;&#x7EDF;&#x72B6;&#x6001;&#x5224;&#x65AD;&#x7CFB;&#x7EDF;&#x662F;&#x5426;&#x6B63;&#x5E38;&#x8FD0;&#x8F6C;&#x7B49;&#x3002;</p>
<h3 id="&#x4F7F;&#x7528;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#x7684;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;"><a href="#&#x4F7F;&#x7528;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#x7684;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;" class="headerlink" title="&#x4F7F;&#x7528;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#x7684;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;"></a>&#x4F7F;&#x7528;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#x7684;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;</h3><p>&#x9996;&#x5148;&#x9700;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x6709;</p>
<script type="math/tex; mode=display">\left\{ x^{(1)}, x^{(2)}, \cdots, x^{(m)} \right\}, x \in \mathbb{R}^n</script><p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x7279;&#x5F81;&#xFF0C;&#x6839;&#x636E;&#x8BAD;&#x7EC3;&#x96C6;&#x5EFA;&#x7ACB;&#x76F8;&#x5E94;&#x7684;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#x6A21;&#x578B;</p>
<script type="math/tex; mode=display">p(x_1; \mu_1, \sigma_1^2), p(x_2; \mu_2, \sigma_2^2), \cdots, p(x_n; \mu_n, \sigma_n^2)</script><p>&#x5176;&#x4E2D;&#xFF0C;&#x7531;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#x6A21;&#x578B;&#x7684;&#x7279;&#x70B9;&#x53EF;&#x4EE5;&#x5F97;&#x77E5;</p>
<script type="math/tex; mode=display">\mu_j = \frac{1}{m}\sum_{i=1}^{m}x_j^{(i)}, \sigma_j = \frac{1}{m}\sum_{i=1}^{m} \left( x_j^{(i)} - \mu_j \right)^2</script><p>&#x90A3;&#x4E48;&#x5BF9;&#x4E8E;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x9884;&#x6D4B;&#x7684;&#x4E00;&#x7EC4;&#x7279;&#x5F81;<script type="math/tex">x</script>&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x4E00;&#x4E2A;&#x6837;&#x672C;&#xFF0C;&#x5224;&#x65AD;&#x5176;&#x662F;&#x5426;&#x6B63;&#x5E38;&#x7684;&#x516C;&#x5F0F;&#x4E3A;</p>
<script type="math/tex; mode=display">p(x) = p(x_1; \mu_1, \sigma_1^2)p(x_2; \mu_2, \sigma_2^2) \cdots p(x_n; \mu_n, \sigma_n^2)</script><p>&#x6216;&#x8005;&#x4E5F;&#x53EF;&#x4EE5;&#x7B80;&#x5316;&#x4E3A;</p>
<script type="math/tex; mode=display">\prod_{j=1}^{n}p(x_j; \mu_j, \sigma_j^2)</script><p>&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x4E00;&#x4E2A;&#x6837;&#x672C;&#x6B63;&#x5E38;&#x7684;&#x6982;&#x7387;&#x7B49;&#x4E8E;&#x5176;&#x5404;&#x4E2A;&#x7279;&#x5F81;&#x5404;&#x81EA;&#x6B63;&#x5E38;&#x7684;&#x6982;&#x7387;&#x7684;&#x4E58;&#x79EF;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x53EA;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x7279;&#x5F81;&#x4E0D;&#x6B63;&#x5E38;&#xFF0C;&#x5176;&#x6574;&#x4F53;&#x6B63;&#x5E38;&#x7684;&#x6982;&#x7387;&#x90FD;&#x4F1A;&#x6BD4;&#x8F83;&#x4F4E;&#x3002;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x8FD9;&#x79CD;&#x7B97;&#x6CD5;&#x6709;&#x4E00;&#x4E2A;&#x5047;&#x8BBE;&#xFF0C;&#x5C31;&#x662F;&#x5404;&#x4E2A;&#x7279;&#x5F81;&#x4E4B;&#x95F4;&#x662F;&#x76F8;&#x4E92;&#x72EC;&#x7ACB;&#x7684;&#x3002;</p>
<h3 id="&#x7279;&#x5F81;&#x5904;&#x7406;"><a href="#&#x7279;&#x5F81;&#x5904;&#x7406;" class="headerlink" title="&#x7279;&#x5F81;&#x5904;&#x7406;"></a>&#x7279;&#x5F81;&#x5904;&#x7406;</h3><p>&#x524D;&#x9762;&#x7684;&#x7B97;&#x6CD5;&#x4E2D;&#x63D0;&#x5230;&#x4E86;&#xFF0C;&#x8981;&#x9488;&#x5BF9;&#x6BCF;&#x4E2A;&#x7279;&#x5F81;&#x5EFA;&#x7ACB;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#x6A21;&#x578B;&#xFF0C;&#x8FD9;&#x6837;&#x505A;&#x5C31;&#x6709;&#x4E2A;&#x524D;&#x63D0;&#xFF1A;&#x6BCF;&#x4E2A;&#x7279;&#x5F81;&#x90FD;&#x9700;&#x8981;&#x6EE1;&#x8DB3;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x663E;&#x7136;&#x8FD9;&#x662F;&#x5F88;&#x96BE;&#x6EE1;&#x8DB3;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x6709;&#x4E9B;&#x7279;&#x5F81;&#x53EF;&#x80FD;&#x5E76;&#x4E0D;&#x6EE1;&#x8DB3;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#xFF0C;&#x90A3;&#x600E;&#x4E48;&#x529E;&#x5462;&#xFF1F;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x505A;&#x4E00;&#x6B65;&#x8F6C;&#x6362;&#x561B;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#x6211;&#x4EEC;&#x8981;&#x5BF9;&#x4E00;&#x4E2A;&#x7279;&#x5F81;&#x5EFA;&#x7ACB;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#x6A21;&#x578B;&#xFF0C;&#x6211;&#x4EEC;&#x4ECE;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#x83B7;&#x53D6;&#x76F8;&#x5173;&#x503C;&#xFF0C;&#x5148;&#x753B;&#x51FA;&#x6765;&#x770B;&#x770B;</p>
<img src="/articles/5/pic17.jpg" alt="&#x5F02;&#x5E38;&#x68C0;&#x6D4B; - &#x7279;&#x5F81;&#x5904;&#x7406; - &#x597D;&#x7684;&#x7279;&#x5F81;" title="&#x5F02;&#x5E38;&#x68C0;&#x6D4B; - &#x7279;&#x5F81;&#x5904;&#x7406; - &#x597D;&#x7684;&#x7279;&#x5F81;">
<p>&#x5982;&#x679C;<script type="math/tex">x</script>&#x7684;&#x5206;&#x5E03;&#x957F;&#x8FD9;&#x4E2A;&#x6837;&#x5B50;&#xFF0C;&#x90A3;&#x5C31;&#x5F88;&#x5B8C;&#x7F8E;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x57FA;&#x672C;&#x6EE1;&#x8DB3;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#x3002;</p>
<img src="/articles/5/pic18.jpg" alt="&#x5F02;&#x5E38;&#x68C0;&#x6D4B; - &#x7279;&#x5F81;&#x5904;&#x7406; - &#x4E0D;&#x597D;&#x7684;&#x7279;&#x5F81;" title="&#x5F02;&#x5E38;&#x68C0;&#x6D4B; - &#x7279;&#x5F81;&#x5904;&#x7406; - &#x4E0D;&#x597D;&#x7684;&#x7279;&#x5F81;">
<p>&#x4F46;&#x662F;&#x5982;&#x679C;&#x5B83;&#x957F;&#x8FD9;&#x4E2A;&#x6837;&#x5B50;&#xFF0C;&#x5C31;&#x4E0D;&#x592A;&#x597D;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E00;&#x773C;&#x770B;&#x4E0A;&#x53BB;&#x5C31;&#x4E0D;&#x6EE1;&#x8DB3;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5BF9;&#x5B83;&#x8FDB;&#x884C;&#x4E00;&#x4E0B;&#x5904;&#x7406;&#xFF0C;&#x6211;&#x4EEC;&#x7528;<script type="math/tex">log(x)</script>&#x4F5C;&#x4E3A;&#x7279;&#x5F81;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x76F4;&#x63A5;&#x4F7F;&#x7528;<script type="math/tex">x</script>&#x4F5C;&#x4E3A;&#x7279;&#x5F81;&#xFF0C;&#x4E8E;&#x662F;&#x5C31;&#x5F97;&#x5230;&#x4E86;&#xFF1A;</p>
<img src="/articles/5/pic19.jpg" alt="&#x5F02;&#x5E38;&#x68C0;&#x6D4B; - &#x7279;&#x5F81;&#x5904;&#x7406; - &#x4E0D;&#x597D;&#x7684;&#x7279;&#x5F81;&#x7684;&#x5904;&#x7406;" title="&#x5F02;&#x5E38;&#x68C0;&#x6D4B; - &#x7279;&#x5F81;&#x5904;&#x7406; - &#x4E0D;&#x597D;&#x7684;&#x7279;&#x5F81;&#x7684;&#x5904;&#x7406;">
<p>&#x8FD9;&#x6837;&#x770B;&#x8D77;&#x6765;&#x5C31;&#x57FA;&#x672C;&#x6EE1;&#x8DB3;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#xFF0C;&#x53EF;&#x4EE5;&#x5EFA;&#x7ACB;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#x6A21;&#x578B;&#x4E86;&#x3002;</p>
<h3 id="&#x591A;&#x5143;&#x9AD8;&#x65AF;&#x5206;&#x5E03;"><a href="#&#x591A;&#x5143;&#x9AD8;&#x65AF;&#x5206;&#x5E03;" class="headerlink" title="&#x591A;&#x5143;&#x9AD8;&#x65AF;&#x5206;&#x5E03;"></a>&#x591A;&#x5143;&#x9AD8;&#x65AF;&#x5206;&#x5E03;</h3><p>&#x524D;&#x9762;&#x7684;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x7F3A;&#x70B9;&#xFF1A;&#x5206;&#x5E03;&#x592A;&#x201C;&#x6B63;&#x201D;&#x3002;</p>
<p>&#x600E;&#x4E48;&#x53EB;&#x592A;&#x201C;&#x6B63;&#x201D;&#x5462;&#xFF1F;&#x4EE5;&#x4E09;&#x7EF4;&#x7A7A;&#x95F4;&#x5185;&#x7684;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#x4E3A;&#x4F8B;&#xFF0C;&#x5047;&#x8BBE;&#x6709;<script type="math/tex">x_1</script>&#xFF0C;<script type="math/tex">x_2</script>&#x4E24;&#x4E2A;&#x7279;&#x5F81;&#xFF0C;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#x6700;&#x540E;&#x4F1A;&#x662F;&#x4E00;&#x5EA7;&#x5C71;&#x7684;&#x5F62;&#x72B6;&#x3002;</p>
<img src="/articles/5/pic20.jpg" alt="&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#x7684;&#x5F62;&#x72B6;" title="&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#x7684;&#x5F62;&#x72B6;">
<p>&#x53EA;&#x770B;&#x7279;&#x5F81;&#x7684;&#x7EF4;&#x5EA6;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;<script type="math/tex">x_1</script>&#xFF0C;<script type="math/tex">x_2</script>&#x6784;&#x6210;&#x7684;&#x4E8C;&#x7EF4;&#x5E73;&#x9762;&#xFF0C;&#x4F1A;&#x53D1;&#x73B0;&#x8FD9;&#x5EA7;&#x5C71;&#x7684;&#x5E95;&#x9762;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x201C;&#x6446;&#x7684;&#x5F88;&#x6B63;&#x201D;&#x7684;&#x692D;&#x5706;&#xFF0C;&#x8FD9;&#x8868;&#x793A;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#x7B97;&#x6CD5;&#x80FD;&#x591F;&#x62DF;&#x5408;&#x7684;&#x4E5F;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x5F62;&#x72B6;&#x7684;&#x6837;&#x672C;&#x70B9;&#x5206;&#x5E03;&#xFF0C;&#x8FD9;&#x6B63;&#x662F;&#x524D;&#x9762;&#x6240;&#x8BF4;&#x7684;&#x5404;&#x4E2A;&#x7279;&#x5F81;&#x4E4B;&#x95F4;&#x76F8;&#x4E92;&#x72EC;&#x7ACB;&#x7684;&#x60C5;&#x51B5;&#x3002;</p>
<p>&#x90A3;&#x95EE;&#x9898;&#x6765;&#x4E86;&#xFF0C;&#x5047;&#x5982;&#x6709;&#x4E00;&#x4E9B;&#x7279;&#x5F81;&#x4E4B;&#x95F4;&#x662F;&#x6709;&#x5173;&#x8054;&#x7684;&#xFF0C;&#x5BFC;&#x81F4;&#x6837;&#x672C;&#x70B9;&#x7684;&#x5206;&#x5E03;&#x662F;&#x4E2A;&#x201C;&#x659C;&#x201D;&#x7684;&#x692D;&#x5706;&#x5462;&#xFF1F;&#x4F8B;&#x5982;&#x4E0B;&#x56FE;&#x8FD9;&#x6837;&#xFF1A;</p>
<img src="/articles/5/pic21.jpg" alt="&#x201C;&#x659C;&#x7740;&#x201D;&#x7684;&#x6837;&#x672C;&#x70B9;&#x5206;&#x5E03;" title="&#x201C;&#x659C;&#x7740;&#x201D;&#x7684;&#x6837;&#x672C;&#x70B9;&#x5206;&#x5E03;">
<p>&#x663E;&#x7136;&#xFF0C;&#x770B;&#x8D77;&#x6765;<script type="math/tex">x_1</script>&#xFF0C;<script type="math/tex">x_2</script>&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x7740;&#x67D0;&#x79CD;&#x5173;&#x7CFB;&#xFF0C;&#x90A3;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x5982;&#x679C;&#x4ECD;&#x7136;&#x4F7F;&#x7528;&#x539F;&#x5148;&#x7684;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#x65B9;&#x6CD5;&#xFF0C;&#x4F1A;&#x51FA;&#x73B0;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#x5462;&#xFF1F;</p>
<p>&#x52A0;&#x5165;&#x6709;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&#x6837;&#x672C;&#x70B9;&#xFF0C;&#x770B;&#x4E0A;&#x53BB;&#x4F3C;&#x4E4E;&#x201C;&#x6E38;&#x79BB;&#x201D;&#x5728;&#x201C;&#x5927;&#x96C6;&#x4F53;&#x201D;&#x4E4B;&#x5916;&#xFF0C;&#x663E;&#x7136;&#x5E94;&#x8BE5;&#x662F;&#x4E2A;&#x5F02;&#x5E38;&#x60C5;&#x51B5;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x4ECE;<script type="math/tex">x_1</script>&#xFF0C;<script type="math/tex">x_2</script>&#x5404;&#x81EA;&#x7EF4;&#x5EA6;&#x4E0A;&#x7684;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#x5355;&#x72EC;&#x53BB;&#x770B;&#xFF0C;&#x5374;&#x53D1;&#x73B0;&#x5176;&#x843D;&#x5728;&#x4E86;&#x201C;&#x5927;&#x96C6;&#x4F53;&#x201D;&#x5728;&#x8BE5;&#x7EF4;&#x5EA6;&#x7684;&#x6295;&#x5F71;&#x5185;&#xFF0C;&#x6B63;&#x5E38;&#x7684;&#x6982;&#x7387;&#x5F88;&#x9AD8;&#xFF0C;&#x5176;&#x4E58;&#x79EF;&#x81EA;&#x7136;&#x4E5F;&#x9AD8;&#xFF0C;&#x7ED3;&#x679C;&#x5224;&#x5B9A;&#x5176;&#x4E3A;&#x6B63;&#x5E38;&#x60C5;&#x51B5;&#x3002;&#x8FD9;&#x663E;&#x7136;&#x662F;&#x6709;&#x95EE;&#x9898;&#x7684;&#x3002;</p>
<img src="/articles/5/pic22.jpg" alt="&#x201C;&#x659C;&#x7740;&#x201D;&#x7684;&#x6837;&#x672C;&#x70B9;&#x5206;&#x5E03; - &#x95EE;&#x9898;" title="&#x201C;&#x659C;&#x7740;&#x201D;&#x7684;&#x6837;&#x672C;&#x70B9;&#x5206;&#x5E03; - &#x95EE;&#x9898;">
<p>&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x529E;&#x6CD5;&#x5C31;&#x662F;&#x4F7F;&#x7528;&#x591A;&#x5143;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x518D;&#x5728;&#x6BCF;&#x4E2A;&#x5206;&#x91CF;&#x4E0A;&#x5355;&#x72EC;&#x5EFA;&#x7ACB;&#x4E00;&#x5143;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#xFF0C;&#x800C;&#x662F;&#x76F4;&#x63A5;&#x5EFA;&#x7ACB;&#x591A;&#x5143;&#x9AD8;&#x65AF;&#x5206;&#x5E03;</p>
<script type="math/tex; mode=display">p\left(x; \mu, \Sigma \right) = \frac{1}{(2\pi)^{\frac{1}{2}} \left| \Sigma \right| ^{\frac{1}{2}}} e^{-\frac{1}{2}\left( x - \mu \right)^T \Sigma^{-1} \left( x - \mu \right) }</script><p>&#x5176;&#x4E2D;&#xFF0C;<script type="math/tex">\mu \in \mathbb{R}^n</script>&#x662F;&#x5411;&#x91CF;&#x5316;&#x7684;&#x5747;&#x503C;&#xFF0C;&#x800C;<script type="math/tex">\Sigma \in \mathbb{R}^{n \times n}</script>&#x5219;&#x662F;&#x534F;&#x65B9;&#x5DEE;&#x77E9;&#x9635;&#xFF0C;&#x5C31;&#x662F;&#x5728;PCA&#x91CC;&#x4ECB;&#x7ECD;&#x8FC7;&#x7684;&#x90A3;&#x4E2A;&#x3002;</p>
<p>&#x591A;&#x5143;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#x7684;&#x4F4D;&#x7F6E;&#x9760;<script type="math/tex">\mu</script>&#x6765;&#x786E;&#x5B9A;&#xFF0C;&#x5F62;&#x72B6;&#x548C;&#x4F1A;&#x968F;&#x7740;<script type="math/tex">\Sigma</script>&#x7684;&#x53D8;&#x5316;&#x800C;&#x53D8;&#x5316;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x5F53;&#x534F;&#x65B9;&#x5DEE;&#x77E9;&#x9635;&#x7684;&#x975E;&#x5BF9;&#x89D2;&#x7EBF;&#x5143;&#x7D20;&#x4E0D;&#x4E3A;0&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5176;&#x5206;&#x5E03;&#x5C31;&#x53EF;&#x4EE5;&#x201C;&#x659C;&#x201D;&#x7740;&#x6765;&#x4E86;&#x3002;</p>
<img src="/articles/5/pic23.jpg" alt="&#x591A;&#x5143;&#x9AD8;&#x65AF;&#x5206;&#x5E03;" title="&#x591A;&#x5143;&#x9AD8;&#x65AF;&#x5206;&#x5E03;">
<p>&#x591A;&#x5143;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#x76F8;&#x6BD4;&#x4E8E;&#x4E4B;&#x524D;&#x7684;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#x7B97;&#x6CD5;&#xFF0C;&#x80FD;&#x591F;&#x66F4;&#x597D;&#x5730;&#x62DF;&#x5408;&#x6570;&#x636E;&#xFF0C;&#x4F46;&#x4F5C;&#x4E3A;&#x4EE3;&#x4EF7;&#xFF0C;&#x5176;&#x8BA1;&#x7B97;&#x7684;&#x4EE3;&#x4EF7;&#x66F4;&#x5927;&#x3002;</p>
<h3 id="&#x5F02;&#x5E38;&#x68C0;&#x6D4B;-vs-&#x76D1;&#x7763;&#x5B66;&#x4E60;"><a href="#&#x5F02;&#x5E38;&#x68C0;&#x6D4B;-vs-&#x76D1;&#x7763;&#x5B66;&#x4E60;" class="headerlink" title="&#x5F02;&#x5E38;&#x68C0;&#x6D4B; vs &#x76D1;&#x7763;&#x5B66;&#x4E60;"></a>&#x5F02;&#x5E38;&#x68C0;&#x6D4B; vs &#x76D1;&#x7763;&#x5B66;&#x4E60;</h3><p>&#x770B;&#x8D77;&#x6765;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x7684;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x5F88;&#x50CF;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x7684;&#x5957;&#x8DEF;&#xFF0C;&#x4F46;&#x662F;&#x5176;&#x4E0E;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x7B49;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x8FD8;&#x662F;&#x6709;&#x6240;&#x4E0D;&#x540C;&#x7684;&#xFF0C;&#x6240;&#x9002;&#x7528;&#x7684;&#x95EE;&#x9898;&#x4E5F;&#x5404;&#x6709;&#x4E0D;&#x540C;</p>
<h4 id="&#x6B63;&#x8D1F;&#x6837;&#x672C;&#x6570;"><a href="#&#x6B63;&#x8D1F;&#x6837;&#x672C;&#x6570;" class="headerlink" title="&#x6B63;&#x8D1F;&#x6837;&#x672C;&#x6570;"></a>&#x6B63;&#x8D1F;&#x6837;&#x672C;&#x6570;</h4><p>&#x5BF9;&#x4E8E;<script type="math/tex">y = 1</script>&#x7684;&#x6837;&#x672C;&#xFF0C;&#x79F0;&#x4E4B;&#x4E3A;&#x6B63;&#x6837;&#x672C;&#xFF0C;&#x800C;<script type="math/tex">y = 0</script>&#x7684;&#x6837;&#x672C;&#xFF0C;&#x5219;&#x4E3A;&#x8D1F;&#x6837;&#x672C;&#x3002;&#x5728;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x4E2D;&#xFF0C;&#x5904;&#x7406;&#x7684;&#x5F80;&#x5F80;&#x662F;&#x504F;&#x659C;&#x6570;&#x636E;&#xFF0C;&#x6B63;&#x6837;&#x672C;&#x6570;&#x6781;&#x5C11;&#xFF0C;&#x8D1F;&#x6837;&#x672C;&#x6570;&#x6781;&#x591A;&#x3002;&#x800C;&#x5728;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x4E2D;&#xFF0C;&#x6B63;&#x8D1F;&#x6837;&#x672C;&#x6570;&#x5F80;&#x5F80;&#x90FD;&#x5F88;&#x591A;&#x3002;</p>
<h4 id="&#x5F02;&#x5E38;&#x79CD;&#x7C7B;"><a href="#&#x5F02;&#x5E38;&#x79CD;&#x7C7B;" class="headerlink" title="&#x5F02;&#x5E38;&#x79CD;&#x7C7B;"></a>&#x5F02;&#x5E38;&#x79CD;&#x7C7B;</h4><p>&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x5728;&#x72B6;&#x6001;&#x68C0;&#x6D4B;&#x65B9;&#x9762;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x4E2A;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#xFF0C;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x8BAD;&#x7EC3;&#x96C6;&#x5927;&#x81F4;&#x5730;&#x4E86;&#x89E3;&#x6B63;&#x6837;&#x672C;&#x957F;&#x4EC0;&#x4E48;&#x6837;&#xFF0C;&#x540C;&#x65F6;&#x8981;&#x6C42;&#x672A;&#x6765;&#x7684;&#x6B63;&#x6837;&#x672C;&#x4E5F;&#x5FC5;&#x987B;&#x548C;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#x7684;&#x6B63;&#x6837;&#x672C;&#x957F;&#x5F97;&#x5DEE;&#x4E0D;&#x591A;&#x624D;&#x80FD;&#x591F;&#x88AB;&#x5F88;&#x597D;&#x5730;&#x9884;&#x6D4B;&#x51FA;&#x6765;&#xFF0C;&#x800C;&#x5BF9;&#x5E94;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x77E5;&#x9053;&#x5F02;&#x5E38;&#x60C5;&#x51B5;&#x5927;&#x81F4;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x3002;</p>
<p>&#x7136;&#x800C;&#x5F02;&#x5E38;&#x5F80;&#x5F80;&#x662F;&#x5C42;&#x51FA;&#x4E0D;&#x7A77;&#x7684;&#xFF0C;&#x5F88;&#x96BE;&#x4E8B;&#x5148;&#x5C31;&#x627E;&#x5230;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x7684;&#x5F02;&#x5E38;&#x60C5;&#x51B5;&#xFF0C;&#x672A;&#x6765;&#x4E5F;&#x6709;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x4E4B;&#x524D;&#x4ECE;&#x672A;&#x51FA;&#x73B0;&#x8FC7;&#x7684;&#x7C7B;&#x578B;&#x7684;&#x5F02;&#x5E38;&#xFF0C;&#x56E0;&#x6B64;&#x5F88;&#x96BE;&#x901A;&#x8FC7;&#x7B97;&#x6CD5;&#x6765;&#x901A;&#x8FC7;&#x8BAD;&#x7EC3;&#x5B9A;&#x4F4D;&#x5F02;&#x5E38;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x5C31;&#x9002;&#x5408;&#x4F7F;&#x7528;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;&#x3002;</p>
<h4 id="&#x5E94;&#x7528;"><a href="#&#x5E94;&#x7528;" class="headerlink" title="&#x5E94;&#x7528;"></a>&#x5E94;&#x7528;</h4><p>&#x5728;&#x5B9E;&#x9645;&#x751F;&#x6D3B;&#x4E2D;&#xFF0C;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x548C;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x4E5F;&#x5206;&#x522B;&#x5E94;&#x7528;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x9762;&#x3002;</p>
<div class="table-container">
<table>
<thead>
<tr>
<th>&#x5F02;&#x5E38;&#x68C0;&#x6D4B;</th>
<th>&#x76D1;&#x7763;&#x5B66;&#x4E60;</th>
</tr>
</thead>
<tbody>
<tr>
<td>&#x6B3A;&#x8BC8;&#x68C0;&#x6D4B;</td>
<td>&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x68C0;&#x6D4B;</td>
</tr>
<tr>
<td>&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x76D1;&#x63A7;</td>
<td>&#x5929;&#x6C14;&#x9884;&#x62A5;</td>
</tr>
<tr>
<td>&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x72B6;&#x6001;&#x76D1;&#x63A7;</td>
<td>&#x764C;&#x75C7;&#x68C0;&#x6D4B;</td>
</tr>
<tr>
<td><script type="math/tex">\cdots</script></td>
<td><script type="math/tex">\cdots</script></td>
</tr>
</tbody>
</table>
</div>
<p><br></p>
<h2 id="&#x603B;&#x7ED3;"><a href="#&#x603B;&#x7ED3;" class="headerlink" title="&#x603B;&#x7ED3;"></a>&#x603B;&#x7ED3;</h2><p>&#x6CA1;&#x60F3;&#x5230;&#x6700;&#x540E;&#x5199;&#x51FA;&#x6765;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x5176;&#x5B9E;&#x603B;&#x4F53;&#x4E0A;&#x8FD8;&#x662F;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#x7684;&#x3002;PCA&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x7167;&#x516C;&#x5F0F;&#x8BA1;&#x7B97;&#x4E0B;&#x6765;&#x5C31;&#x597D;&#xFF0C;&#x8BFE;&#x7A0B;&#x91CC;&#x5176;&#x5B9E;&#x4E5F;&#x6CA1;&#x600E;&#x4E48;&#x5177;&#x4F53;&#x89E3;&#x91CA;&#x3002;K&#x5747;&#x503C;&#x548C;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x7684;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#x7684;&#x7B97;&#x6CD5;&#x8FD8;&#x662F;&#x5F88;&#x597D;&#x7406;&#x89E3;&#x7684;&#xFF0C;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x6837;&#x672C;&#x70B9;&#x6309;&#x7167;&#x5176;&#x5206;&#x5E03;&#x8DDF;&#x6700;&#x8FD1;&#x7684;&#x6837;&#x672C;&#x70B9;&#x62B1;&#x56E2;&#x53D6;&#x6696;&#x5212;&#x5206;&#x51FA;&#x4E00;&#x4E2A;&#x4E2A;&#x5708;&#x5B50;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x6709;&#x65B0;&#x7684;&#x6837;&#x672C;&#x70B9;&#x9700;&#x8981;&#x5224;&#x65AD;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x770B;&#x5B83;&#x79BB;&#x90A3;&#x4E2A;&#x5708;&#x5B50;&#x66F4;&#x8FD1;&#x6216;&#x8005;&#x662F;&#x5426;&#x662F;&#x5708;&#x91CC;&#x7684;&#x8FD8;&#x662F;&#x5708;&#x5916;&#x7684;&#x5373;&#x53EF;&#x3002;</p>
<p>&#x5509;&#xFF0C;&#x653E;&#x5047;&#x56DE;&#x5BB6;&#xFF0C;&#x6709;&#x79CD;&#x75DB;&#x82E6;&#x53EB;&#x4E0D;&#x77E5;&#x9053;&#x4F1A;&#x4E0D;&#x4F1A;&#x6302;&#xFF0C;&#x6210;&#x7EE9;&#x8FD8;&#x8001;&#x662F;&#x6CA1;&#x51FA;&#xFF0C;&#x4E8E;&#x662F;&#x60F6;&#x60F6;&#x4E0D;&#x53EF;&#x7EC8;&#x65E5;&#x2026;&#x2026;</p>

      
    </div>

  </div>

  <div class="article-footer">
    <div class="article-meta pull-left">

    
      

    <span class="post-categories">
      <i class="icon-categories"></i>
        <a href="/categories/学习笔记/">学习笔记</a>
    </span>
    

    
    

    <span class="post-tags">
      <i class="icon-tags"></i>
        <a href="/tags/机器学习/">机器学习</a><a href="/tags/Coursera/">Coursera</a>
    </span>
    

    </div>

    
  </div>
</article>


    </main>

    <footer class="site-footer">
  <p class="site-info">
    Proudly powered by <a href="https://hexo.io/" target="_blank">Hexo</a> and
    Theme by <a href="https://github.com/kawaiiQ/kawaiiHacker" target="_blank">kawaiiHacker</a>
    <br>
    
    &copy; 2019 _kawaiiQ
    
  </p>
</footer>
    
    
<script>
  widget_settings = {
    maxDistance: 15,
    sensitive: 0.01
  };
</script>
<script src="/js/logo-widget.js"></script>



<script type="text/x-mathjax-config">
  MathJax.Hub.Config({
    tex2jax: {
      inlineMath: [['$','$'], ["\\(","\\)"] ],
      processEscapes: true
    }
  });
</script>
<script type="text/javascript" async src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/MathJax.js?config=TeX-MML-AM_CHTML">
</script>


  </div>
</div><!-- hexo-inject:begin --><!-- hexo-inject:end -->
</body>
</html>