<!DOCTYPE HTML>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
  <!-- hexo-inject:begin --><!-- hexo-inject:end --><meta charset="utf-8">
  
  <title>Coursera《机器学习》学习笔记（三）：算法评估篇 | _kawaiiQ&#39;s blog</title>

  
  <meta name="author" content="_kawaiiQ">
  

  
  <meta name="description" content="&amp;#x4E3A;&amp;#x4EC0;&amp;#x4E48;&amp;#x8DDD;&amp;#x79BB;&amp;#x4E0A;&amp;#x4E00;&amp;#x7BC7;&amp;#x603B;&amp;#x7ED3;&amp;#x4F1A;&amp;#x8FC7;&amp;#x4E86;&amp;#x8FD9;&amp;#x4E48;&amp;#x4E45;&amp;#x5462;&amp;#xFF0C;&amp;#x56E0;&amp;#x4E3A;&amp;#x4F5C;&amp;#x4E1A;&amp;#x548C;&amp;#x8003;&amp;#x8BD5;&amp;#x592A;&amp;#x591A;&amp;#x2026;&amp;#x2026;
&amp;#x8FD9;&amp;#x5B66;&amp;#x671F;&amp;#x9009;&amp;#x4E86;&amp;#x9AD8;&amp;#x7EA7;&amp;#x4EBA;&amp;#x5DE5;&amp;#x667A;&amp;#x80FD;&amp;#x8BFE;&amp;#xFF0C;&amp;#x8BFE;&amp;#x7A0B;&amp;#x7684;&amp;#x5927;&amp;#x4F5C;&amp;#x4E1A;&amp;#x662F;&amp;#x6307;&amp;#x5B9A;&amp;#x53C2;&amp;#x52A0;CCF&amp;#x7684;&amp;#x5927;&amp;#x6570;&amp;#x636E;&amp;#x7ADE;&amp;#x8D5B;&amp;#xFF0C;&amp;#x7136;&amp;#x540E;&amp;#x521D;&amp;#x751F;&amp;#x725B;&amp;#x728A;&amp;#x4E0D;&amp;#x6015;&amp;#x864E;&amp;#x673A;&amp;#x5668;&amp;#x5B66;&amp;#x4E60;&amp;#x5149;&amp;#x77E5;&amp;#x9053;&amp;#x8FD9;&amp;#x56DB;&amp;#x4E2A;&amp;#x5B57;&amp;#x7684;&amp;#x6211;&amp;#x5355;&amp;#x67AA;&amp;#x5339;&amp;#x9A6C;&amp;#x5730;&amp;#x6740;&amp;#x4E86;&amp;#x8FDB;&amp;#x53BB;&amp;#xFF0C;&amp;#x7136;&amp;#x540E;&amp;#x88AB;&amp;#x8650;&amp;#x5F97;&amp;#x9F3B;&amp;#x9752;&amp;#x8138;&amp;#x80BF;&amp;#x3002;&amp;#x773C;&amp;#x770B;&amp;#x7740;&amp;#x7FA4;&amp;#x91CC;&amp;#x7684;&amp;#x5927;&amp;#x795E;&amp;#x4E00;&amp;#x4E2A;&amp;#x4E2A;&amp;#x54C0;&amp;#x568E;&amp;#x4E0D;&amp;#x4F1A;&amp;#x505A;&amp;#x4E0D;&amp;#x4F1A;&amp;#x505A;&amp;#x5206;&amp;#x6570;&amp;#x592A;&amp;#x4F4E;&amp;#x5206;&amp;#x6570;&amp;#x592A;&amp;#x4F4E;&amp;#xFF0C;&amp;#x7ED3;&amp;#x679C;&amp;#x6210;&amp;#x7EE9;&amp;#x51FA;&amp;#x6765;&amp;#x6BD4;&amp;#x8C01;&amp;#x90FD;&amp;#x597D;&amp;#xFF0C;&amp;#x50CF;&amp;#x6211;&amp;#x8FD9;&amp;#x6837;&amp;#x7684;&amp;#x5C31;&amp;#x89C9;&amp;#x5F97;&amp;#x2026;&amp;#x2026;

&amp;#x53CD;&amp;#x6B63;&amp;#x662F;&amp;#x77E5;&amp;#x8BC6;&amp;#x8DDF;&amp;#x7ECF;&amp;#x9A8C;&amp;#x6CA1;&amp;#x5B66;&amp;#x5230;&amp;#x591A;&amp;#x5C11;&amp;#xFF0C;&amp;#x6F14;&amp;#x6280;&amp;#x5927;&amp;#x6709;&amp;#x957F;&amp;#x8FDB;&amp;#x3002;&amp;#x8FD9;&amp;#x5468;&amp;#x4E8C;&amp;#x665A;&amp;#x4E0A;&amp;#x5927;&amp;#x4F5C;&amp;#x4E1A;&amp;#x7B54;&amp;#x8FA9;&amp;#xFF0C;&amp;#x53F0;&amp;#x4E0B;&amp;#x8001;&amp;#x5E08;&amp;#x5F20;&amp;#x53E3;&amp;#x5C31;&amp;#x662F;&amp;#x4E00;&amp;#x53E5;&amp;#x56FD;&amp;#x79D1;&amp;#x5927;&amp;#x7684;&amp;#x5B66;&amp;#x751F;&amp;#x80FD;&amp;#x529B;&amp;#x5E94;&amp;#x8BE5;&amp;#x5F88;&amp;#x5F3A;&amp;#x7684;&amp;#xFF0C;&amp;#x8FD9;&amp;#x79CD;&amp;#x6BD4;&amp;#x8D5B;&amp;#x6211;&amp;#x4EEC;&amp;#x7684;&amp;#x540D;&amp;#x6B21;&amp;#x5E94;&amp;#x8BE5;&amp;#x5F88;&amp;#x597D;&amp;#x7684;&amp;#x3002;&amp;#x5C31;&amp;#x89C9;&amp;#x5F97;&amp;#x5B9E;&amp;#x5728;&amp;#x662F;&amp;#x65E0;&amp;#x989C;&amp;#x4EE5;&amp;#x5BF9;&amp;#xFF0C;&amp;#x7ED9;&amp;#x5927;&amp;#x4F6C;&amp;#x4EEC;&amp;#x62D6;&amp;#x540E;&amp;#x817F;&amp;#x4E86;&amp;#x2026;&amp;#x2026;

&amp;#x8FD9;&amp;#x4E00;&amp;#x7BC7;&amp;#x662F;&amp;#x300A;&amp;#x673A;&amp;#x5668;&amp;#x5B66;&amp;#x4E60;&amp;#x300B;&amp;#x7B2C;&amp;#x516D;&amp;#x5468;&amp;#x77E5;&amp;#x8BC6;&amp;#x70B9;&amp;#x7684;&amp;#x603B;&amp;#x7ED3;&amp;#xFF0C;&amp;#x4E3B;&amp;#x8981;&amp;#x662F;&amp;#x201C;&amp;#x4E8B;&amp;#x540E;&amp;#x68C0;&amp;#x67E5;&amp;#x201D;&amp;#xFF0C;&amp;#x4E3B;&amp;#x8981;&amp;#x6D89;&amp;#x53CA;&amp;#x673A;&amp;#x5668;&amp;#x5B66;&amp;#x4E60;&amp;#x7B97;&amp;#x6CD5;&amp;#x7684;&amp;#x8BC4;&amp;#x4F30;&amp;#x3001;&amp;#x53D1;&amp;#x73B0;&amp;#x95EE;&amp;#x9898;&amp;#x540E;&amp;#x7684;&amp;#x89E3;&amp;#x51B3;&amp;#x65B9;&amp;#x6848;&amp;#x3002;">
  

  
  
  <meta name="keywords" content="机器学习,Coursera">
  

  <meta id="viewport" name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no, minimal-ui">
  <meta name="apple-mobile-web-app-capable" content="yes">
  <meta name="apple-mobile-web-app-status-bar-style" content="black">

  <meta property="og:title" content="Coursera《机器学习》学习笔记（三）：算法评估篇">

  <meta property="og:site_name" content="_kawaiiQ&#39;s blog">

  
  <meta property="og:image" content="/favicon.ico">
  

  <link href="/favicon.ico" rel="icon">
  <link rel="alternate" href="/atom.xml" title="_kawaiiQ&#39;s blog" type="application/atom+xml">
  <link rel="stylesheet" href="/css/style.css" media="screen" type="text/css">

  <link rel="dns-prefetch" href="https://cdnjs.cloudflare.com"><!-- hexo-inject:begin --><!-- hexo-inject:end -->

</head>


<body>
<!-- hexo-inject:begin --><!-- hexo-inject:end --><div class="blog">
  <div class="content">

    <header>
  <div class="site-branding">
    <h1 class="site-logo">
      <div>
        <a href="/"><img src="/images/logo.png"></a>
        
          <a href="/"><img id="logo-widget" src="/images/widget.png"></a>
        
      </div>
    </h1>
    <p class="site-description">Blind Busy All Day</p>
  </div>
  <nav class="site-navigation">
    <ul>
      
        <li><a href="/">主页</a></li>
      
        <li><a href="/categories">分类</a></li>
      
        <li><a href="/archives">所有文章</a></li>
      
        <li><a href="/about">关于我</a></li>
      
    </ul>
  </nav>
</header>

    <main class="site-main posts-loop">
    <article>

  
    
    <h3 class="article-title"><span>Coursera《机器学习》学习笔记（三）：算法评估篇</span></h3>
    
  

  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/articles/3/" rel="bookmark">
        <time class="entry-date published" datetime="2018-01-10T18:00:00.000Z">
          2018-01-11
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <p>&#x4E3A;&#x4EC0;&#x4E48;&#x8DDD;&#x79BB;&#x4E0A;&#x4E00;&#x7BC7;&#x603B;&#x7ED3;&#x4F1A;&#x8FC7;&#x4E86;&#x8FD9;&#x4E48;&#x4E45;&#x5462;&#xFF0C;&#x56E0;&#x4E3A;&#x4F5C;&#x4E1A;&#x548C;&#x8003;&#x8BD5;&#x592A;&#x591A;&#x2026;&#x2026;</p>
<p>&#x8FD9;&#x5B66;&#x671F;&#x9009;&#x4E86;&#x9AD8;&#x7EA7;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x8BFE;&#xFF0C;&#x8BFE;&#x7A0B;&#x7684;&#x5927;&#x4F5C;&#x4E1A;&#x662F;&#x6307;&#x5B9A;&#x53C2;&#x52A0;CCF&#x7684;&#x5927;&#x6570;&#x636E;&#x7ADE;&#x8D5B;&#xFF0C;&#x7136;&#x540E;&#x521D;&#x751F;&#x725B;&#x728A;&#x4E0D;&#x6015;&#x864E;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x5149;&#x77E5;&#x9053;&#x8FD9;&#x56DB;&#x4E2A;&#x5B57;&#x7684;&#x6211;&#x5355;&#x67AA;&#x5339;&#x9A6C;&#x5730;&#x6740;&#x4E86;&#x8FDB;&#x53BB;&#xFF0C;&#x7136;&#x540E;&#x88AB;&#x8650;&#x5F97;&#x9F3B;&#x9752;&#x8138;&#x80BF;&#x3002;&#x773C;&#x770B;&#x7740;&#x7FA4;&#x91CC;&#x7684;&#x5927;&#x795E;&#x4E00;&#x4E2A;&#x4E2A;&#x54C0;&#x568E;&#x4E0D;&#x4F1A;&#x505A;&#x4E0D;&#x4F1A;&#x505A;&#x5206;&#x6570;&#x592A;&#x4F4E;&#x5206;&#x6570;&#x592A;&#x4F4E;&#xFF0C;&#x7ED3;&#x679C;&#x6210;&#x7EE9;&#x51FA;&#x6765;&#x6BD4;&#x8C01;&#x90FD;&#x597D;&#xFF0C;&#x50CF;&#x6211;&#x8FD9;&#x6837;&#x7684;&#x5C31;&#x89C9;&#x5F97;&#x2026;&#x2026;</p>
<p><img src="/images/buddha-is-compassionate.jpg" alt></p>
<p>&#x53CD;&#x6B63;&#x662F;&#x77E5;&#x8BC6;&#x8DDF;&#x7ECF;&#x9A8C;&#x6CA1;&#x5B66;&#x5230;&#x591A;&#x5C11;&#xFF0C;&#x6F14;&#x6280;&#x5927;&#x6709;&#x957F;&#x8FDB;&#x3002;&#x8FD9;&#x5468;&#x4E8C;&#x665A;&#x4E0A;&#x5927;&#x4F5C;&#x4E1A;&#x7B54;&#x8FA9;&#xFF0C;&#x53F0;&#x4E0B;&#x8001;&#x5E08;&#x5F20;&#x53E3;&#x5C31;&#x662F;&#x4E00;&#x53E5;&#x56FD;&#x79D1;&#x5927;&#x7684;&#x5B66;&#x751F;&#x80FD;&#x529B;&#x5E94;&#x8BE5;&#x5F88;&#x5F3A;&#x7684;&#xFF0C;&#x8FD9;&#x79CD;&#x6BD4;&#x8D5B;&#x6211;&#x4EEC;&#x7684;&#x540D;&#x6B21;&#x5E94;&#x8BE5;&#x5F88;&#x597D;&#x7684;&#x3002;&#x5C31;&#x89C9;&#x5F97;&#x5B9E;&#x5728;&#x662F;&#x65E0;&#x989C;&#x4EE5;&#x5BF9;&#xFF0C;&#x7ED9;&#x5927;&#x4F6C;&#x4EEC;&#x62D6;&#x540E;&#x817F;&#x4E86;&#x2026;&#x2026;</p>
<p><img src="/images/i-can-do-nothing.jpg" alt></p>
<p>&#x8FD9;&#x4E00;&#x7BC7;&#x662F;<a href="https://www.coursera.org/learn/machine-learning" target="_blank" rel="external">&#x300A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x300B;</a>&#x7B2C;&#x516D;&#x5468;&#x77E5;&#x8BC6;&#x70B9;&#x7684;&#x603B;&#x7ED3;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x201C;&#x4E8B;&#x540E;&#x68C0;&#x67E5;&#x201D;&#xFF0C;&#x4E3B;&#x8981;&#x6D89;&#x53CA;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x7684;&#x8BC4;&#x4F30;&#x3001;&#x53D1;&#x73B0;&#x95EE;&#x9898;&#x540E;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</p>
<a id="more"></a>
<h2 id="&#x4E3B;&#x8981;&#x5185;&#x5BB9;"><a href="#&#x4E3B;&#x8981;&#x5185;&#x5BB9;" class="headerlink" title="&#x4E3B;&#x8981;&#x5185;&#x5BB9;"></a>&#x4E3B;&#x8981;&#x5185;&#x5BB9;</h2><ul>
<li>&#x8BC4;&#x4F30;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;</li>
<li>&#x5206;&#x6790;&#x5E76;&#x89E3;&#x51B3;&#x51FA;&#x73B0;&#x7684;&#x95EE;&#x9898;</li>
<li>&#x5904;&#x7406;&#x504F;&#x5DEE;&#x6570;&#x636E;</li>
</ul>
<p><br></p>
<h2 id="&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x7684;&#x8BC4;&#x4F30;"><a href="#&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x7684;&#x8BC4;&#x4F30;" class="headerlink" title="&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x7684;&#x8BC4;&#x4F30;"></a>&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x7684;&#x8BC4;&#x4F30;</h2><p>&#x5F53;&#x5199;&#x597D;&#x4E86;&#x4E00;&#x4E2A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x7A0B;&#x5E8F;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5F97;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x7684;&#x6548;&#x679C;&#x5230;&#x5E95;&#x600E;&#x4E48;&#x6837;&#xFF0C;&#x51C6;&#x786E;&#x7387;&#x51E0;&#x4F55;&#xFF0C;&#x5230;&#x5E95;&#x80FD;&#x4E0D;&#x80FD;&#x89E3;&#x51B3;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<h3 id="&#x8BC4;&#x4EF7;&#x7B97;&#x6CD5;"><a href="#&#x8BC4;&#x4EF7;&#x7B97;&#x6CD5;" class="headerlink" title="&#x8BC4;&#x4EF7;&#x7B97;&#x6CD5;"></a>&#x8BC4;&#x4EF7;&#x7B97;&#x6CD5;</h3><p>&#x4EE5;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x4E3A;&#x4F8B;&#xFF0C;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x5DF2;&#x7ECF;&#x60F3;&#x5230;&#x4E86;&#x4E00;&#x79CD;&#x8BC4;&#x4EF7;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x597D;&#x574F;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5373;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#xFF1A;</p>
<script type="math/tex; mode=display">J(\theta) = - \frac{1}{m} \sum_{i=1}^m \left[ y^{(i)}\ \log (h_\theta (x^{(i)})) + (1 - y^{(i)})\ \log (1 - h_\theta(x^{(i)})) + \lambda\sum_{j=1}^n \theta_j^2\right]</script><p>&#x9A6C;&#x4E0A;&#x60F3;&#x5230;&#x7684;&#x5C31;&#x662F;&#x8DD1;&#x597D;&#x53C2;&#x6570;&#x4E4B;&#x540E;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x7B97;&#x4E00;&#x904D;&#x770B;&#x4EE3;&#x4EF7;&#x503C;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x53EA;&#x80FD;&#x53CD;&#x6620;&#x51FA;&#x5F53;&#x524D;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x5E76;&#x4E0D;&#x80FD;&#x771F;&#x5B9E;&#x53CD;&#x6620;&#x7A0B;&#x5E8F;&#x7684;&#x51C6;&#x786E;&#x7387;&#xFF0C;&#x56E0;&#x4E3A;&#x62FF;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x8DD1;&#x51FA;&#x6765;&#x7684;&#x51C6;&#x786E;&#x7387;&#x518D;&#x9AD8;&#x53EA;&#x80FD;&#x53CD;&#x6620;&#x7A0B;&#x5E8F;&#x5728;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x4E0A;&#x8DD1;&#x7684;&#x5F88;&#x597D;&#xFF0C;&#x7ED3;&#x679C;&#x4E0D;&#x4E00;&#x5B9A;&#x5C31;&#x80FD;&#x6CDB;&#x5316;&#x5230;&#x6240;&#x6709;&#x60C5;&#x51B5;&#x5F53;&#x4E2D;&#x3002;&#x6BD4;&#x65B9;&#x8BF4;&#xFF0C;&#x54EA;&#x6015;&#x4F60;&#x628A;&#x82F1;&#x8BED;&#x4E66;&#x5403;&#x4E0B;&#x53BB;&#xFF0C;&#x5BF9;&#x4E8E;&#x8003;&#x6570;&#x5B66;&#x6765;&#x8BF4;&#xFF0C;&#x4E5F;&#x662F;&#x6CA1;&#x7528;&#x7684;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x8BC4;&#x4F30;&#x7B97;&#x6CD5;&#x597D;&#x574F;&#x4E3B;&#x8981;&#x7684;&#x601D;&#x8DEF;&#x662F;&#xFF0C;&#x7528;&#x8BAD;&#x7EC3;&#x96C6;&#x4E4B;&#x5916;&#x7684;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x8BC4;&#x4EF7;&#xFF0C;&#x6362;&#x4E00;&#x4E2A;&#x89D2;&#x5EA6;&#x6765;&#x8BF4;&#xFF0C;&#x5C31;&#x662F;&#x4E0D;&#x628A;&#x624B;&#x5934;&#x7684;&#x6240;&#x6709;&#x6570;&#x636E;&#x90FD;&#x62FF;&#x6765;&#x8BAD;&#x7EC3;&#x3002;</p>
<h4 id="&#x5212;&#x5206;&#x6D4B;&#x8BD5;&#x96C6;"><a href="#&#x5212;&#x5206;&#x6D4B;&#x8BD5;&#x96C6;" class="headerlink" title="&#x5212;&#x5206;&#x6D4B;&#x8BD5;&#x96C6;"></a>&#x5212;&#x5206;&#x6D4B;&#x8BD5;&#x96C6;</h4><p>&#x4E00;&#x79CD;&#x529E;&#x6CD5;&#x662F;&#xFF0C;&#x5C06;&#x6570;&#x636E;&#x6309;&#x4E00;&#x5B9A;&#x6BD4;&#x4F8B;&#xFF08;&#x4F8B;&#x5982;7&#xFF1A;3&#xFF09;&#xFF0C;&#x5206;&#x5272;&#x4E3A;<strong>&#x8BAD;&#x7EC3;&#x96C6;</strong>&#x548C;<strong>&#x6D4B;&#x8BD5;&#x96C6;</strong>&#x4E24;&#x90E8;&#x5206;&#xFF0C;&#x4F7F;&#x7528;&#x8BAD;&#x7EC3;&#x96C6;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#xFF0C;&#x800C;&#x4F7F;&#x7528;&#x6D4B;&#x8BD5;&#x96C6;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;&#x3002;&#x5728;&#x4F7F;&#x7528;&#x6D4B;&#x8BD5;&#x96C6;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;&#x65F6;&#xFF0C;&#x6D4B;&#x8BD5;&#x7ED3;&#x679C;&#x7684;&#x8BA1;&#x7B97;&#x4E0E;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x7C7B;&#x4F3C;&#x3002;</p>
<p>&#x5176;&#x4E2D;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x7684;&#x8BA1;&#x7B97;&#x65B9;&#x6CD5;&#x4E3A;&#xFF1A;</p>
<script type="math/tex; mode=display">J_{test}(\Theta) = \dfrac{1}{2m_{test}} \sum_{i=1}^{m_{test}}(h_\Theta(x^{(i)}_{test}) - y^{(i)}_{test})^2</script><p>&#x800C;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x7684;&#x8BA1;&#x7B97;&#x65B9;&#x6CD5;&#x4E3A;&#xFF1A;</p>
<script type="math/tex; mode=display">J_{test}(\Theta)=
\begin{cases}
1& h_\Theta(x) \geq 0.5\ and\ y = 0\ or\ h_\Theta(x) < 0.5\ and\ y = 1 \\
0 & otherwise
\end{cases}</script><p>&#x8FD9;&#x6837;&#x603B;&#x4F53;&#x7684;&#x6B65;&#x9AA4;&#x5C31;&#x4E3A;&#x4E24;&#x6B65;&#xFF1A;&#x4F7F;&#x7528;&#x8BAD;&#x7EC3;&#x96C6;&#x8BAD;&#x7EC3;&#xFF0C;&#x4F7F;&#x7528;&#x6D4B;&#x8BD5;&#x96C6;&#x8BA1;&#x7B97;$J_{test}(\Theta)$&#x3002;</p>
<h4 id="&#x6A21;&#x578B;&#x7684;&#x9009;&#x62E9;"><a href="#&#x6A21;&#x578B;&#x7684;&#x9009;&#x62E9;" class="headerlink" title="&#x6A21;&#x578B;&#x7684;&#x9009;&#x62E9;"></a>&#x6A21;&#x578B;&#x7684;&#x9009;&#x62E9;</h4><p>&#x5728;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x4E0E;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5728;&#x4E00;&#x5F00;&#x59CB;&#x5148;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x591A;&#x9879;&#x5F0F;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x3002;&#x7136;&#x800C;&#x9009;&#x62E9;&#x4EC0;&#x4E48;&#x591A;&#x9879;&#x5F0F;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x4E2A;&#x96BE;&#x9898;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x6709;&#x4E86;&#x4E8B;&#x540E;&#x8BC4;&#x4EF7;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x591A;&#x4E2A;&#x591A;&#x9879;&#x5F0F;&#xFF0C;&#x4ECE;&#x4E2D;&#x9009;&#x62E9;&#x6700;&#x597D;&#x7684;&#x90A3;&#x4E2A;&#x4E86;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x6211;&#x4EEC;&#x9009;&#x62E9;&#x4E86;1&#x3001;2&#x3001;3&#x3001;4&#x3001;&#x2026;&#x2026;&#x3001;10&#x6B21;&#x591A;&#x9879;&#x5F0F;&#xFF0C;&#x901A;&#x8FC7;&#x8BAD;&#x7EC3;&#xFF0C;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x5F97;&#x5230;&#x4E86;&#x5404;&#x4E2A;&#x591A;&#x9879;&#x5F0F;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x5206;&#x522B;&#x4E3A;<script type="math/tex">\Theta^{(1)}</script>&#x3001;<script type="math/tex">\Theta^{(2)}</script>&#x3001;<script type="math/tex">\Theta^{(3)}</script>&#x3001;<script type="math/tex">\Theta^{(4)}</script>&#x3001;&#x2026;&#x2026;&#x3001;<script type="math/tex">\Theta^{(10)}</script>&#x3002;&#x90A3;&#x4E48;&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x8BA1;&#x7B97;<script type="math/tex">J_{test}(\Theta^{(1)})</script>&#x3001;<script type="math/tex">J_{test}(\Theta^{(2)})</script>&#x3001;<script type="math/tex">J_{test}(\Theta^{(3)})</script>&#x3001;<script type="math/tex">J_{test}(\Theta)^{(4)}</script>&#x3001;&#x2026;&#x2026;<script type="math/tex">J_{test}(\Theta^{(10)})</script>&#xFF0C;&#x7136;&#x540E;&#x9009;&#x62E9;&#x6700;&#x5C0F;&#x503C;&#x4E86;&#x3002;</p>
<p>&#x7136;&#x800C;&#xFF0C;&#x8FD9;&#x6837;&#x505A;&#x4ECD;&#x7136;&#x4E0D;&#x80FD;&#x8DB3;&#x591F;&#x516C;&#x5E73;&#x5730;&#x8BF4;&#x660E;&#x9009;&#x62E9;&#x7684;&#x5047;&#x8BBE;&#x63A8;&#x5E7F;&#x5230;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x65F6;&#x7684;&#x6548;&#x679C;&#x3002;&#x5176;&#x539F;&#x56E0;&#x5728;&#x4E8E;&#xFF0C;&#x6211;&#x4EEC;&#x5F97;&#x5230;&#x7684;&#x6700;&#x5C0F;&#x503C;&#x4EC5;&#x4EC5;&#x662F;&#x9488;&#x5BF9;&#x6D4B;&#x8BD5;&#x96C6;&#x6240;&#x5F97;&#x51FA;&#x7684;&#x6700;&#x5C0F;&#x503C;&#xFF0C;&#x8FD9;&#x4E2A;&#x4F30;&#x8BA1;&#x592A;&#x8FC7;&#x4E8E;&#x4E50;&#x89C2;&#x3002;&#x4E3A;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x9664;&#x4E86;&#x5728;&#x5212;&#x5206;&#x6D4B;&#x8BD5;&#x96C6;&#x4E4B;&#x5916;&#xFF0C;&#x8FD8;&#x4F1A;&#x6309;&#x4E00;&#x5B9A;&#x6BD4;&#x4F8B;&#xFF08;&#x4F8B;&#x5982;6&#xFF1A;2&#xFF1A;2&#xFF09;&#x518D;&#x5212;&#x5206;&#x51FA;&#x4E00;&#x4E2A;<strong>&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#xFF08;Cross Validation&#xFF09;</strong>&#x96C6;&#xFF0C;&#x5176;&#x8BA1;&#x7B97;&#x7684;&#x7ED3;&#x679C;&#x8BB0;&#x4E3A;<script type="math/tex">J_{cv}(\Theta)</script>&#x3002;&#x5728;&#x6700;&#x540E;&#x9009;&#x62E9;&#x6700;&#x4F18;&#x7684;&#x6A21;&#x578B;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x96C6;&#x6765;&#x4F5C;&#x4E3A;&#x9009;&#x62E9;&#x6807;&#x6CE8;&#xFF0C;&#x9009;&#x62E9;<script type="math/tex">J_{cv}(\Theta)</script>&#x6700;&#x5C0F;&#x7684;&#x6A21;&#x578B;&#x3002;</p>
<p><br></p>
<h2 id="&#x5206;&#x6790;&#x5E76;&#x89E3;&#x51B3;&#x51FA;&#x73B0;&#x7684;&#x95EE;&#x9898;"><a href="#&#x5206;&#x6790;&#x5E76;&#x89E3;&#x51B3;&#x51FA;&#x73B0;&#x7684;&#x95EE;&#x9898;" class="headerlink" title="&#x5206;&#x6790;&#x5E76;&#x89E3;&#x51B3;&#x51FA;&#x73B0;&#x7684;&#x95EE;&#x9898;"></a>&#x5206;&#x6790;&#x5E76;&#x89E3;&#x51B3;&#x51FA;&#x73B0;&#x7684;&#x95EE;&#x9898;</h2><p>&#x5F53;&#x5BF9;&#x7B97;&#x6CD5;&#x7684;&#x6D4B;&#x8BD5;&#x7ED3;&#x679C;&#x8FBE;&#x4E0D;&#x5230;&#x9884;&#x671F;&#x65F6;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x5206;&#x6790;&#x5BFC;&#x81F4;&#x9519;&#x8BEF;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x627E;&#x5230;&#x51FA;&#x73B0;&#x8F83;&#x5927;&#x8BEF;&#x5DEE;&#x7684;&#x539F;&#x56E0;&#x3002;</p>
<h3 id="&#x9AD8;&#x504F;&#x5DEE;&#x4E0E;&#x9AD8;&#x65B9;&#x5DEE;"><a href="#&#x9AD8;&#x504F;&#x5DEE;&#x4E0E;&#x9AD8;&#x65B9;&#x5DEE;" class="headerlink" title="&#x9AD8;&#x504F;&#x5DEE;&#x4E0E;&#x9AD8;&#x65B9;&#x5DEE;"></a>&#x9AD8;&#x504F;&#x5DEE;&#x4E0E;&#x9AD8;&#x65B9;&#x5DEE;</h3><p>&#x603B;&#x4F53;&#x4E0A;&#xFF0C;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x7684;&#x60C5;&#x51B5;&#x5171;&#x6709;&#x4E24;&#x79CD;&#xFF1A;&#x9AD8;<strong>&#x504F;&#x5DEE;&#xFF08;Bias&#xFF09;</strong>&#x548C;&#x9AD8;<strong>&#x65B9;&#x5DEE;&#xFF08;Variance&#xFF09;</strong>&#xFF0C;&#x5206;&#x522B;&#x5BF9;&#x5E94;&#x7740;&#x6B20;&#x62DF;&#x5408;&#x548C;&#x8FC7;&#x62DF;&#x5408;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x524D;&#x8005;&#x5C31;&#x5982;&#x540C;&#x8003;&#x8BD5;&#x524D;&#x8FDE;&#x591C;&#x590D;&#x4E60;&#x4F46;&#x662F;&#x5565;&#x4E5F;&#x6CA1;&#x8BB0;&#x4F4F;&#xFF0C;&#x800C;&#x540E;&#x8005;&#x5219;&#x662F;&#x7C7B;&#x4F3C;&#x8FDE;&#x591C;&#x590D;&#x4E60;&#x82F1;&#x8BED;&#x4F46;&#x662F;&#x7B2C;&#x4E8C;&#x5929;&#x8003;&#x7684;&#x662F;&#x6570;&#x5B66;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x81F3;&#x4E8E;&#x5BB9;&#x6613;&#x9020;&#x6210;&#x9AD8;&#x504F;&#x5DEE;&#x4E0E;&#x9AD8;&#x65B9;&#x5DEE;&#x7684;&#x56E0;&#x7D20;&#xFF0C;&#x53EF;&#x4EE5;&#x4ECE;&#x591A;&#x9879;&#x5F0F;&#x7684;&#x7CFB;&#x6570;&#x548C;&#x6B63;&#x5219;&#x9879;&#x7CFB;&#x6570;&#x4E24;&#x65B9;&#x9762;&#x8003;&#x8651;&#x3002;</p>
<h4 id="&#x591A;&#x9879;&#x5F0F;&#x7684;&#x9879;&#x6570;"><a href="#&#x591A;&#x9879;&#x5F0F;&#x7684;&#x9879;&#x6570;" class="headerlink" title="&#x591A;&#x9879;&#x5F0F;&#x7684;&#x9879;&#x6570;"></a>&#x591A;&#x9879;&#x5F0F;&#x7684;&#x9879;&#x6570;</h4><p>&#x901A;&#x5E38;&#x6765;&#x8BF4;&#xFF0C;&#x591A;&#x9879;&#x5F0F;&#x7684;&#x9879;&#x6570;&#x8D8A;&#x591A;&#xFF0C;&#x5BF9;&#x8BAD;&#x7EC3;&#x96C6;&#x62DF;&#x5408;&#x7684;&#x5C31;&#x4F1A;&#x8D8A;&#x597D;&#xFF0C;&#x800C;&#x8FC7;&#x62DF;&#x5408;&#x7684;&#x6982;&#x7387;&#x4E5F;&#x5C31;&#x8D8A;&#x9AD8;&#x3002;</p>
<p>&#x603B;&#x4F53;&#x4E0A;&#xFF0C;&#x591A;&#x9879;&#x5F0F;&#x7684;&#x9879;&#x6570;&#x4E0E;&#x8BAD;&#x7EC3;&#x96C6;&#x3001;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x96C6;&#x7684;&#x8BEF;&#x5DEE;&#x7684;&#x5173;&#x7CFB;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<img src="/articles/3/pic1.jpg" alt="&#x591A;&#x9879;&#x5F0F;&#x9879;&#x6570;&#x4E0E;&#x6D4B;&#x8BD5;&#x96C6;&#x3001;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x96C6;&#x7684;&#x5173;&#x7CFB;" title="&#x591A;&#x9879;&#x5F0F;&#x9879;&#x6570;&#x4E0E;&#x6D4B;&#x8BD5;&#x96C6;&#x3001;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x96C6;&#x7684;&#x5173;&#x7CFB;">
<p>&#x4E00;&#x5F00;&#x59CB;&#xFF0C;&#x591A;&#x9879;&#x5F0F;&#x7684;&#x9879;&#x6570;&#x8FC7;&#x5C11;&#xFF0C;&#x4E0D;&#x80FD;&#x5F88;&#x597D;&#x5730;&#x62DF;&#x5408;&#x6570;&#x636E;&#xFF0C;&#x5BFC;&#x81F4;&#x9AD8;&#x504F;&#x5DEE;&#x7684;&#x95EE;&#x9898;&#xFF1B;&#x800C;&#x968F;&#x7740;&#x9879;&#x6570;&#x7684;&#x589E;&#x591A;&#xFF0C;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x8BEF;&#x5DEE;&#x8D8A;&#x6765;&#x8D8A;&#x5C0F;&#xFF0C;&#x4F46;&#x5F00;&#x59CB;&#x51FA;&#x73B0;&#x4E86;&#x8FC7;&#x62DF;&#x5408;&#xFF0C;&#x5BFC;&#x81F4;&#x9AD8;&#x65B9;&#x5DEE;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<h4 id="&#x6B63;&#x5219;&#x9879;&#x7CFB;&#x6570;"><a href="#&#x6B63;&#x5219;&#x9879;&#x7CFB;&#x6570;" class="headerlink" title="&#x6B63;&#x5219;&#x9879;&#x7CFB;&#x6570;"></a>&#x6B63;&#x5219;&#x9879;&#x7CFB;&#x6570;</h4><p>&#x5F53;&#x6B63;&#x5219;&#x9879;&#x7CFB;&#x6570;&#x504F;&#x5C0F;&#x65F6;&#xFF0C;&#x5BF9;&#x4E8E;&#x591A;&#x9879;&#x5F0F;&#x591A;&#x4F59;&#x7684;&#x9879;&#x7684;&#x201C;&#x4FEE;&#x6B63;&#x201D;&#x4E0D;&#x8DB3;&#xFF0C;&#x4F1A;&#x5BFC;&#x81F4;&#x8FC7;&#x62DF;&#x5408;&#xFF0C;&#x51FA;&#x73B0;&#x9AD8;&#x65B9;&#x5DEE;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x6B64;&#x65F6;&#x901A;&#x8FC7;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x96C6;&#x6D4B;&#x8BD5;&#x7684;&#x8BEF;&#x5DEE;&#x4F1A;&#x7531;&#x4E8E;&#x9AD8;&#x65B9;&#x5DEE;&#x800C;&#x5BFC;&#x81F4;&#x8BEF;&#x5DEE;&#x8F83;&#x9AD8;&#xFF1B;&#x800C;&#x5F53;&#x6B63;&#x5219;&#x9879;&#x7CFB;&#x6570;&#x504F;&#x5927;&#x65F6;&#xFF0C;&#x5BF9;&#x4E8E;&#x591A;&#x9879;&#x5F0F;&#x5404;&#x9879;&#x7684;&#x201C;&#x4FEE;&#x6B63;&#x201D;&#x8FC7;&#x4E86;&#x5934;&#xFF0C;&#x4F1A;&#x5BFC;&#x81F4;&#x6B20;&#x62DF;&#x5408;&#xFF0C;&#x51FA;&#x73B0;&#x9AD8;&#x504F;&#x5DEE;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<img src="/articles/3/pic2.jpg" alt="&#x6B63;&#x5219;&#x9879;&#x7CFB;&#x6570;&#x4E0E;&#x6D4B;&#x8BD5;&#x96C6;&#x3001;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x96C6;&#x7684;&#x5173;&#x7CFB;" title="&#x6B63;&#x5219;&#x9879;&#x7CFB;&#x6570;&#x4E0E;&#x6D4B;&#x8BD5;&#x96C6;&#x3001;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x96C6;&#x7684;&#x5173;&#x7CFB;">
<h3 id="&#x5B66;&#x4E60;&#x66F2;&#x7EBF;"><a href="#&#x5B66;&#x4E60;&#x66F2;&#x7EBF;" class="headerlink" title="&#x5B66;&#x4E60;&#x66F2;&#x7EBF;"></a>&#x5B66;&#x4E60;&#x66F2;&#x7EBF;</h3><p>&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;&#xFF08;Learning Curves&#xFF09;&#x6765;&#x5206;&#x6790;&#x7B97;&#x6CD5;&#x5728;&#x4E0D;&#x540C;&#x89C4;&#x6A21;&#x7684;&#x6570;&#x636E;&#x4E0B;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x8FDB;&#x800C;&#x5206;&#x6790;&#x51FA;&#x7B97;&#x6CD5;&#x7684;&#x95EE;&#x9898;&#x6240;&#x5728;&#x3002;</p>
<h4 id="&#x603B;&#x4F53;&#x8D8B;&#x52BF;"><a href="#&#x603B;&#x4F53;&#x8D8B;&#x52BF;" class="headerlink" title="&#x603B;&#x4F53;&#x8D8B;&#x52BF;"></a>&#x603B;&#x4F53;&#x8D8B;&#x52BF;</h4><p>&#x4F9D;&#x65E7;&#x4EE5;&#x8BAD;&#x7EC3;&#x96C6;&#x548C;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x96C6;&#x7684;&#x6570;&#x636E;&#x4E3A;&#x51C6;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x5206;&#x6790;&#x4E0D;&#x540C;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;/&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x96C6;&#x5927;&#x5C0F;&#x4E0B;&#x7684;&#x8BEF;&#x5DEE;&#x3002;</p>
<p>&#x5F53;&#x8BAD;&#x7EC3;&#x96C6;&#x6570;&#x91CF;&#x6781;&#x5C11;&#x65F6;&#xFF0C;&#x9A8C;&#x8BC1;&#x96C6;&#x7684;&#x8BEF;&#x5DEE;&#x53EF;&#x4EE5;&#x5F88;&#x5C0F;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;<script type="math/tex">m_{train} = 1, 2, 3</script>&#x65F6;&#xFF0C;&#x4E8C;&#x6B21;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#x5B8C;&#x5168;&#x6CA1;&#x6709;&#x8BEF;&#x5DEE;&#x3002;&#x4F46;&#x968F;&#x7740;<script type="math/tex">m_{train}</script>&#x7684;&#x589E;&#x5927;&#xFF0C;&#x4E8C;&#x6B21;&#x51FD;&#x6570;&#x5C06;&#x9010;&#x6E10;&#x4E0D;&#x80FD;&#x5B8C;&#x5168;&#x62DF;&#x5408;&#x6570;&#x636E;&#xFF0C;&#x8BEF;&#x5DEE;&#x4F1A;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x5927;&#xFF0C;&#x5982;&#x679C;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x627E;&#x5F97;&#x4E0D;&#x591F;&#x597D;&#xFF0C;&#x5C31;&#x6709;&#x53EF;&#x80FD;&#x9020;&#x6210;&#x9AD8;&#x504F;&#x5DEE;&#x3002;&#x800C;&#x5BF9;&#x4E8E;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x96C6;&#xFF0C;&#x5F53;<script type="math/tex">m_{train}</script>&#x5F88;&#x5C0F;&#x65F6;&#xFF0C;&#x867D;&#x7136;&#x8BAD;&#x7EC3;&#x96C6;&#x6570;&#x636E;&#x80FD;&#x591F;&#x5B8C;&#x7F8E;&#x62DF;&#x5408;&#xFF0C;&#x7136;&#x800C;&#x5BF9;&#x4E8E;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x96C6;&#x6765;&#x8BF4;&#xFF0C;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x8BAD;&#x7EC3;&#x7ED3;&#x679C;&#x51E0;&#x4E4E;&#x5B8C;&#x5168;&#x4E0D;&#x80FD;&#x6CDB;&#x5316;&#x5230;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x96C6;&#x4E0A;&#xFF0C;&#x4F1A;&#x9020;&#x6210;&#x9AD8;&#x65B9;&#x5DEE;&#xFF0C;&#x800C;&#x5F53;<script type="math/tex">m_{train}</script>&#x8D8A;&#x6765;&#x8D8A;&#x5927;&#x65F6;&#xFF0C;&#x6570;&#x636E;&#x8D8A;&#x6765;&#x8D8A;&#x80FD;&#x591F;&#x5305;&#x542B;&#x6240;&#x6709;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x800C;&#x8BAD;&#x7EC3;&#x7ED3;&#x679C;&#x4E5F;&#x8D8A;&#x6765;&#x8D8A;&#x80FD;&#x591F;&#x6CDB;&#x5316;&#x5230;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0A;&#xFF0C;&#x8BEF;&#x5DEE;&#x4F1A;&#x9010;&#x6E10;&#x51CF;&#x5C0F;&#x3002;</p>
<img src="/articles/3/pic3.jpg" alt="&#x5B66;&#x4E60;&#x66F2;&#x7EBF;&#x7684;&#x603B;&#x4F53;&#x8D8B;&#x52BF;" title="&#x5B66;&#x4E60;&#x66F2;&#x7EBF;&#x7684;&#x603B;&#x4F53;&#x8D8B;&#x52BF;">
<h4 id="&#x9AD8;&#x504F;&#x5DEE;&#x4E0B;&#x7684;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;"><a href="#&#x9AD8;&#x504F;&#x5DEE;&#x4E0B;&#x7684;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;" class="headerlink" title="&#x9AD8;&#x504F;&#x5DEE;&#x4E0B;&#x7684;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;"></a>&#x9AD8;&#x504F;&#x5DEE;&#x4E0B;&#x7684;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;</h4><p>&#x5728;&#x9AD8;&#x504F;&#x5DEE;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5F53;&#x8BAD;&#x7EC3;&#x96C6;&#x8D8A;&#x6765;&#x8D8A;&#x5927;&#x65F6;&#xFF0C;&#x8BAD;&#x7EC3;&#x96C6;&#x5408;&#x5DF2;&#x7ECF;&#x5F88;&#x96BE;&#x62DF;&#x5408;&#x6570;&#x636E;&#x4E86;&#xFF0C;&#x8BAD;&#x7EC3;&#x96C6;&#x5C06;&#x51FA;&#x73B0;&#x5F88;&#x5927;&#x7684;&#x8BEF;&#x5DEE;&#x3002;&#x800C;&#x5BF9;&#x4E8E;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x96C6;&#x6765;&#x8BF4;&#xFF0C;&#x968F;&#x7740;&#x8BAD;&#x7EC3;&#x96C6;&#x5408;&#x7684;&#x589E;&#x5927;&#xFF0C;&#x8BAD;&#x7EC3;&#x96C6;&#x4E5F;&#x5C06;&#x8D8A;&#x6765;&#x8D8A;&#x4E00;&#x822C;&#x5316;&#xFF0C;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x96C6;&#x7684;&#x8BEF;&#x5DEE;&#x5C06;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x63A5;&#x8FD1;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x8BEF;&#x5DEE;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x7531;&#x4E8E;&#x9AD8;&#x504F;&#x5DEE;&#xFF0C;&#x4E24;&#x8005;&#x7684;&#x8BEF;&#x5DEE;&#x5C06;&#x4F1A;&#x9010;&#x6E10;&#x7A33;&#x5B9A;&#x5728;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x5927;&#x7684;&#x503C;&#xFF0C;&#x800C;&#x4E14;&#x975E;&#x5E38;&#x63A5;&#x8FD1;&#x3002;</p>
<img src="/articles/3/pic4.jpg" alt="&#x9AD8;&#x504F;&#x5DEE;&#x4E0B;&#x7684;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;" title="&#x9AD8;&#x504F;&#x5DEE;&#x4E0B;&#x7684;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;">
<p>&#x7531;&#x4E0A;&#x56FE;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#xFF0C;&#x589E;&#x5927;&#x8BAD;&#x7EC3;&#x96C6;&#x5E76;&#x4E0D;&#x592A;&#x80FD;&#x591F;&#x89E3;&#x51B3;&#x9AD8;&#x504F;&#x5DEE;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<h4 id="&#x9AD8;&#x65B9;&#x5DEE;&#x4E0B;&#x7684;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;"><a href="#&#x9AD8;&#x65B9;&#x5DEE;&#x4E0B;&#x7684;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;" class="headerlink" title="&#x9AD8;&#x65B9;&#x5DEE;&#x4E0B;&#x7684;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;"></a>&#x9AD8;&#x65B9;&#x5DEE;&#x4E0B;&#x7684;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;</h4><p>&#x5728;&#x9AD8;&#x65B9;&#x5DEE;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0D;&#x662F;&#x5F88;&#x5927;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7531;&#x4E8E;&#x8BAD;&#x7EC3;&#x96C6;&#x62DF;&#x5408;&#x5F97;&#x5F88;&#x597D;&#xFF0C;&#x56E0;&#x6B64;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x8BEF;&#x5DEE;&#x4E0D;&#x4F1A;&#x5F88;&#x5927;&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x5F88;&#x96BE;&#x6CDB;&#x5316;&#x5230;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x96C6;&#x4E0A;&#xFF0C;&#x56E0;&#x6B64;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x96C6;&#x7684;&#x8BEF;&#x5DEE;&#x4F1A;&#x5F88;&#x5927;&#x3002;&#x4F46;&#x968F;&#x7740;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x589E;&#x5927;&#xFF0C;&#x8BAD;&#x7EC3;&#x96C6;&#x672C;&#x8EAB;&#x4E5F;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x4E00;&#x822C;&#x5316;&#xFF0C;&#x56E0;&#x6B64;&#x8BAD;&#x7EC3;&#x7ED3;&#x679C;&#x4E5F;&#x8D8A;&#x6765;&#x8D8A;&#x80FD;&#x591F;&#x6CDB;&#x5316;&#x5230;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD9;&#x65F6;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x96C6;&#x7684;&#x8BEF;&#x5DEE;&#x4E5F;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x5C0F;&#x3002;</p>
<img src="/articles/3/pic5.jpg" alt="&#x9AD8;&#x65B9;&#x5DEE;&#x4E0B;&#x7684;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;" title="&#x9AD8;&#x65B9;&#x5DEE;&#x4E0B;&#x7684;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;">
<p>&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#xFF0C;&#x968F;&#x7740;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x589E;&#x5927;&#xFF0C;&#x9AD8;&#x65B9;&#x5DEE;&#x7684;&#x95EE;&#x9898;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x7684;&#x4FEE;&#x6B63;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x8FD8;&#x6CA1;&#x90A3;&#x4E48;&#x5927;&#x65F6;&#xFF0C;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x96C6;&#x7684;&#x8BEF;&#x5DEE;&#x4F1A;&#x8FDC;&#x5927;&#x4E8E;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x8BEF;&#x5DEE;&#x3002;</p>
<h3 id="&#x89E3;&#x51B3;&#x51FA;&#x73B0;&#x7684;&#x95EE;&#x9898;"><a href="#&#x89E3;&#x51B3;&#x51FA;&#x73B0;&#x7684;&#x95EE;&#x9898;" class="headerlink" title="&#x89E3;&#x51B3;&#x51FA;&#x73B0;&#x7684;&#x95EE;&#x9898;"></a>&#x89E3;&#x51B3;&#x51FA;&#x73B0;&#x7684;&#x95EE;&#x9898;</h3><p>&#x901A;&#x8FC7;&#x4E0A;&#x9762;&#x7684;&#x5206;&#x6790;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5B9A;&#x4F4D;&#x6211;&#x4EEC;&#x7684;&#x7B97;&#x6CD5;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x7684;&#x95EE;&#x9898;&#xFF1A;&#x9AD8;&#x504F;&#x5DEE;&#x4E0E;&#x9AD8;&#x65B9;&#x5DEE;&#x4EE5;&#x53CA;&#x9020;&#x6210;&#x4E24;&#x7C7B;&#x95EE;&#x9898;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x800C;&#x9488;&#x5BF9;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x4E0E;&#x539F;&#x56E0;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x7531;&#x5982;&#x4E0B;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x901A;&#x8FC7;&#x8FD9;&#x4E9B;&#x65B9;&#x6848;&#x5C1D;&#x8BD5;&#x4FEE;&#x6B63;&#x8BEF;&#x5DEE;&#x3002;</p>
<h4 id="&#x589E;&#x52A0;&#x8BAD;&#x7EC3;&#x6837;&#x4F8B;-&#x2014;&#x2014;-&#x4FEE;&#x6B63;&#x9AD8;&#x65B9;&#x5DEE;"><a href="#&#x589E;&#x52A0;&#x8BAD;&#x7EC3;&#x6837;&#x4F8B;-&#x2014;&#x2014;-&#x4FEE;&#x6B63;&#x9AD8;&#x65B9;&#x5DEE;" class="headerlink" title="&#x589E;&#x52A0;&#x8BAD;&#x7EC3;&#x6837;&#x4F8B; &#x2014;&#x2014; &#x4FEE;&#x6B63;&#x9AD8;&#x65B9;&#x5DEE;"></a>&#x589E;&#x52A0;&#x8BAD;&#x7EC3;&#x6837;&#x4F8B; &#x2014;&#x2014; &#x4FEE;&#x6B63;&#x9AD8;&#x65B9;&#x5DEE;</h4><p>&#x7531;&#x9AD8;&#x65B9;&#x5DEE;&#x4E0B;&#x7684;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#xFF0C;&#x589E;&#x52A0;&#x8BAD;&#x7EC3;&#x6837;&#x4F8B;&#x80FD;&#x591F;&#x51CF;&#x5C0F;&#x9AD8;&#x65B9;&#x5DEE;&#x9020;&#x6210;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;&#x5F53;&#x8BAD;&#x7EC3;&#x96C6;&#x589E;&#x5927;&#x65F6;&#xFF0C;&#x8BAD;&#x7EC3;&#x96C6;&#x672C;&#x8EAB;&#x4E5F;&#x66F4;&#x52A0;&#x63A5;&#x8FD1;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x524D;&#x63D0;&#x6761;&#x4EF6;&#x662F;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0D;&#x662F;&#x4EBA;&#x4E3A;&#x7B5B;&#x9009;&#x8FC7;&#x7684;&#x3002;</p>
<p>&#x589E;&#x52A0;&#x8BAD;&#x7EC3;&#x6837;&#x4F8B;&#x51CF;&#x5C0F;&#x65B9;&#x5DEE;&#x662F;&#x76F8;&#x5F53;&#x7B80;&#x5355;&#x7C97;&#x66B4;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x4E3A;&#x5565;&#x6211;&#x4EEC;&#x8981;&#x8FDB;&#x5165;&#x5927;&#x6570;&#x636E;&#x65F6;&#x4EE3;&#x7684;&#x4E00;&#x4E2A;&#x539F;&#x56E0;&#x5427;&#x2014;&#x2014;&#x901A;&#x8FC7;&#x5BF9;&#x6D77;&#x91CF;&#x6570;&#x636E;&#x7684;&#x5206;&#x6790;&#x4E0E;&#x5B66;&#x4E60;&#xFF0C;&#x7CFB;&#x7EDF;&#x624D;&#x80FD;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x806A;&#x660E;&#x3002;</p>
<h4 id="&#x5220;&#x51CF;&#x65E0;&#x7528;&#x7279;&#x5F81;-&#x2014;&#x2014;-&#x4FEE;&#x6B63;&#x9AD8;&#x65B9;&#x5DEE;"><a href="#&#x5220;&#x51CF;&#x65E0;&#x7528;&#x7279;&#x5F81;-&#x2014;&#x2014;-&#x4FEE;&#x6B63;&#x9AD8;&#x65B9;&#x5DEE;" class="headerlink" title="&#x5220;&#x51CF;&#x65E0;&#x7528;&#x7279;&#x5F81; &#x2014;&#x2014; &#x4FEE;&#x6B63;&#x9AD8;&#x65B9;&#x5DEE;"></a>&#x5220;&#x51CF;&#x65E0;&#x7528;&#x7279;&#x5F81; &#x2014;&#x2014; &#x4FEE;&#x6B63;&#x9AD8;&#x65B9;&#x5DEE;</h4><p>&#x6709;&#x4E9B;&#x65F6;&#x5019;&#xFF0C;&#x6709;&#x4E9B;&#x7279;&#x5F81;&#x53EF;&#x80FD;&#x5E76;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x91CD;&#x8981;&#x3002;&#x4F8B;&#x5982;&#x6211;&#x7684;&#x6570;&#x5B66;&#x6210;&#x7EE9;&#x53EF;&#x80FD;&#x548C;&#x6211;&#x7684;&#x4F53;&#x80B2;&#x8001;&#x5E08;&#x6CA1;&#x6709;&#x592A;&#x5927;&#x5173;&#x7CFB;&#xFF08;&#x9664;&#x975E;&#x6211;&#x7684;&#x6570;&#x5B66;&#x662F;&#x4F53;&#x80B2;&#x8001;&#x5E08;&#x6559;&#x7684;&#xFF09;&#x3002;&#x7136;&#x800C;&#x8FD9;&#x5374;&#x5F88;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x8BA1;&#x7B97;&#x673A;&#x201C;&#x94BB;&#x725B;&#x89D2;&#x5C16;&#x201D;&#xFF0C;&#x56E0;&#x4E3A;&#x8BA1;&#x7B97;&#x673A;&#x201C;&#x611F;&#x89C9;&#x201D;&#x4E0D;&#x51FA;&#x6765;&#x5230;&#x5E95;&#x8C01;&#x91CD;&#x8981;&#x8C01;&#x4E0D;&#x91CD;&#x8981;&#x2014;&#x2014;&#x6240;&#x6709;&#x7684;&#x7279;&#x5F81;&#x90FD;&#x53EA;&#x4E0D;&#x8FC7;&#x662F;&#x6570;&#x5B57;&#x548C;&#x7B26;&#x53F7;&#x800C;&#x5DF2;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x53BB;&#x6389;&#x4E00;&#x4E9B;&#x5E76;&#x4E0D;&#x91CD;&#x8981;&#x7684;&#x7279;&#x5F81;&#x53EF;&#x4EE5;&#x4FEE;&#x6B63;&#x9AD8;&#x65B9;&#x5DEE;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<h4 id="&#x589E;&#x52A0;&#x6F5C;&#x5728;&#x7279;&#x5F81;-&#x2014;&#x2014;-&#x4FEE;&#x6B63;&#x9AD8;&#x504F;&#x5DEE;"><a href="#&#x589E;&#x52A0;&#x6F5C;&#x5728;&#x7279;&#x5F81;-&#x2014;&#x2014;-&#x4FEE;&#x6B63;&#x9AD8;&#x504F;&#x5DEE;" class="headerlink" title="&#x589E;&#x52A0;&#x6F5C;&#x5728;&#x7279;&#x5F81; &#x2014;&#x2014; &#x4FEE;&#x6B63;&#x9AD8;&#x504F;&#x5DEE;"></a>&#x589E;&#x52A0;&#x6F5C;&#x5728;&#x7279;&#x5F81; &#x2014;&#x2014; &#x4FEE;&#x6B63;&#x9AD8;&#x504F;&#x5DEE;</h4><p>&#x4E0E;&#x5220;&#x51CF;&#x65E0;&#x7528;&#x7279;&#x5F81;&#x4FEE;&#x6B63;&#x9AD8;&#x504F;&#x5DEE;&#x95EE;&#x9898;&#x76F8;&#x53CD;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x4F1A;&#x5FFD;&#x7565;&#x4E00;&#x4E9B;&#x6F5C;&#x5728;&#x7279;&#x5F81;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x524D;&#x9762;&#x6211;&#x4EEC;&#x4EC5;&#x901A;&#x8FC7;&#x9762;&#x79EF;&#x9884;&#x6D4B;&#x623F;&#x4EF7;&#xFF0C;&#x7136;&#x800C;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x623F;&#x4EF7;&#x4E0D;&#x4EC5;&#x4E0E;&#x9762;&#x79EF;&#xFF0C;&#x4E5F;&#x4E0E;&#x6240;&#x5728;&#x5730;&#x3001;&#x73AF;&#x5883;&#x7B49;&#x5404;&#x79CD;&#x56E0;&#x7D20;&#x90FD;&#x6709;&#x5173;&#xFF0C;&#x4EC5;&#x901A;&#x8FC7;&#x9762;&#x79EF;&#x9884;&#x6D4B;&#x623F;&#x4EF7;&#x663E;&#x7136;&#x4F1A;&#x5BFC;&#x81F4;&#x76F8;&#x5F53;&#x9AD8;&#x7684;&#x504F;&#x5DEE;&#x3002;</p>
<h4 id="&#x589E;&#x52A0;&#x591A;&#x9879;&#x5F0F;&#x9879;-&#x2014;&#x2014;-&#x4FEE;&#x6B63;&#x9AD8;&#x504F;&#x5DEE;"><a href="#&#x589E;&#x52A0;&#x591A;&#x9879;&#x5F0F;&#x9879;-&#x2014;&#x2014;-&#x4FEE;&#x6B63;&#x9AD8;&#x504F;&#x5DEE;" class="headerlink" title="&#x589E;&#x52A0;&#x591A;&#x9879;&#x5F0F;&#x9879; &#x2014;&#x2014; &#x4FEE;&#x6B63;&#x9AD8;&#x504F;&#x5DEE;"></a>&#x589E;&#x52A0;&#x591A;&#x9879;&#x5F0F;&#x9879; &#x2014;&#x2014; &#x4FEE;&#x6B63;&#x9AD8;&#x504F;&#x5DEE;</h4><p>&#x7528;&#x4E8E;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x548C;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x3002;&#x548C;&#x589E;&#x52A0;&#x6F5C;&#x5728;&#x7279;&#x5F81;&#x7C7B;&#x4F3C;&#xFF0C;&#x4E0D;&#x8FC7;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x662F;&#x589E;&#x52A0;&#x591A;&#x9879;&#x5F0F;&#x7684;&#x6B21;&#x6570;&#xFF0C;&#x6B21;&#x6570;&#x8D8A;&#x9AD8;&#xFF0C;&#x591A;&#x9879;&#x5F0F;&#x7684;&#x201C;&#x7075;&#x6D3B;&#x6027;&#x201D;&#x4E5F;&#x5C31;&#x8D8A;&#x597D;&#xFF0C;&#x4E5F;&#x5C31;&#x66F4;&#x80FD;&#x62DF;&#x5408;&#x6570;&#x636E;&#x3002;</p>
<h4 id="&#x51CF;&#x5C0F;&#x6B63;&#x5219;&#x9879;&#x7CFB;&#x6570;-&#x2014;&#x2014;-&#x4FEE;&#x6B63;&#x9AD8;&#x504F;&#x5DEE;"><a href="#&#x51CF;&#x5C0F;&#x6B63;&#x5219;&#x9879;&#x7CFB;&#x6570;-&#x2014;&#x2014;-&#x4FEE;&#x6B63;&#x9AD8;&#x504F;&#x5DEE;" class="headerlink" title="&#x51CF;&#x5C0F;&#x6B63;&#x5219;&#x9879;&#x7CFB;&#x6570; &#x2014;&#x2014; &#x4FEE;&#x6B63;&#x9AD8;&#x504F;&#x5DEE;"></a>&#x51CF;&#x5C0F;&#x6B63;&#x5219;&#x9879;&#x7CFB;&#x6570; &#x2014;&#x2014; &#x4FEE;&#x6B63;&#x9AD8;&#x504F;&#x5DEE;</h4><p>&#x8FC7;&#x5927;&#x7684;&#x6B63;&#x5219;&#x9879;&#x7CFB;&#x6570;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x8BAD;&#x7EC3;&#x65F6;&#x6BCF;&#x6B21;&#x7684;&#x201C;&#x4FEE;&#x6B63;&#x201D;&#x8FC7;&#x4E86;&#x5934;&#xFF0C;&#x76F4;&#x89C2;&#x4E0A;&#x5C31;&#x662F;&#x628A;&#x672C;&#x6765;&#x7684;&#x66F2;&#x7EBF;&#x201C;&#x63B0;&#x201D;&#x5F97;&#x8FC7;&#x76F4;&#x4E86;&#xFF0C;&#x81EA;&#x7136;&#x5C31;&#x4F1A;&#x51FA;&#x73B0;&#x9AD8;&#x504F;&#x5DEE;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<h4 id="&#x589E;&#x5927;&#x6B63;&#x5219;&#x9879;&#x7CFB;&#x6570;-&#x2014;&#x2014;-&#x4FEE;&#x6B63;&#x9AD8;&#x65B9;&#x5DEE;"><a href="#&#x589E;&#x5927;&#x6B63;&#x5219;&#x9879;&#x7CFB;&#x6570;-&#x2014;&#x2014;-&#x4FEE;&#x6B63;&#x9AD8;&#x65B9;&#x5DEE;" class="headerlink" title="&#x589E;&#x5927;&#x6B63;&#x5219;&#x9879;&#x7CFB;&#x6570; &#x2014;&#x2014; &#x4FEE;&#x6B63;&#x9AD8;&#x65B9;&#x5DEE;"></a>&#x589E;&#x5927;&#x6B63;&#x5219;&#x9879;&#x7CFB;&#x6570; &#x2014;&#x2014; &#x4FEE;&#x6B63;&#x9AD8;&#x65B9;&#x5DEE;</h4><p>&#x8FC7;&#x5C0F;&#x7684;&#x6B63;&#x5219;&#x9879;&#x7CFB;&#x6570;&#x6B63;&#x597D;&#x76F8;&#x53CD;&#xFF0C;&#x662F;&#x5F2F;&#x8FC7;&#x4E86;&#x66F2;&#x7EBF;&#x5F80;&#x56DE;&#x201C;&#x63B0;&#x201D;&#x5F97;&#x4E0D;&#x591F;&#xFF0C;&#x6240;&#x4EE5;&#x51FA;&#x73B0;&#x4E86;&#x9AD8;&#x65B9;&#x5DEE;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p><br></p>
<h2 id="&#x5904;&#x7406;&#x504F;&#x659C;&#x6570;&#x636E;"><a href="#&#x5904;&#x7406;&#x504F;&#x659C;&#x6570;&#x636E;" class="headerlink" title="&#x5904;&#x7406;&#x504F;&#x659C;&#x6570;&#x636E;"></a>&#x5904;&#x7406;&#x504F;&#x659C;&#x6570;&#x636E;</h2><p>&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x8981;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x5224;&#x65AD;&#x75C5;&#x4EBA;&#x662F;&#x5426;&#x5F97;&#x4E86;&#x764C;&#x75C7;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7A0B;&#x5E8F;&#x3002;&#x6839;&#x636E;&#x4E34;&#x5E8A;&#x8C03;&#x67E5;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x5206;&#x6790;&#x7684;&#x76EE;&#x6807;&#x4EBA;&#x7FA4;&#x5F53;&#x4E2D;&#xFF0C;&#x5F97;&#x764C;&#x75C7;&#x7684;&#x4EBA;&#x6709;0.1%&#x3002;&#x6211;&#x4EEC;&#x5F97;&#x5230;&#x4E86;&#x4E00;&#x4EFD;&#x6D77;&#x91CF;&#x7684;&#x76EE;&#x6807;&#x4EBA;&#x7FA4;&#x4EE5;&#x53CA;&#x662F;&#x5426;&#x60A3;&#x764C;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5E76;&#x7F16;&#x5199;&#x4E86;&#x7A0B;&#x5E8F;&#x5B66;&#x4E60;&#x4E86;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x8BC4;&#x4F30;&#x4E00;&#x4E0B;&#x7A0B;&#x5E8F;&#x7684;&#x8868;&#x73B0;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x5206;&#x6790;&#x7A0B;&#x5E8F;&#x9884;&#x6D4B;&#x7684;&#x6B63;&#x786E;&#x7387;&#x6765;&#x8BC4;&#x4F30;&#x7A0B;&#x5E8F;&#xFF0C;&#x5373;&#x9884;&#x6D4B;&#x6B63;&#x786E;&#x7684;&#x6570;&#x91CF;&#x5360;&#x6D4B;&#x8BD5;&#x6570;&#x636E;&#x603B;&#x6570;&#x91CF;&#x7684;&#x767E;&#x5206;&#x6BD4;&#x3002;&#x7ECF;&#x8FC7;&#x6D4B;&#x8BD5;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x7A0B;&#x5E8F;&#x6B63;&#x786E;&#x7387;&#x9AD8;&#x8FBE;99%&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x5F88;6&#x662F;&#x4E0D;&#x662F;&#x3002;</p>
<p>&#x7136;&#x800C;&#x6709;&#x610F;&#x601D;&#x7684;&#x60C5;&#x51B5;&#x6765;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5199;&#x4E00;&#x4E2A;&#x56FA;&#x5B9A;&#x6B7B;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x65E0;&#x8BBA;&#x8F93;&#x5165;&#x7684;&#x6570;&#x636E;&#x600E;&#x4E48;&#x6837;&#xFF0C;&#x59CB;&#x7EC8;&#x7ED9;&#x51FA;&#x6CA1;&#x6709;&#x5F97;&#x764C;&#x75C7;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4E8C;&#x5206;&#x7C7B;&#x59CB;&#x7EC8;&#x5224;&#x65AD;&#x4E3A;&#x6CA1;&#x6709;&#x5F97;&#x764C;&#x75C7;&#x7684;&#x90A3;&#x4E00;&#x7C7B;&#x3002;&#x7ED3;&#x679C;&#x4E0D;&#x96BE;&#x53D1;&#x73B0;&#xFF0C;&#x8FD9;&#x6837;&#x505A;&#x7684;&#x51C6;&#x786E;&#x7387;&#x5C45;&#x7136;&#x9AD8;&#x8FBE;99.9%&#x3002;</p>
<p>&#x8FD9;&#x663E;&#x7136;&#x662F;&#x5F88;&#x8352;&#x5510;&#x548C;&#x4E0D;&#x80FD;&#x63A5;&#x53D7;&#x7684;&#xFF0C;&#x800C;&#x5BF9;&#x4E8E;&#x8FD9;&#x79CD;&#x6BD4;&#x4F8B;&#x672C;&#x6765;&#x5C31;&#x76F8;&#x5DEE;&#x975E;&#x5E38;&#x60AC;&#x6B8A;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x79F0;&#x4E4B;&#x4E3A;<strong>&#x504F;&#x659C;&#xFF08;Skewed&#xFF09;</strong>&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x8BF4;&#x660E;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x65B0;&#x7684;&#x7EDF;&#x8BA1;&#x65B9;&#x6CD5;&#x6765;&#x8BC4;&#x4F30;&#x7A0B;&#x5E8F;&#x3002;</p>
<h3 id="&#x67E5;&#x51C6;&#x7387;&#x4E0E;&#x53EC;&#x56DE;&#x7387;"><a href="#&#x67E5;&#x51C6;&#x7387;&#x4E0E;&#x53EC;&#x56DE;&#x7387;" class="headerlink" title="&#x67E5;&#x51C6;&#x7387;&#x4E0E;&#x53EC;&#x56DE;&#x7387;"></a>&#x67E5;&#x51C6;&#x7387;&#x4E0E;&#x53EC;&#x56DE;&#x7387;</h3><p>&#x5176;&#x4E2D;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x662F;&#x68C0;&#x67E5;<strong>&#x67E5;&#x51C6;&#x7387;&#xFF08;Precision&#xFF09;</strong>&#x548C;<strong>&#x53EC;&#x56DE;&#x7387;&#xFF08;Recall&#xFF09;</strong>&#x3002;</p>
<p>&#x7B80;&#x5355;&#x7684;&#x6765;&#x8BF4;&#xFF0C;&#x662F;&#x5C06;&#x9884;&#x6D4B;&#x6570;&#x636E;&#x4E0E;&#x5B9E;&#x9645;&#x6570;&#x636E;&#x6BD4;&#x5BF9;&#x4E4B;&#x540E;&#xFF0C;&#x7ED3;&#x679C;&#x5206;&#x4E3A;<strong>&#x771F;&#x9633;&#x6027;&#xFF08;True Positive&#xFF09;</strong>&#x3001;<strong>&#x771F;&#x9634;&#x6027;&#xFF08;True Negative&#xFF09;</strong>&#x3001;<strong>&#x5047;&#x9633;&#x6027;&#xFF08;False Positive&#xFF09;</strong>&#x3001;<strong>&#x5047;&#x9634;&#x6027;&#xFF08;False Negative&#xFF09;</strong>&#x56DB;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x5982;&#x4E0B;&#x8868;&#xFF1A;</p>
<div class="table-container">
<table>
<thead>
<tr>
<th></th>
<th>&#x5B9E;&#x9645;&#x4E3A;1</th>
<th>&#x5B9E;&#x9645;&#x4E3A;0</th>
</tr>
</thead>
<tbody>
<tr>
<td><strong>&#x9884;&#x6D4B;1</strong></td>
<td>&#x771F;&#x9633;&#x6027;</td>
<td>&#x5047;&#x9633;&#x6027;</td>
</tr>
<tr>
<td><strong>&#x9884;&#x6D4B;0</strong></td>
<td>&#x5047;&#x9634;&#x6027;</td>
<td>&#x771F;&#x9634;&#x6027;</td>
</tr>
</tbody>
</table>
</div>
<p>&#x67E5;&#x51C6;&#x7387;&#xFF0C;&#x662F;&#x6307;&#x6240;&#x6709;&#x9884;&#x6D4B;&#x4E3A;1&#x7684;&#x6570;&#x636E;&#x4E2D;&#xFF0C;&#x5B9E;&#x9645;&#x4E3A;1&#x7684;&#x6BD4;&#x7387;&#x3002;</p>
<p>&#x53EC;&#x56DE;&#x7387;&#xFF0C;&#x662F;&#x6307;&#x6240;&#x6709;&#x5B9E;&#x9645;&#x4E3A;1&#x7684;&#x6570;&#x636E;&#x4E2D;&#xFF0C;&#x9884;&#x6D4B;&#x4E3A;1&#x7684;&#x6BD4;&#x7387;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5BF9;&#x4E8E;&#x6211;&#x4EEC;&#x90A3;&#x4E2A;&#x4F5C;&#x5F0A;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x9A6C;&#x4E0A;&#x5C31;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#xFF0C;&#x5176;&#x53EC;&#x56DE;&#x7387;&#x7ADF;&#x7136;&#x662F;0&#xFF0C;&#x8BF4;&#x660E;&#x5B58;&#x5728;&#x95EE;&#x9898;&#x3002;</p>
<h3 id="&#x8C03;&#x6574;&#x9884;&#x6D4B;&#x7B56;&#x7565;"><a href="#&#x8C03;&#x6574;&#x9884;&#x6D4B;&#x7B56;&#x7565;" class="headerlink" title="&#x8C03;&#x6574;&#x9884;&#x6D4B;&#x7B56;&#x7565;"></a>&#x8C03;&#x6574;&#x9884;&#x6D4B;&#x7B56;&#x7565;</h3><p>&#x5BF9;&#x4E8E;&#x4E8C;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#xFF0C;&#x5728;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x6700;&#x540E;&#x7684;&#x9884;&#x6D4B;&#x662F;&#x6839;&#x636E;<script type="math/tex">h_{\Theta}(x)</script>&#x6765;&#x51B3;&#x5B9A;&#x7684;&#xFF0C;<script type="math/tex">h_{\Theta}(x) \geq 0.5</script>&#x5219;&#x4E3A;1&#xFF0C;<script type="math/tex">h_{\Theta}(x) \leq 0.5</script>&#x5219;&#x4E3A;0&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5F88;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x4F1A;&#x672C;&#x7740;&#x201C;&#x5B81;&#x53EF;&#x9519;&#x6740;&#x4E00;&#x4E07;&#xFF0C;&#x4E0D;&#x80FD;&#x653E;&#x8FC7;&#x4E00;&#x4E2A;&#x201D;&#x6216;&#x8005;&#x201C;&#x5B81;&#x53EF;&#x653E;&#x8FC7;&#x4E00;&#x4E07;&#xFF0C;&#x4E0D;&#x80FD;&#x9519;&#x6740;&#x4E00;&#x4E2A;&#x201D;&#x7684;&#x6001;&#x5EA6;&#xFF0C;&#x503E;&#x5411;&#x4E8E;&#x9009;&#x62E9;&#x5176;&#x4E2D;&#x67D0;&#x4E00;&#x7C7B;&#x3002;&#x8FD9;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x60C5;&#x51B5;&#x8C03;&#x6574;&#x4E34;&#x754C;&#x503C;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x764C;&#x75C7;&#x68C0;&#x6D4B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x4E0D;&#x5E0C;&#x671B;&#x6F0F;&#x6389;&#x4EFB;&#x4F55;&#x764C;&#x75C7;&#x60A3;&#x8005;&#xFF0C;&#x56E0;&#x4E3A;&#x771F;&#x6B63;&#x7684;&#x60A3;&#x8005;&#x5982;&#x679C;&#x4E0D;&#x63A5;&#x53D7;&#x6CBB;&#x7597;&#x540E;&#x679C;&#x662F;&#x4E0D;&#x582A;&#x8BBE;&#x60F3;&#x7684;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8C03;&#x4F4E;&#x4E34;&#x754C;&#x503C;&#xFF0C;&#x4F8B;&#x5982;&#x8BBE;&#x4E3A;0.3&#xFF0C;<script type="math/tex">h_{\Theta}(x) \geq 0.3</script>&#x5C31;&#x5224;&#x65AD;&#x4E3A;&#x53EF;&#x80FD;&#x60A3;&#x764C;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x4E8E;&#x7591;&#x4F3C;&#x60A3;&#x8005;&#x8FDB;&#x4E00;&#x6B65;&#x68C0;&#x6D4B;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x7B56;&#x7565;&#xFF0C;&#x5728;&#x8BC4;&#x4F30;&#x65F6;&#x4F1A;&#x5F97;&#x5230;&#x5F88;&#x9AD8;&#x7684;&#x53EC;&#x56DE;&#x7387;&#xFF0C;&#x4F46;&#x662F;&#x4F5C;&#x4E3A;&#x201C;&#x9519;&#x5224;&#x5065;&#x5EB7;&#x4EBA;&#x201D;&#x7684;&#x4EE3;&#x4EF7;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x5F97;&#x5230;&#x8F83;&#x4F4E;&#x7684;&#x67E5;&#x51C6;&#x7387;&#x3002;</p>
<p>&#x800C;&#x4ECE;&#x53E6;&#x4E00;&#x4E2A;&#x89D2;&#x5EA6;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x80FD;&#x66F4;&#x5BB3;&#x6015;&#x628A;&#x5065;&#x5EB7;&#x4EBA;&#x8BEF;&#x5224;&#x4E3A;&#x764C;&#x75C7;&#x60A3;&#x8005;&#xFF0C;&#x56E0;&#x4E3A;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5065;&#x5EB7;&#x4EBA;&#x7ECF;&#x5386;&#x764C;&#x75C7;&#x7684;&#x6CBB;&#x7597;&#x7684;&#x8BDD;&#xFF0C;&#x4E0D;&#x4EC5;&#x533B;&#x9662;&#x53EF;&#x80FD;&#x8981;&#x8D54;&#x94B1;&#xFF0C;&#x8FD9;&#x4E2A;&#x4EBA;&#x7684;&#x8EAB;&#x4F53;&#x4E5F;&#x4F1A;&#x6536;&#x5230;&#x764C;&#x75C7;&#x6CBB;&#x7597;&#x624B;&#x6BB5;&#x7684;&#x6781;&#x5927;&#x6740;&#x4F24;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x4F1A;&#x5C06;&#x4E34;&#x754C;&#x503C;&#x8C03;&#x5927;&#xFF0C;&#x4F8B;&#x5982;0.7&#xFF0C;&#x53EA;&#x6709;<script type="math/tex">h_{\Theta}(x) \geq 0.7</script>&#x65F6;&#xFF0C;&#x624D;&#x4F1A;&#x5224;&#x4E3A;&#x60A3;&#x764C;&#x3002;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x4F1A;&#x5F97;&#x5230;&#x5F88;&#x9AD8;&#x7684;&#x67E5;&#x51C6;&#x7387;&#xFF0C;&#x4F46;&#x53EC;&#x56DE;&#x7387;&#x4F1A;&#x8F83;&#x4F4E;&#x3002;</p>
<p>&#x5177;&#x4F53;&#x91C7;&#x7528;&#x4EC0;&#x4E48;&#x7B56;&#x7565;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#x5B9E;&#x9645;&#x5206;&#x6790;&#x3002;</p>
<h3 id="&#x5206;&#x6790;&#x7ED3;&#x679C;"><a href="#&#x5206;&#x6790;&#x7ED3;&#x679C;" class="headerlink" title="&#x5206;&#x6790;&#x7ED3;&#x679C;"></a>&#x5206;&#x6790;&#x7ED3;&#x679C;</h3><p>&#x52A0;&#x5165;&#xFF0C;&#x6211;&#x4EEC;&#x7F16;&#x5199;&#x4E86;&#x4E09;&#x4E2A;&#x7B97;&#x6CD5;&#xFF0C;&#x5176;&#x5206;&#x6790;&#x7ED3;&#x679C;&#x4E3A;&#xFF1A;</p>
<div class="table-container">
<table>
<thead>
<tr>
<th></th>
<th>&#x67E5;&#x51C6;&#x7387;</th>
<th>&#x53EC;&#x56DE;&#x7387;</th>
</tr>
</thead>
<tbody>
<tr>
<td><strong>&#x7B97;&#x6CD5;1</strong></td>
<td>0.5</td>
<td>0.4</td>
</tr>
<tr>
<td><strong>&#x7B97;&#x6CD5;2</strong></td>
<td>0.7</td>
<td>0.1</td>
</tr>
<tr>
<td><strong>&#x7B97;&#x6CD5;3</strong></td>
<td>0.02</td>
<td>1.0</td>
</tr>
</tbody>
</table>
</div>
<p>&#x90A3;&#x4E48;&#x5230;&#x5E95;&#x54EA;&#x4E2A;&#x66F4;&#x597D;&#x5462;&#xFF1F;</p>
<p>&#x5982;&#x679C;&#x672C;&#x8EAB;&#x9700;&#x6C42;&#x66F4;&#x503E;&#x5411;&#x4E8E;&#x67E5;&#x51C6;&#x7387;&#x548C;&#x53EC;&#x56DE;&#x7387;&#x7684;&#x5176;&#x4E2D;&#x7684;&#x67D0;&#x4E00;&#x79CD;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x81EA;&#x7136;&#x5C31;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x7B54;&#x6848;&#x3002;&#x4F46;&#x5982;&#x679C;&#x4E24;&#x8005;&#x96BE;&#x4EE5;&#x53D6;&#x820D;&#x7684;&#x8BDD;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x6709;&#x53EF;&#x4EE5;&#x91CF;&#x5316;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x5BF9;&#x8FD9;&#x4E09;&#x79CD;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x8BC4;&#x4F30;&#x3002;</p>
<p>&#x9996;&#x5148;&#x81EA;&#x7136;&#x800C;&#x7136;&#x80FD;&#x60F3;&#x5230;&#x7684;&#x5C31;&#x662F;&#x6C42;&#x5E73;&#x5747;&#x6570;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x6837;&#x662F;&#x6709;&#x95EE;&#x9898;&#x7684;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8BA1;&#x7B97;&#x5E73;&#x5747;&#x6570;&#x7684;&#x8BDD;&#xFF0C;&#x7B97;&#x6CD5;&#x4E09;&#x80FD;&#x591F;&#x5F97;&#x5230;0.51&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x5927;&#x4E8E;&#x524D;&#x9762;&#x4FE9;&#x3002;&#x4F46;&#x662F;&#x5047;&#x8BBE;&#x8FD9;&#x6837;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#xFF1A;&#x5B9E;&#x9645;&#x4E3A;1&#x7684;&#x6982;&#x7387;&#x662F;2%&#xFF0C;&#x7A0B;&#x5E8F;&#x59CB;&#x7EC8;&#x8F93;&#x51FA;1&#xFF0C;&#x8FD9;&#x663E;&#x7136;&#x662F;&#x4E0D;&#x5408;&#x7406;&#x7684;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x6211;&#x4EEC;&#x5982;&#x679C;&#x53D1;&#x73B0;&#x7B97;&#x6CD5;&#x7684;&#x67E5;&#x51C6;&#x7387;&#x6216;&#x53EC;&#x56DE;&#x7387;&#x975E;&#x5E38;&#x4F4E;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5224;&#x65AD;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x5E76;&#x4E0D;&#x597D;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x4ECB;&#x7ECD;&#x4E86;&#x4E00;&#x79CD;&#x66F4;&#x5408;&#x7406;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;<script type="math/tex">F_1</script>&#x503C;&#xFF08;&#x7B80;&#x79F0;F&#x503C;&#xFF09;&#xFF0C;&#x5176;&#x516C;&#x5F0F;&#x4E3A;$2\frac{PR}{P+R}$&#xFF0C;&#x8BA1;&#x7B97;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5206;&#x522B;&#x5F97;&#x5230;&#x4E86;0.444&#x3001;0.175&#x3001;0.0392&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x6BD4;&#x8F83;&#x7B26;&#x5408;&#x6211;&#x4EEC;&#x7684;&#x9884;&#x671F;&#x3002;</p>
<p><br></p>
<h2 id="&#x603B;&#x7ED3;"><a href="#&#x603B;&#x7ED3;" class="headerlink" title="&#x603B;&#x7ED3;"></a>&#x603B;&#x7ED3;</h2><p>&#x8FD9;&#x4E00;&#x7BC7;&#x53EA;&#x5305;&#x542B;&#x4E00;&#x5468;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x4F46;&#x662F;&#x5C31;&#x5185;&#x5BB9;&#x6765;&#x8BF4;&#x76F8;&#x5BF9;&#x8FD8;&#x662F;&#x6BD4;&#x8F83;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x4E2A;&#x4EBA;&#x611F;&#x89C9;&#x8FD9;&#x4E00;&#x7BC7;&#x90E8;&#x5206;&#x89E3;&#x51B3;&#x4E86;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x548C;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x4E2D;&#x591A;&#x9879;&#x5F0F;&#x6A21;&#x578B;&#x9009;&#x62E9;&#x7684;&#x95EE;&#x9898;&#x3002;&#x800C;&#x81F3;&#x4E8E;&#x7B97;&#x6CD5;&#x8BC4;&#x4F30;&#x7684;&#x65B9;&#x6CD5;&#x548C;&#x4FEE;&#x6B63;&#x7684;&#x7B56;&#x7565;&#x5219;&#x662F;&#x901A;&#x7528;&#x7684;&#xFF0C;&#x9996;&#x5148;&#x6839;&#x636E;&#x5404;&#x79CD;&#x6D4B;&#x8BD5;&#x4EE5;&#x53CA;&#x5F53;&#x524D;&#x6A21;&#x578B;&#x7684;&#x5404;&#x9879;&#x7279;&#x5F81;&#x5C5E;&#x6027;&#x5224;&#x65AD;&#x95EE;&#x9898;&#x51FA;&#x5728;&#x9AD8;&#x504F;&#x5DEE;&#x8FD8;&#x662F;&#x9AD8;&#x65B9;&#x5DEE;&#x4E0A;&#xFF0C;&#x7136;&#x540E;&#x6839;&#x636E;&#x95EE;&#x9898;&#x7684;&#x7C7B;&#x578B;&#x91C7;&#x53D6;&#x76F8;&#x5E94;&#x7B56;&#x7565;&#x8FDB;&#x884C;&#x4FEE;&#x6B63;&#x3002;</p>
<p>&#x65F6;&#x503C;&#x4EAC;&#x7D2B;&#x5F00;&#x64AD;&#xFF0C;&#x5306;&#x5306;&#x5FD9;&#x5FD9;&#x5199;&#x4E86;&#x8FD9;&#x4E00;&#x7BC7;&#xFF0C;&#x8D76;&#x7D27;&#x53BB;&#x770B;&#x4E1A;&#x754C;&#x826F;&#x5FC3;&#x5B87;&#x5B99;&#x8D77;&#x6E90;&#x4EBA;&#x7C7B;&#x5723;&#x7ECF;&#x53BB;&#x2026;&#x2026;</p>

      
    </div>

  </div>

  <div class="article-footer">
    <div class="article-meta pull-left">

    
      

    <span class="post-categories">
      <i class="icon-categories"></i>
        <a href="/categories/学习笔记/">学习笔记</a>
    </span>
    

    
    

    <span class="post-tags">
      <i class="icon-tags"></i>
        <a href="/tags/机器学习/">机器学习</a><a href="/tags/Coursera/">Coursera</a>
    </span>
    

    </div>

    
  </div>
</article>


    </main>

    <footer class="site-footer">
  <p class="site-info">
    Proudly powered by <a href="https://hexo.io/" target="_blank">Hexo</a> and
    Theme by <a href="https://github.com/kawaiiQ/kawaiiHacker" target="_blank">kawaiiHacker</a>
    <br>
    
    &copy; 2019 _kawaiiQ
    
  </p>
</footer>
    
    
<script>
  widget_settings = {
    maxDistance: 15,
    sensitive: 0.01
  };
</script>
<script src="/js/logo-widget.js"></script>



<script type="text/x-mathjax-config">
  MathJax.Hub.Config({
    tex2jax: {
      inlineMath: [['$','$'], ["\\(","\\)"] ],
      processEscapes: true
    }
  });
</script>
<script type="text/javascript" async src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/MathJax.js?config=TeX-MML-AM_CHTML">
</script>


  </div>
</div><!-- hexo-inject:begin --><!-- hexo-inject:end -->
</body>
</html>