<!DOCTYPE HTML>
<html>
<head>
  <meta charset="utf-8">
  
  <title>Coursera《机器学习》学习笔记（一）：线性回归与逻辑回归篇 | _kawaiiQ&#39;s blog</title>

  
  <meta name="author" content="_kawaiiQ">
  

  
  <meta name="description" content="&amp;#x300A;&amp;#x673A;&amp;#x5668;&amp;#x5B66;&amp;#x4E60;&amp;#x300B;&amp;#x8FD9;&amp;#x95E8;&amp;#x8BFE;&amp;#x975E;&amp;#x5E38;&amp;#x9002;&amp;#x5408;&amp;#x521A;&amp;#x521A;&amp;#x63A5;&amp;#x89E6;&amp;#x673A;&amp;#x5668;&amp;#x5B66;&amp;#x4E60;&amp;#x5165;&amp;#x95E8;&amp;#x8005;&amp;#xFF0C;&amp;#x8BB2;&amp;#x7684;&amp;#x5185;&amp;#x5BB9;&amp;#x6D45;&amp;#x663E;&amp;#x6613;&amp;#x61C2;&amp;#xFF0C;&amp;#x5FAA;&amp;#x5E8F;&amp;#x6E10;&amp;#x8FDB;&amp;#xFF0C;&amp;#x80FD;&amp;#x591F;&amp;#x5F88;&amp;#x5FEB;&amp;#x5BF9;&amp;#x673A;&amp;#x5668;&amp;#x5B66;&amp;#x4E60;&amp;#x6709;&amp;#x521D;&amp;#x6B65;&amp;#x7684;&amp;#x6982;&amp;#x5FF5;&amp;#x548C;&amp;#x57FA;&amp;#x672C;&amp;#x7684;&amp;#x5B9E;&amp;#x8DF5;&amp;#x80FD;&amp;#x529B;&amp;#x3002;&amp;#x5BF9;&amp;#x4E8E;&amp;#x521A;&amp;#x521A;&amp;#x5165;&amp;#x95E8;&amp;#x6216;&amp;#x8005;&amp;#x8FD8;&amp;#x6CA1;&amp;#x5165;&amp;#x95E8;&amp;#x7684;&amp;#x540C;&amp;#x5B66;&amp;#x6765;&amp;#x8BF4;&amp;#xFF0C;&amp;#x4E2A;&amp;#x4EBA;&amp;#x8FD8;&amp;#x662F;&amp;#x5341;&amp;#x5206;&amp;#x63A8;&amp;#x8350;&amp;#x7684;&amp;#xFF08;&amp;#x867D;&amp;#x7136;&amp;#x6211;&amp;#x4E5F;&amp;#x662F;&amp;#x521A;&amp;#x521A;&amp;#x5165;&amp;#x95E8;&amp;#x2026;&amp;#x2026;&amp;#xFF09;&amp;#x3002;
&amp;#x5468;&amp;#x4E00;&amp;#x300A;&amp;#x6A21;&amp;#x5F0F;&amp;#x8BC6;&amp;#x522B;&amp;#x4E0E;&amp;#x673A;&amp;#x5668;&amp;#x5B66;&amp;#x4E60;&amp;#x300B;&amp;#x8BFE;&amp;#x4E0A;&amp;#x8001;&amp;#x5E08;&amp;#x4E13;&amp;#x95E8;&amp;#x63D0;&amp;#x5230;&amp;#x4E86;Coursera&amp;#x4E0A;&amp;#x7684;&amp;#x8FD9;&amp;#x95E8;&amp;#x8BFE;&amp;#xFF0C;&amp;#x7136;&amp;#x540E;&amp;#x5F3A;&amp;#x8C03;&amp;#x8BF4;&amp;#x8BA9;&amp;#x6211;&amp;#x4EEC;&amp;#x4E0D;&amp;#x8981;&amp;#x770B;&amp;#xFF0C;&amp;#x56E0;&amp;#x4E3A;&amp;#x5185;&amp;#x5BB9;&amp;#x592A;&amp;#x521D;&amp;#x7EA7;&amp;#xFF0C;&amp;#x6211;&amp;#x4EEC;&amp;#x90FD;&amp;#x662F;&amp;#x7814;&amp;#x7A76;&amp;#x751F;&amp;#x4E86;&amp;#xFF0C;&amp;#x7136;&amp;#x540E;&amp;#x63A8;&amp;#x8350;&amp;#x4E86;&amp;#x4E00;&amp;#x5927;&amp;#x5806;&amp;#x673A;&amp;#x5668;&amp;#x5B66;&amp;#x4E60;&amp;#x7684;&amp;#x4E13;&amp;#x4E1A;&amp;#x4E66;&amp;#x7C4D;&amp;#x2026;&amp;#x2026;&amp;#x5927;&amp;#x6982;&amp;#x662F;&amp;#x89C9;&amp;#x5F97;&amp;#x6211;&amp;#x5728;&amp;#x672C;&amp;#x79D1;&amp;#x5DF2;&amp;#x7ECF;&amp;#x4EC0;&amp;#x4E48;&amp;#x90FD;&amp;#x5B66;&amp;#x4F1A;&amp;#x4E86;&amp;#x5427;&amp;#xFF0C;&amp;#x7136;&amp;#x800C;&amp;#x50CF;&amp;#x6211;&amp;#x8FD9;&amp;#x79CD;&amp;#x7684;&amp;#xFF0C;&amp;#x5C31;&amp;#x89C9;&amp;#x5F97;&amp;#x2026;&amp;#x2026;

&amp;#x8FD9;&amp;#x4E00;&amp;#x7BC7;&amp;#x4E3B;&amp;#x8981;&amp;#x662F;&amp;#x5BF9;&amp;#x8FD9;&amp;#x95E8;&amp;#x8BFE;&amp;#x524D;&amp;#x4E09;&amp;#x5468;&amp;#x77E5;&amp;#x8BC6;&amp;#x70B9;&amp;#x7684;&amp;#x6574;&amp;#x7406;&amp;#x4E0E;&amp;#x603B;&amp;#x7ED3;&amp;#xFF0C;&amp;#x4E3B;&amp;#x8981;&amp;#x6D89;&amp;#x53CA;&amp;#x7EBF;&amp;#x6027;&amp;#x56DE;&amp;#x5F52;&amp;#x548C;&amp;#x903B;&amp;#x8F91;&amp;#x56DE;&amp;#x5F52;&amp;#x4E24;&amp;#x5927;&amp;#x5757;&amp;#xFF0C;&amp;#x5E76;&amp;#x5728;&amp;#x4E00;&amp;#x5F00;&amp;#x5934;&amp;#x7B80;&amp;#x5355;&amp;#x666E;&amp;#x53CA;&amp;#x4E86;&amp;#x4E00;&amp;#x4E0B;&amp;#x673A;&amp;#x5668;&amp;#x5B66;&amp;#x4E60;&amp;#x7684;&amp;#x76F8;&amp;#x5173;&amp;#x6982;&amp;#x5FF5;&amp;#x3002;">
  

  
  
  <meta name="keywords" content="Coursera,机器学习,线性回归,逻辑回归">
  

  <meta id="viewport" name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no, minimal-ui">
  <meta name="apple-mobile-web-app-capable" content="yes">
  <meta name="apple-mobile-web-app-status-bar-style" content="black">

  <meta property="og:title" content="Coursera《机器学习》学习笔记（一）：线性回归与逻辑回归篇"/>

  <meta property="og:site_name" content="_kawaiiQ&#39;s blog"/>

  
  <meta property="og:image" content="/favicon.ico"/>
  

  <link href="/favicon.ico" rel="icon">
  <link rel="alternate" href="/atom.xml" title="_kawaiiQ&#39;s blog" type="application/atom+xml">
  <link rel="stylesheet" href="/css/style.css" media="screen" type="text/css">

  <link rel="dns-prefetch" href="https://cdnjs.cloudflare.com" />

</head>


<body>
<div class="blog">
  <div class="content">

    <header>
  <div class="site-branding">
    <h1 class="site-logo">
      <div>
        <a href="/"><img src="/images/logo.png" /></a>
        
          <a href="/"><img id="logo-widget" src="/images/widget.png" /></a>
        
      </div>
    </h1>
    <p class="site-description">Blind Busy All Day</p>
  </div>
  <nav class="site-navigation">
    <ul>
      
        <li><a href="/">主页</a></li>
      
        <li><a href="/categories">分类</a></li>
      
        <li><a href="/archives">所有文章</a></li>
      
        <li><a href="/about">关于我</a></li>
      
    </ul>
  </nav>
</header>

    <main class="site-main posts-loop">
    <article>

  
    
    <h3 class="article-title"><span>Coursera《机器学习》学习笔记（一）：线性回归与逻辑回归篇</span></h3>
    
  

  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/articles/1/" rel="bookmark">
        <time class="entry-date published" datetime="2017-11-05T14:35:00.000Z">
          2017-11-05
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <p><a href="https://www.coursera.org/learn/machine-learning" target="_blank" rel="external">&#x300A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x300B;</a>&#x8FD9;&#x95E8;&#x8BFE;&#x975E;&#x5E38;&#x9002;&#x5408;&#x521A;&#x521A;&#x63A5;&#x89E6;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x5165;&#x95E8;&#x8005;&#xFF0C;&#x8BB2;&#x7684;&#x5185;&#x5BB9;&#x6D45;&#x663E;&#x6613;&#x61C2;&#xFF0C;&#x5FAA;&#x5E8F;&#x6E10;&#x8FDB;&#xFF0C;&#x80FD;&#x591F;&#x5F88;&#x5FEB;&#x5BF9;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6709;&#x521D;&#x6B65;&#x7684;&#x6982;&#x5FF5;&#x548C;&#x57FA;&#x672C;&#x7684;&#x5B9E;&#x8DF5;&#x80FD;&#x529B;&#x3002;&#x5BF9;&#x4E8E;&#x521A;&#x521A;&#x5165;&#x95E8;&#x6216;&#x8005;&#x8FD8;&#x6CA1;&#x5165;&#x95E8;&#x7684;&#x540C;&#x5B66;&#x6765;&#x8BF4;&#xFF0C;&#x4E2A;&#x4EBA;&#x8FD8;&#x662F;&#x5341;&#x5206;&#x63A8;&#x8350;&#x7684;&#xFF08;&#x867D;&#x7136;&#x6211;&#x4E5F;&#x662F;&#x521A;&#x521A;&#x5165;&#x95E8;&#x2026;&#x2026;&#xFF09;&#x3002;</p>
<p>&#x5468;&#x4E00;&#x300A;&#x6A21;&#x5F0F;&#x8BC6;&#x522B;&#x4E0E;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x300B;&#x8BFE;&#x4E0A;&#x8001;&#x5E08;&#x4E13;&#x95E8;&#x63D0;&#x5230;&#x4E86;Coursera&#x4E0A;&#x7684;&#x8FD9;&#x95E8;&#x8BFE;&#xFF0C;&#x7136;&#x540E;&#x5F3A;&#x8C03;&#x8BF4;&#x8BA9;&#x6211;&#x4EEC;&#x4E0D;&#x8981;&#x770B;&#xFF0C;&#x56E0;&#x4E3A;&#x5185;&#x5BB9;&#x592A;&#x521D;&#x7EA7;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x662F;&#x7814;&#x7A76;&#x751F;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x63A8;&#x8350;&#x4E86;&#x4E00;&#x5927;&#x5806;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x4E13;&#x4E1A;&#x4E66;&#x7C4D;&#x2026;&#x2026;&#x5927;&#x6982;&#x662F;&#x89C9;&#x5F97;&#x6211;&#x5728;&#x672C;&#x79D1;&#x5DF2;&#x7ECF;&#x4EC0;&#x4E48;&#x90FD;&#x5B66;&#x4F1A;&#x4E86;&#x5427;&#xFF0C;&#x7136;&#x800C;&#x50CF;&#x6211;&#x8FD9;&#x79CD;&#x7684;&#xFF0C;&#x5C31;&#x89C9;&#x5F97;&#x2026;&#x2026;</p>
<p><img src="/images/this-is-really-terrible.jpg" alt=""></p>
<p>&#x8FD9;&#x4E00;&#x7BC7;&#x4E3B;&#x8981;&#x662F;&#x5BF9;&#x8FD9;&#x95E8;&#x8BFE;&#x524D;&#x4E09;&#x5468;&#x77E5;&#x8BC6;&#x70B9;&#x7684;&#x6574;&#x7406;&#x4E0E;&#x603B;&#x7ED3;&#xFF0C;&#x4E3B;&#x8981;&#x6D89;&#x53CA;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x548C;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x4E24;&#x5927;&#x5757;&#xFF0C;&#x5E76;&#x5728;&#x4E00;&#x5F00;&#x5934;&#x7B80;&#x5355;&#x666E;&#x53CA;&#x4E86;&#x4E00;&#x4E0B;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x76F8;&#x5173;&#x6982;&#x5FF5;&#x3002;</p>
<a id="more"></a>
<h2 id="&#x9700;&#x8981;&#x4EC0;&#x4E48;&#x77E5;&#x8BC6;"><a href="#&#x9700;&#x8981;&#x4EC0;&#x4E48;&#x77E5;&#x8BC6;" class="headerlink" title="&#x9700;&#x8981;&#x4EC0;&#x4E48;&#x77E5;&#x8BC6;"></a>&#x9700;&#x8981;&#x4EC0;&#x4E48;&#x77E5;&#x8BC6;</h2><ul>
<li>&#x4E00;&#x70B9;&#x70B9;&#x7EBF;&#x6027;&#x4EE3;&#x6570;&#x77E5;&#x8BC6;&#xFF1A;&#x5411;&#x91CF;&#x3001;&#x77E9;&#x9635;&#x7684;&#x8FD0;&#x7B97;</li>
<li>&#x4E00;&#x70B9;&#x70B9;&#x9AD8;&#x7B49;&#x6570;&#x5B66;&#x7684;&#x77E5;&#x8BC6;&#xFF1A;&#x5FAE;&#x5206;&#xFF08;&#x5982;&#x679C;&#x76F4;&#x63A5;&#x62FF;&#x6765;&#x7528;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x638C;&#x63E1;&#xFF09;</li>
</ul>
<h2 id="&#x4E3B;&#x8981;&#x5185;&#x5BB9;"><a href="#&#x4E3B;&#x8981;&#x5185;&#x5BB9;" class="headerlink" title="&#x4E3B;&#x8981;&#x5185;&#x5BB9;"></a>&#x4E3B;&#x8981;&#x5185;&#x5BB9;</h2><ul>
<li>&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x76F8;&#x5173;&#x6982;&#x5FF5;</li>
<li>&#x7EBF;&#x6027;&#x56DE;&#x5F52;</li>
<li>&#x903B;&#x8F91;&#x56DE;&#x5F52;</li>
<li>&#x6B63;&#x5219;&#x5316;</li>
</ul>
<p><br></p>
<h2 id="&#x673A;&#x5668;&#x5B66;&#x4E60;&#x76F8;&#x5173;&#x6982;&#x5FF5;"><a href="#&#x673A;&#x5668;&#x5B66;&#x4E60;&#x76F8;&#x5173;&#x6982;&#x5FF5;" class="headerlink" title="&#x673A;&#x5668;&#x5B66;&#x4E60;&#x76F8;&#x5173;&#x6982;&#x5FF5;"></a>&#x673A;&#x5668;&#x5B66;&#x4E60;&#x76F8;&#x5173;&#x6982;&#x5FF5;</h2><p>&#x4E3B;&#x8981;&#x4ECB;&#x7ECD;&#x4E86;&#x4E00;&#x4E0B;&#x4EC0;&#x4E48;&#x662F;&#x673A;&#x5668;&#x5B66;&#x4E60;&#xFF0C;&#x4EE5;&#x53CA;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x4E3B;&#x8981;&#x7C7B;&#x578B;&#x3002;</p>
<h3 id="&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x5B9A;&#x4E49;"><a href="#&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x5B9A;&#x4E49;" class="headerlink" title="&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x5B9A;&#x4E49;"></a>&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x5B9A;&#x4E49;</h3><ul>
<li>&#x7ECF;&#x9A8C;E&#xFF1A;&#x7A0B;&#x5E8F;&#x7528;&#x6765;&#x5B66;&#x4E60;&#x7684;&#x4E1C;&#x897F;&#x3002;</li>
<li>&#x4EFB;&#x52A1;T&#xFF1A;&#x7A0B;&#x5E8F;&#x8981;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x3002;</li>
<li>&#x5EA6;&#x91CF;&#x503C;P&#xFF1A;&#x7528;&#x6765;&#x8861;&#x91CF;&#x7A0B;&#x5E8F;&#x8868;&#x73B0;&#x597D;&#x574F;&#x7684;&#x6807;&#x51C6;&#x3002;</li>
</ul>
<p>&#x7A0B;&#x5E8F;&#x8981;&#x89E3;&#x51B3;&#x4E00;&#x4E9B;&#x4EFB;&#x52A1;T&#xFF0C;&#x5982;&#x679C;&#x901A;&#x8FC7;P&#x8861;&#x91CF;&#x4E4B;&#x540E;&#x53D1;&#x73B0;&#x968F;&#x7740;&#x4ECE;&#x7ECF;&#x9A8C;E&#x4E2D;&#x7684;&#x5B66;&#x4E60;&#xFF0C;&#x7A0B;&#x5E8F;&#x7684;&#x8868;&#x73B0;&#x8D8A;&#x6765;&#x8D8A;&#x597D;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x53EF;&#x4EE5;&#x8BF4;&#x7A0B;&#x5E8F;&#x901A;&#x8FC7;T&#x548C;P&#x4ECE;E&#x4E2D;&#x5B66;&#x4E60;&#x3002;</p>
<h3 id="&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x4E3B;&#x8981;&#x7C7B;&#x578B;"><a href="#&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x4E3B;&#x8981;&#x7C7B;&#x578B;" class="headerlink" title="&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x4E3B;&#x8981;&#x7C7B;&#x578B;"></a>&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x4E3B;&#x8981;&#x7C7B;&#x578B;</h3><ul>
<li>&#x6709;&#x76D1;&#x7763;&#x5B66;&#x4E60;<br>  &#x7ED9;&#x51FA;&#x90E8;&#x5206;&#x6709;&#x6B63;&#x786E;&#x7ED3;&#x679C;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x7A0B;&#x5E8F;&#x901A;&#x8FC7;&#x5B66;&#x4E60;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#xFF08;&#x8BAD;&#x7EC3;&#xFF09;&#x6765;&#x5BF9;&#x65B0;&#x7684;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x9884;&#x6D4B;&#x3002;&#x8BFE;&#x7A0B;&#x4E2D;&#x4E3B;&#x8981;&#x6D89;&#x53CA;&#x4E24;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;<strong>&#x56DE;&#x5F52;&#xFF08;Regression&#xFF09;&#x95EE;&#x9898;</strong>&#x548C;<strong>&#x5206;&#x7C7B;&#xFF08;Classification&#xFF09;&#x95EE;&#x9898;</strong>&#x3002;&#x56DE;&#x5F52;&#x95EE;&#x9898;&#x662F;&#x8BF4;&#xFF0C;&#x7A0B;&#x5E8F;&#x9700;&#x8981;&#x9884;&#x6D4B;&#x7684;&#x7ED3;&#x679C;&#x7684;&#x503C;&#x662F;&#x8FDE;&#x7EED;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x9884;&#x6D4B;&#x623F;&#x4EF7;&#xFF0C;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x4EF7;&#x683C;&#x533A;&#x95F4;&#x5185;&#x7ED9;&#x51FA;&#x7ED3;&#x679C;&#xFF1B;&#x800C;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#x662F;&#x8BF4;&#xFF0C;&#x7A0B;&#x5E8F;&#x901A;&#x5E38;&#x662F;&#x8FDB;&#x884C;&#x4E00;&#x4E2A;&#x5206;&#x7C7B;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x9884;&#x6D4B;&#x7684;&#x7ED3;&#x679C;&#x662F;&#x6709;&#x9650;&#x7684;&#x79BB;&#x6563;&#x7684;&#x503C;&#xFF0C;&#x6BD4;&#x5982;&#x6839;&#x636E;&#x75C5;&#x4EBA;&#x6570;&#x636E;&#x9884;&#x6D4B;&#x8FD9;&#x4E2A;&#x4EBA;&#x662F;&#x4E0D;&#x662F;&#x611F;&#x5192;&#x4E86;&#xFF08;0&#x548C;1&#xFF09;&#x3002;</li>
<li>&#x65E0;&#x76D1;&#x7763;&#x5B66;&#x4E60;<br>  &#x6211;&#x4EEC;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x95EE;&#x9898;&#x600E;&#x4E48;&#x89E3;&#x51B3;&#xFF0C;&#x6211;&#x4EEC;&#x8BA9;&#x7A0B;&#x5E8F;&#x81EA;&#x5DF1;&#x8BD5;&#x56FE;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x4F8B;&#x5982;&#x805A;&#x7C7B;&#x7B97;&#x6CD5;&#xFF0C;&#x5C31;&#x662F;&#x5728;&#x4E00;&#x5806;&#x6570;&#x636E;&#x5F53;&#x4E2D;&#x7531;&#x7A0B;&#x5E8F;&#x81EA;&#x884C;&#x5212;&#x5206;&#x51FA;&#x4E0D;&#x540C;&#x7684;&#x805A;&#x7C7B;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x7ED9;&#x51FA;1000000&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x57FA;&#x56E0;&#xFF0C;&#x4EA4;&#x7ED9;&#x8BA1;&#x7B97;&#x673A;&#x6765;&#x81EA;&#x52A8;&#x5206;&#x7C7B;&#x3002;</li>
</ul>
<p><br></p>
<h2 id="&#x7EBF;&#x6027;&#x56DE;&#x5F52;"><a href="#&#x7EBF;&#x6027;&#x56DE;&#x5F52;" class="headerlink" title="&#x7EBF;&#x6027;&#x56DE;&#x5F52;"></a>&#x7EBF;&#x6027;&#x56DE;&#x5F52;</h2><p>&#x5047;&#x5B9A;&#x4F60;&#x624B;&#x4E0A;&#x6709;&#x4E00;&#x5806;&#x623F;&#x5C4B;&#x7684;&#x5404;&#x7C7B;&#x4FE1;&#x606F;&#x4EE5;&#x53CA;&#x4EF7;&#x683C;&#xFF0C;&#x73B0;&#x5728;&#x4F60;&#x5E0C;&#x671B;&#x80FD;&#x591F;&#x6839;&#x636E;&#x8FD9;&#x4E9B;&#x623F;&#x5C4B;&#x4FE1;&#x606F;&#x6765;&#x627E;&#x51FA;&#x4E00;&#x6761;&#x89C4;&#x5F8B;&#x6765;&#x9884;&#x6D4B;&#x65B0;&#x697C;&#x76D8;&#x7684;&#x623F;&#x4EF7;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x627E;&#x89C4;&#x5F8B;&#x7684;&#x8FC7;&#x7A0B;&#x5C31;&#x662F;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x4E86;&#x3002;&#x7B3C;&#x7EDF;&#x5730;&#x8BB2;&#xFF0C;&#x6240;&#x8C13;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x76EE;&#x7684;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x627E;&#x4E00;&#x6761;&#x80FD;&#x591F;&#x5951;&#x5408;&#x95EE;&#x9898;&#x7684;&#x89C4;&#x5F8B;&#xFF0C;&#x7A0D;&#x5FAE;&#x5F62;&#x8C61;&#x4E00;&#x70B9;&#x5C31;&#x662F;&#x6709;&#x4E00;&#x5806;&#x70B9;&#xFF0C;&#x7136;&#x540E;&#x60F3;&#x529E;&#x6CD5;&#x627E;&#x51FA;&#x4E00;&#x6761;&#x76F4;&#x7EBF;&#x80FD;&#x591F;&#x5C3D;&#x53EF;&#x80FD;&#x7A7F;&#x8FC7;&#x6216;&#x8005;&#x63A5;&#x8FD1;&#x8FD9;&#x4E9B;&#x70B9;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x6837;&#x8BF4;&#x81EA;&#x7136;&#x5C31;&#x662F;&#x6307;&#x4E8C;&#x7EF4;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x4E09;&#x7EF4;&#x90A3;&#x53EF;&#x80FD;&#x5C31;&#x662F;&#x627E;&#x4E00;&#x4E2A;&#x5E73;&#x9762;&#xFF0C;&#x518D;&#x9AD8;&#x7EF4;&#x5C31;&#x662F;&#x8D85;&#x5E73;&#x9762;&#x4E00;&#x7C7B;&#x7684;&#x4E86;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x600E;&#x4E48;&#x627E;&#x89C4;&#x5F8B;&#x5462;&#xFF1F;&#x627E;&#x89C4;&#x5F8B;&#x7684;&#x5957;&#x8DEF;&#x5176;&#x5B9E;&#x5F88;&#x7B80;&#x5355;&#x7684;&#xFF0C;&#x5C31;&#x662F;&#x9996;&#x5148;&#x201C;&#x731C;&#x201D;&#x4E00;&#x4E2A;&#x89C4;&#x5F8B;&#xFF0C;&#x51C6;&#x4E0D;&#x51C6;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x7136;&#x540E;&#x4ECE;&#x8FD9;&#x4E2A;&#x89C4;&#x5F8B;&#x5F00;&#x59CB;&#xFF0C;&#x4E0D;&#x65AD;&#x5730;&#x68C0;&#x9A8C;&#x5F53;&#x524D;&#x89C4;&#x5F8B;&#x7684;&#x597D;&#x574F;&#xFF0C;&#x6839;&#x636E;&#x68C0;&#x9A8C;&#x7ED3;&#x679C;&#x8C03;&#x6574;&#x89C4;&#x5F8B;&#xFF0C;&#x76F4;&#x5230;&#x8C03;&#x6574;&#x51FA;&#x6700;&#x4F18;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x7528;&#x524D;&#x9762;&#x5BF9;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x5B9A;&#x4E49;&#x6765;&#x8BF4;&#xFF0C;&#x5C31;&#x662F;&#x6700;&#x4F18;&#x5316;&#x5EA6;&#x91CF;&#x503C;P&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x5C31;&#x5148;&#x4ECE;&#x5355;&#x4E00;&#x7279;&#x5F81;&#xFF08;&#x4E8C;&#x7EF4;&#xFF09;&#x7684;&#x60C5;&#x51B5;&#x5F00;&#x59CB;&#x4ECB;&#x7ECD;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x63A8;&#x5E7F;&#x5230;&#x591A;&#x7279;&#x5F81;&#xFF08;&#x591A;&#x7EF4;&#xFF09;&#x7684;&#x95EE;&#x9898;&#x4E2D;&#x3002;</p>
<h3 id="&#x5355;&#x4E00;&#x7279;&#x5F81;&#x7684;&#x7EBF;&#x6027;&#x56DE;&#x5F52;"><a href="#&#x5355;&#x4E00;&#x7279;&#x5F81;&#x7684;&#x7EBF;&#x6027;&#x56DE;&#x5F52;" class="headerlink" title="&#x5355;&#x4E00;&#x7279;&#x5F81;&#x7684;&#x7EBF;&#x6027;&#x56DE;&#x5F52;"></a>&#x5355;&#x4E00;&#x7279;&#x5F81;&#x7684;&#x7EBF;&#x6027;&#x56DE;&#x5F52;</h3><p>&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x6D3B;&#x5728;&#x4E00;&#x4E2A;&#x795E;&#x5947;&#x7684;&#x4E16;&#x754C;&#x91CC;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x4E16;&#x754C;&#x623F;&#x4EF7;&#x4EC5;&#x4EC5;&#x8DDF;&#x623F;&#x5B50;&#x7684;&#x9762;&#x79EF;&#x6709;&#x5173;&#x7CFB;&#xFF0C;&#x800C;&#x4E14;&#x66F4;&#x52A0;&#x795E;&#x5947;&#x5730;&#x662F;&#xFF0C;&#x623F;&#x4EF7;&#x548C;&#x9762;&#x79EF;&#x7ADF;&#x7136;&#x662F;&#x5B8C;&#x7F8E;&#x7684;&#x7EBF;&#x6027;&#x5173;&#x7CFB;&#x3002;&#x5982;&#x679C;x&#x6765;&#x8868;&#x793A;&#x9762;&#x79EF;&#x3001;y&#x6765;&#x8868;&#x793A;&#x623F;&#x4EF7;&#x7684;&#x8BDD;&#xFF0C;&#x5219;&#x4E24;&#x8005;&#x7684;&#x5173;&#x7CFB;&#x5C31;&#x662F;$y = ax + b$&#x3002;&#x90A3;&#x4E48;&#x51C6;&#x786E;&#x9884;&#x6D4B;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x91CC;&#x7684;&#x623F;&#x4EF7;&#x5176;&#x5B9E;&#x4E5F;&#x5C31;&#x53EA;&#x662F;&#x9700;&#x8981;&#x627E;&#x5230;&#x76F8;&#x5E94;&#x7684;$a$&#x548C;$b$&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E5F;&#x5C31;&#x662F;&#x6700;&#x7B80;&#x5355;&#x7684;&#x5355;&#x4E00;&#x7279;&#x5F81;&#x7684;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x4E86;&#x3002;</p>
<h4 id="&#x5047;&#x8BBE;&#x51FD;&#x6570;-Hypothesis-Function"><a href="#&#x5047;&#x8BBE;&#x51FD;&#x6570;-Hypothesis-Function" class="headerlink" title="&#x5047;&#x8BBE;&#x51FD;&#x6570;(Hypothesis Function)"></a>&#x5047;&#x8BBE;&#x51FD;&#x6570;(Hypothesis Function)</h4><p>&#x524D;&#x9762;&#x6240;&#x8BF4;&#x7684;&#x89C4;&#x5F8B;&#x4E5F;&#x5C31;&#x662F;&#x8FD9;&#x91CC;&#x7684;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#xFF0C;&#x4E00;&#x822C;&#x7528;$h(x)$&#x6765;&#x8868;&#x793A;&#xFF0C;&#x8FD9;&#x91CC;&#x7EA6;&#x5B9A;&#x4E00;&#x4E9B;&#x7B26;&#x53F7;&#xFF1A;</p>
<ul>
<li>$x^{(i)}$&#x8868;&#x793A;&#x7B2C;i&#x7EC4;&#x8F93;&#x5165;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x6216;&#x8005;&#x4E5F;&#x79F0;&#x4F5C;&#x7279;&#x5F81;&#xFF08;features&#xFF09;&#x3002;&#x8FD9;&#x91CC;&#x8BF4;&#x7684;&#x7279;&#x5F81;&#x662F;&#x6307;&#x8F93;&#x5165;&#x7684;&#x4E00;&#x7EC4;&#x53D8;&#x91CF;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x4E00;&#x4E2A;&#x6837;&#x672C;&#xFF0C;&#x4E0D;&#x8FC7;&#x540E;&#x9762;&#x6709;&#x65F6;&#x5019;&#x63D0;&#x5230;&#x7684;&#x7279;&#x5F81;&#x6307;&#x7684;&#x662F;&#x4E00;&#x7EC4;&#x8F93;&#x5165;&#x91CC;&#x7684;&#x5206;&#x91CF;&#x3002;&#x5728;&#x8FD9;&#x4E00;&#x8282;&#x91CC;&#xFF0C;&#x7531;&#x4E8E;&#x8BAD;&#x7EC3;&#x96C6;&#x90FD;&#x662F;&#x4E8C;&#x7EF4;&#x7684;&#x70B9;&#xFF0C;&#x56E0;&#x6B64;&#x4E00;&#x7EC4;&#x7279;&#x5F81;&#x91CC;&#x6BCF;&#x7EC4;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x7279;&#x5F81;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x6709;&#x70B9;&#x7ED5;&#x2026;&#x2026;</li>
<li>$y^{(i)}$&#x5219;&#x8868;&#x793A;&#x8F93;&#x51FA;&#x6216;&#x8005;&#x76EE;&#x6807;&#x53D8;&#x91CF;&#x3002;</li>
<li>$(x^{(i)}, y^{(i)})$&#x4E3A;&#x4E00;&#x7EC4;&#x8BAD;&#x7EC3;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x6240;&#x6709;&#x7684;$(x^{(i)}, y^{(i)})(i=1,2,\cdots,m)$&#x7EC4;&#x6210;&#x7684;&#x5217;&#x8868;&#xFF0C;&#x79F0;&#x4F5C;&#x662F;&#x4E00;&#x4E2A;&#x8BAD;&#x7EC3;&#x96C6;&#x3002;</li>
</ul>
<p>&#x7528;$X$&#x8868;&#x793A;&#x8F93;&#x5165;&#x503C;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x7528;$Y$&#x8868;&#x793A;&#x8F93;&#x51FA;&#x503C;&#x7684;&#x7A7A;&#x95F4;&#x3002;</p>
<p>&#x7A0B;&#x5E8F;&#x4F7F;&#x7528;&#x5B66;&#x4E60;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x4ECE;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#x5B66;&#x4E60;&#xFF0C;&#x6700;&#x7EC8;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x9884;&#x6D4B;&#x7684;&#x5047;&#x8BBE;&#x51FD;&#x6570;$h=X{\rightarrow}Y$&#x3002;&#x5BF9;&#x4E8E;&#x8F93;&#x5165;&#x7684;&#x9700;&#x8981;&#x9884;&#x6D4B;&#x7684;&#x503C;x&#xFF0C;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x53EF;&#x4EE5;&#x7ED9;&#x51FA;&#x9884;&#x6D4B;&#x503C;y&#x3002;</p>
<img src="/articles/1/pic1.png" alt="&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x7684;&#x793A;&#x610F;&#x56FE;" title="&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x7684;&#x793A;&#x610F;&#x56FE;">
<p>&#x6709;&#x4E86;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#xFF0C;&#x6309;&#x7167;&#x524D;&#x9762;&#x6240;&#x8BF4;&#x7684;&#x5957;&#x8DEF;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x5C31;&#x9700;&#x8981;&#x6709;&#x4E00;&#x79CD;&#x8861;&#x91CF;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x6548;&#x679C;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<h4 id="&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#xFF08;Cost-Function&#xFF09;"><a href="#&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#xFF08;Cost-Function&#xFF09;" class="headerlink" title="&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#xFF08;Cost Function&#xFF09;"></a>&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#xFF08;Cost Function&#xFF09;</h4><p>&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x53C8;&#x53EB;&#x505A;&#x635F;&#x5931;&#x51FD;&#x6570;&#xFF08;Loss Function&#xFF09;&#xFF0C;&#x7528;&#x6765;&#x8BA1;&#x7B97;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#x7684;&#x9884;&#x6D4B;&#x4E0E;&#x5B9E;&#x9645;&#x7ED3;&#x679C;&#x7684;&#x201C;&#x504F;&#x5DEE;&#x201D;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x5047;&#x8BBE;&#x51FD;&#x6570;</p>
<script type="math/tex; mode=display">h_\theta(x)=\theta_0+\theta_1x</script><p>&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x4E3A;</p>
<script type="math/tex; mode=display">J(\theta_0, \theta_1) = \dfrac {1}{2m} \displaystyle \sum _{i=1}^m \left ( \hat{y}^{(i)}- y^{(i)} \right)^2 = \dfrac {1}{2m} \displaystyle \sum _{i=1}^m \left (h_\theta (x^{(i)}) - y^{(i)} \right)^2</script><p>&#x5176;&#x4E2D;&#xFF0C;$m$&#x4E3A;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#x6837;&#x672C;&#x7684;&#x6570;&#x91CF;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x4E5F;&#x53EB;&#x505A;&#x5747;&#x65B9;&#x5DEE;&#x3002;</p>
<p>&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x8BA1;&#x7B97;&#x7684;&#x503C;&#x662F;&#x5C06;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x81EA;&#x53D8;&#x91CF;&#x4EE3;&#x5165;&#x540E;&#x6240;&#x5F97;&#x7684;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x4E0E;&#x5B9E;&#x9645;&#x7ED3;&#x679C;&#x7684;&#x65B9;&#x5DEE;&#xFF0C;&#x8868;&#x793A;&#x7684;&#x662F;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x7684;&#x76F4;&#x7EBF;&#x4E0E;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#x5404;&#x70B9;&#x62DF;&#x5408;&#x5F97;&#x6709;&#x591A;&#x597D;&#x3002;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x662F;&#x7528;&#x6765;&#x8861;&#x91CF;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x597D;&#x574F;&#x7684;&#x4E00;&#x4E2A;&#x8BC4;&#x4EF7;&#x6807;&#x51C6;&#xFF0C;&#x56E0;&#x6B64;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x6240;&#x5F97;&#x7684;&#x7ED3;&#x679C;&#x8D8A;&#x5C0F;&#xFF0C;&#x8BF4;&#x660E;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x9884;&#x6D4B;&#x6548;&#x679C;&#x8D8A;&#x597D;&#x3002;</p>
<p>&#x6709;&#x4E86;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#xFF0C;&#x6709;&#x4E86;&#x201C;&#x8861;&#x91CF;&#x201D;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x7684;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x76EE;&#x6807;&#x662F;&#x627E;&#x5230;&#x6784;&#x6210;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x7684;&#x53C2;&#x6570;$\theta_0, \theta_1$&#xFF0C;&#x4F7F;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x7684;&#x503C;&#x6700;&#x5C0F;&#x3002;</p>
<h4 id="&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#xFF08;Gradient-Descent&#xFF09;"><a href="#&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#xFF08;Gradient-Descent&#xFF09;" class="headerlink" title="&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#xFF08;Gradient Descent&#xFF09;"></a>&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#xFF08;Gradient Descent&#xFF09;</h4><p>&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x662F;&#x6700;&#x5C0F;&#x5316;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x7C7B;&#x4F3C;&#x8D70;&#x4E0B;&#x5761;&#x8DEF;&#x4E0B;&#x5C71;&#xFF1A;&#x6CBF;&#x7740;&#x4E0B;&#x5761;&#x8DEF;&#x4E00;&#x76F4;&#x5411;&#x4E0B;&#x8D70;&#xFF0C;&#x4E00;&#x76F4;&#x8D70;&#x5230;&#x6CA1;&#x6709;&#x4E0B;&#x5761;&#x8DEF;&#x4E3A;&#x6B62;&#x3002; </p>
<h5 id="1-&#x4E3B;&#x8981;&#x65B9;&#x6CD5;&#x4E0E;&#x7279;&#x70B9;"><a href="#1-&#x4E3B;&#x8981;&#x65B9;&#x6CD5;&#x4E0E;&#x7279;&#x70B9;" class="headerlink" title="(1) &#x4E3B;&#x8981;&#x65B9;&#x6CD5;&#x4E0E;&#x7279;&#x70B9;"></a><big>(1) &#x4E3B;&#x8981;&#x65B9;&#x6CD5;&#x4E0E;&#x7279;&#x70B9;</big></h5><ul>
<li>&#x4ECE;&#x67D0;&#x5BF9;$\theta_0,\theta_1$&#x5F00;&#x59CB;&#x3002;</li>
<li>&#x4E0D;&#x65AD;&#x5730;&#x4E00;&#x70B9;&#x70B9;&#x6539;&#x53D8;$\theta_0,\theta_1$&#x7684;&#x503C;&#xFF0C;&#x5E0C;&#x671B;&#x80FD;&#x591F;&#x51CF;&#x5C0F;$J(\theta_0, \theta_1)$&#x7684;&#x503C;&#xFF0C;&#x76F4;&#x5230;&#x627E;&#x5230;&#x5176;&#x6700;&#x5C0F;&#x503C;&#x3002;</li>
<li><strong>&#x540C;&#x65F6;&#x66F4;&#x65B0;</strong>$\theta_0,\theta_1$</li>
<li>&#x627E;&#x5230;&#x7684;&#x53EF;&#x80FD;&#x662F;&#x5C40;&#x90E8;&#x6700;&#x5C0F;&#x503C;&#xFF0C;&#x4E0D;&#x4E00;&#x5B9A;&#x627E;&#x5230;&#x5168;&#x5C40;&#x6700;&#x5C0F;&#x503C;&#x3002;</li>
</ul>
<h5 id="2-&#x6838;&#x5FC3;&#x7B97;&#x6CD5;"><a href="#2-&#x6838;&#x5FC3;&#x7B97;&#x6CD5;" class="headerlink" title="(2) &#x6838;&#x5FC3;&#x7B97;&#x6CD5;"></a><big>(2) &#x6838;&#x5FC3;&#x7B97;&#x6CD5;</big></h5><script type="math/tex; mode=display">\theta_j := \theta_j - \alpha \frac{\partial}{\partial \theta_j} J(\theta_0, \theta_1)</script><p>&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x6838;&#x5FC3;&#x7B97;&#x6CD5;&#x516C;&#x5F0F;&#x4E2D;&#x7684;$\alpha$&#x8868;&#x793A;&#x5B66;&#x4E60;&#x901F;&#x7387;&#xFF08;Learning Rate&#xFF09;&#xFF0C;&#x7528;&#x4E8E;&#x63A7;&#x5236;&#x6BCF;&#x6B21;&#x4EE5;&#x591A;&#x5927;&#x7684;&#x5E45;&#x5EA6;&#x66F4;&#x65B0;$\theta_j$&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6BCF;&#x6B21;&#x8D70;&#x4E0B;&#x5761;&#x8DEF;&#x8981;&#x8FC8;&#x591A;&#x5927;&#x7684;&#x6B65;&#x5B50;&#x3002;</p>
<p>&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x53C2;&#x6570;&#xFF08;$\theta_0,\theta_1$&#xFF09;&#x5E94;&#x5F53;&#x540C;&#x65F6;&#x66F4;&#x65B0;&#xFF0C;&#x5373;&#x5728;&#x6240;&#x6709;&#x7684;&#x68AF;&#x5EA6;&#x8BA1;&#x7B97;&#x5B8C;&#x6BD5;&#x540E;&#x540C;&#x65F6;&#x66F4;&#x65B0;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x66F4;&#x65B0;&#x4E00;&#x4E2A;&#x4E4B;&#x540E;&#x518D;&#x8BA1;&#x7B97;&#x548C;&#x66F4;&#x65B0;&#x53E6;&#x4E00;&#x4E2A;&#x3002;</p>
<p>&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7684;&#x6838;&#x5FC3;&#x7B97;&#x6CD5;&#x5C31;&#x662F;&#x4E0D;&#x65AD;&#x91CD;&#x590D;&#x4E0A;&#x9762;&#x7684;&#x516C;&#x5F0F;&#x76F4;&#x5230;&#x6536;&#x655B;&#x4E3A;&#x6B62;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5C31;&#x662F;&#x6BCF;&#x6B21;&#x8BA1;&#x7B97;&#x4E00;&#x4E0B;&#x5F53;&#x524D;&#x6240;&#x5728;&#x4F4D;&#x7F6E;&#x7684;&#x68AF;&#x5EA6;&#xFF08;&#x6C42;&#x504F;&#x5BFC;&#x6570;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x6BCF;&#x6B21;&#x5411;&#x7740;&#x201C;&#x4E0B;&#x5C71;&#x201D;&#xFF08;&#x51CF;&#x5C0F;$J(\theta_0, \theta_1)$&#xFF09;&#x7684;&#x65B9;&#x5411;&#x79FB;&#x52A8;&#x4E00;&#x5C0F;&#x6B65;&#xFF0C;&#x76F4;&#x5230;&#x8D70;&#x5230;&#x4E00;&#x4E2A;&#x201C;&#x4F4E;&#x6D3C;&#x5730;&#x201D;&#xFF08;&#x5C40;&#x90E8;&#x6700;&#x5C0F;&#x503C;&#xFF09;&#x4E3A;&#x6B62;&#x3002;&#x5728;&#x201C;&#x8FC8;&#x6B65;&#x5B50;&#x201D;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x68AF;&#x5EA6;&#x6BD4;&#x8F83;&#x201C;&#x9661;&#x201D;&#xFF0C;&#x90A3;&#x53EF;&#x80FD;&#x79BB;&#x201C;&#x4F4E;&#x6D3C;&#x5730;&#x201D;&#x8FD8;&#x6BD4;&#x8F83;&#x8FDC;&#xFF0C;&#x6B65;&#x5B50;&#x5C31;&#x8FC8;&#x5F97;&#x5927;&#x4E00;&#x70B9;&#xFF1B;&#x5426;&#x5219;&#xFF0C;&#x6BD4;&#x8F83;&#x201C;&#x5E73;&#x7F13;&#x201D;&#x53EF;&#x80FD;&#x8BF4;&#x660E;&#x5FEB;&#x5230;&#x201C;&#x4F4E;&#x6D3C;&#x5730;&#x201D;&#x4E86;&#xFF0C;&#x90A3;&#x6B65;&#x5B50;&#x5C31;&#x8FC8;&#x5F97;&#x5C0F;&#x4E00;&#x70B9;&#xFF0C;&#x9632;&#x6B62;&#x8D70;&#x8FC7;&#x3002;</p>
<h5 id="3-&#x5B66;&#x4E60;&#x901F;&#x7387;-alpha-&#x7684;&#x53D6;&#x503C;"><a href="#3-&#x5B66;&#x4E60;&#x901F;&#x7387;-alpha-&#x7684;&#x53D6;&#x503C;" class="headerlink" title="(3) &#x5B66;&#x4E60;&#x901F;&#x7387;$\alpha$&#x7684;&#x53D6;&#x503C;"></a><big>(3) &#x5B66;&#x4E60;&#x901F;&#x7387;$\alpha$&#x7684;&#x53D6;&#x503C;</big></h5><p>&#x6BCF;&#x6B21;&#x8FED;&#x4EE3;&#x66F4;&#x65B0;$\theta_j$&#x7684;&#x5E45;&#x5EA6;&#x90FD;&#x4E0E;$\alpha$&#x548C;&#x5F53;&#x524D;&#x7684;&#x68AF;&#x5EA6;&#x6709;&#x5173;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x786E;&#x5B9A;&#x7684;&#x503C;$\alpha$&#xFF0C;&#x5F53;&#x524D;&#x68AF;&#x5EA6;&#xFF08;&#x504F;&#x5BFC;&#x6570;&#xFF09;&#x7684;&#x7EDD;&#x5BF9;&#x503C;&#x8D8A;&#x5927;&#xFF0C;&#x66F4;&#x65B0;&#x7684;&#x5E45;&#x5EA6;&#x8D8A;&#x5927;&#xFF0C;&#x7EDD;&#x5BF9;&#x503C;&#x8D8A;&#x5C0F;&#xFF0C;&#x66F4;&#x65B0;&#x7684;&#x5E45;&#x5EA6;&#x8D8A;&#x5C0F;&#x3002;</p>
<p>&#x6240;&#x4EE5;$\alpha$&#x7684;&#x53D6;&#x503C;&#x4E0D;&#x80FD;&#x592A;&#x5927;&#x4E5F;&#x4E0D;&#x80FD;&#x592A;&#x5C0F;&#x3002;&#x5982;&#x679C;$\alpha$&#x592A;&#x5927;&#xFF0C;&#x66F4;&#x65B0;&#x7684;&#x5E45;&#x5EA6;&#x592A;&#x5927;&#x6709;&#x53EF;&#x80FD;&#x4E00;&#x6B65;&#x201C;&#x8DE8;&#x8FC7;&#x201D;&#x6700;&#x5C0F;&#x503C;&#xFF0C;&#x53C8;&#x56E0;&#x4E3A;&#x201C;&#x8DE8;&#x8FC7;&#x201D;&#x6700;&#x5C0F;&#x503C;&#x540E;&#x68AF;&#x5EA6;&#x53D8;&#x5927;&#x5BFC;&#x81F4;&#x4E0B;&#x4E00;&#x6B65;&#x5F80;&#x56DE;&#x201C;&#x8DE8;&#x201D;&#x7684;&#x6B65;&#x5B50;&#x66F4;&#x5927;&#xFF0C;&#x6700;&#x540E;&#x5BFC;&#x81F4;&#x7ED3;&#x679C;&#x53D1;&#x6563;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#xFF1A;</p>
<img src="/articles/1/pic2.png" alt="&#x3B1;&#x8FC7;&#x5927;&#x7684;&#x60C5;&#x51B5;" title="&#x3B1;&#x8FC7;&#x5927;&#x7684;&#x60C5;&#x51B5;">
<p>&#x5982;&#x679C;$\alpha$&#x592A;&#x5C0F;&#xFF0C;&#x66F4;&#x65B0;&#x7684;&#x5E45;&#x5EA6;&#x5C31;&#x5F88;&#x5C0F;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x201C;&#x5C0F;&#x788E;&#x6B65;&#x4E0B;&#x5C71;&#x201D;&#xFF0C;&#x9700;&#x8981;&#x8FED;&#x4EE3;&#x5F88;&#x591A;&#x6B21;&#x624D;&#x80FD;&#x591F;&#x627E;&#x5230;&#x6700;&#x5C0F;&#x503C;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#xFF1A;</p>
<img src="/articles/1/pic3.png" alt="&#x3B1;&#x8FC7;&#x5C0F;&#x7684;&#x60C5;&#x51B5;" title="&#x3B1;&#x8FC7;&#x5C0F;&#x7684;&#x60C5;&#x51B5;">
<h5 id="4-&#x5B9E;&#x9645;&#x5E94;&#x7528;"><a href="#4-&#x5B9E;&#x9645;&#x5E94;&#x7528;" class="headerlink" title="(4)&#x5B9E;&#x9645;&#x5E94;&#x7528;"></a><big>(4)&#x5B9E;&#x9645;&#x5E94;&#x7528;</big></h5><p>&#x5C06;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x5E26;&#x5165;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7B97;&#x6CD5;&#x540E;&#x53EF;&#x63A8;&#x5230;&#x5F97;&#x5230;</p>
<script type="math/tex; mode=display">\theta_0 := \theta_0 - \alpha \frac{1}{m} \sum\limits_{i=1}^{m}(h_\theta(x^{(i)}) - y^{(i)})</script><script type="math/tex; mode=display">\theta_1 := \theta_1 - \alpha \frac{1}{m} \sum\limits_{i=1}^{m}(h_\theta(x^{(i)}) - y^{(i)})x^{(i)}</script><p>&#x5728;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x4E2D;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x4EE5;&#x67D0;&#x5BF9;$(\theta_0, theta_1)$&#x5F00;&#x59CB;&#xFF08;&#x6BD4;&#x5982;&#x8BF4;$(0, 0)$&#xFF09;&#xFF0C;&#x91CD;&#x590D;&#x4E0A;&#x9762;&#x7684;&#x4E24;&#x6761;&#x516C;&#x5F0F;&#x76F4;&#x5230;&#x6536;&#x655B;&#x5373;&#x53EF;&#x3002;&#x6CE8;&#x610F;$\theta_0$&#x548C;$\theta_1$&#x662F;&#x9700;&#x8981;&#x540C;&#x65F6;&#x66F4;&#x65B0;&#x7684;&#x3002;</p>
<h3 id="&#x591A;&#x7279;&#x5F81;&#x7684;&#x7EBF;&#x6027;&#x56DE;&#x5F52;"><a href="#&#x591A;&#x7279;&#x5F81;&#x7684;&#x7EBF;&#x6027;&#x56DE;&#x5F52;" class="headerlink" title="&#x591A;&#x7279;&#x5F81;&#x7684;&#x7EBF;&#x6027;&#x56DE;&#x5F52;"></a>&#x591A;&#x7279;&#x5F81;&#x7684;&#x7EBF;&#x6027;&#x56DE;&#x5F52;</h3><p>&#x7528;&#x524D;&#x9762;&#x7684;&#x5355;&#x7279;&#x5F81;&#x7684;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x80FD;&#x5728;&#x90A3;&#x4E2A;&#x795E;&#x5947;&#x7684;&#x4E16;&#x754C;&#x91CC;&#x6839;&#x636E;&#x623F;&#x5B50;&#x7684;&#x9762;&#x79EF;&#x9884;&#x6D4B;&#x623F;&#x4EF7;&#x4E86;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x662F;&#x51E1;&#x4EBA;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x4E16;&#x754C;&#x4E5F;&#x53EA;&#x662F;&#x4E2A;&#x666E;&#x901A;&#x7684;&#x4E16;&#x754C;&#xFF0C;&#x6240;&#x4EE5;&#x623F;&#x4EF7;&#x4E0D;&#x53EF;&#x80FD;&#x4EC5;&#x9760;&#x9762;&#x79EF;&#x6765;&#x51B3;&#x5B9A;&#xFF0C;&#x5426;&#x5219;&#x5317;&#x4EAC;&#x7684;&#x623F;&#x4EF7;&#x4E5F;&#x4E0D;&#x4F1A;&#x90A3;&#x4E48;&#x4E0D;&#x53CB;&#x597D;&#x4E86;&#xFF08;&#x9003;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x5F71;&#x54CD;&#x76EE;&#x6807;&#x53D8;&#x91CF;&#x7684;&#x7279;&#x5F81;&#x5F80;&#x5F80;&#x4E0D;&#x6B62;&#x4E00;&#x4E2A;&#x3002;&#x623F;&#x4EF7;&#x5F80;&#x5F80;&#x4E0E;&#x5176;&#x4ED6;&#x591A;&#x79CD;&#x56E0;&#x7D20;&#x6709;&#x5173;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x5C06;&#x524D;&#x9762;&#x5355;&#x4E00;&#x7279;&#x5F81;&#x7684;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x63A8;&#x5E7F;&#x5230;&#x591A;&#x7279;&#x5F81;&#x4E2D;&#x3002;</p>
<h4 id="&#x5047;&#x8BBE;&#x51FD;&#x6570;"><a href="#&#x5047;&#x8BBE;&#x51FD;&#x6570;" class="headerlink" title="&#x5047;&#x8BBE;&#x51FD;&#x6570;"></a>&#x5047;&#x8BBE;&#x51FD;&#x6570;</h4><p>&#x7531;&#x4E8E;&#x5F15;&#x5165;&#x4E86;&#x591A;&#x4E2A;&#x7279;&#x5F81;&#xFF0C;&#x6A21;&#x578B;&#x7684;&#x8868;&#x793A;&#x4EE5;&#x53CA;&#x76F8;&#x5E94;&#x7684;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x4E5F;&#x8981;&#x8FDB;&#x884C;&#x76F8;&#x5E94;&#x8C03;&#x6574;&#x3002;</p>
<h5 id="1-&#x6A21;&#x578B;&#x7684;&#x8868;&#x793A;"><a href="#1-&#x6A21;&#x578B;&#x7684;&#x8868;&#x793A;" class="headerlink" title="(1)&#x6A21;&#x578B;&#x7684;&#x8868;&#x793A;"></a><big>(1)&#x6A21;&#x578B;&#x7684;&#x8868;&#x793A;</big></h5><ul>
<li>$x^{(i)}$&#x8868;&#x793A;&#x8F93;&#x5165;&#x7684;&#x7B2C;$i$&#x4E2A;&#x8BAD;&#x7EC3;&#x6837;&#x672C;(&#x7279;&#x5F81;)&#x3002;</li>
<li>$x_j^{(i)}$&#x8868;&#x793A;&#x7B2C;$i$&#x4E2A;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#x4E2D;&#x7684;&#x7B2C;$j$&#x4E2A;&#x7279;&#x5F81;&#x3002;</li>
<li>$m$&#x8868;&#x793A;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#x6837;&#x672C;&#x7684;&#x6570;&#x91CF;&#x3002;</li>
<li>$n$&#x8868;&#x793A;&#x6BCF;&#x4E2A;&#x6837;&#x672C;&#x4E2D;&#x7279;&#x5F81;&#x7684;&#x6570;&#x91CF;&#x3002;</li>
</ul>
<p>&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x53D8;&#x4E3A;</p>
<script type="math/tex; mode=display">h_\theta(x) = \theta_0 + \theta_1x_1 + \theta_2x_2 + \cdots + \theta_nx_n</script><p>&#x4E3A;&#x4E86;&#x8868;&#x793A;&#x65B9;&#x4FBF;&#xFF0C;&#x4EE4;$x_0 = 1$&#xFF0C;&#x8FD9;&#x6837;&#xFF0C;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x5C31;&#x662F;</p>
<script type="math/tex; mode=display">h_\theta(x) = \theta_0x_0 + \theta_1x_1 + \theta_2x_2 + \cdots + \theta_nx_n</script><h5 id="2-&#x5411;&#x91CF;&#x5316;"><a href="#2-&#x5411;&#x91CF;&#x5316;" class="headerlink" title="(2)&#x5411;&#x91CF;&#x5316;"></a><big>(2)&#x5411;&#x91CF;&#x5316;</big></h5><p>&#x5728;&#x524D;&#x9762;&#x7684;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x6240;&#x6709;&#x7684;&#x8BA1;&#x7B97;&#x516C;&#x5F0F;&#x90FD;&#x662F;&#x5728;&#x5229;&#x7528;&#x8BAD;&#x7EC3;&#x96C6;&#x91CC;&#x7684;&#x6BCF;&#x4E00;&#x6761;&#x6570;&#x636E;&#x6765;&#x8FDB;&#x884C;&#x8BA1;&#x7B97;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x5F88;&#x81EA;&#x7136;&#x5730;&#x5C31;&#x60F3;&#x5230;&#x5229;&#x7528;&#x5FAA;&#x73AF;&#x6765;&#x8FDB;&#x884C;&#x6C42;&#x548C;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x76F8;&#x5173;&#x7684;&#x8BA1;&#x7B97;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x6709;&#x6CA1;&#x6709;&#x66F4;&#x52A0;&#x201C;&#x4F18;&#x96C5;&#x201D;&#x7684;&#x65B9;&#x5F0F;&#x5462;&#xFF1F;</p>
<p>&#x2026;&#x2026;&#x65E2;&#x7136;&#x8FD9;&#x4E48;&#x95EE;&#xFF0C;&#x90A3;&#x80AF;&#x5B9A;&#x5C31;&#x6709;&#x4E86;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x5C31;&#x5BF9;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x6A21;&#x578B;&#x8FDB;&#x884C;&#x5411;&#x91CF;&#x5316;&#xFF0C;&#x4F7F;&#x7528;&#x5411;&#x91CF;&#x548C;&#x77E9;&#x9635;&#x7684;&#x5F62;&#x5F0F;&#x201C;&#x4E00;&#x6B65;&#x201D;&#x5F97;&#x51FA;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x3002;&#x90A3;&#x8FD9;&#x4E48;&#x505A;&#x9664;&#x4E86;&#x201C;&#x4F18;&#x96C5;&#x201D;&#x8FD8;&#x6709;&#x4EC0;&#x4E48;&#x597D;&#x5904;&#x5462;&#xFF1F;&#x6700;&#x660E;&#x663E;&#x7684;&#x597D;&#x5904;&#x5C31;&#x662F;&#x5FEB;&#x3002;&#x867D;&#x7136;&#x4ECE;&#x6570;&#x5B66;&#x539F;&#x7406;&#x4E0A;&#x8BB2;&#x5176;&#x5B9E;&#x5411;&#x91CF;&#x548C;&#x77E9;&#x9635;&#x7684;&#x8FD0;&#x7B97;&#x4F3C;&#x4E4E;&#x548C;&#x7528;&#x5FAA;&#x73AF;&#x8DD1;&#x6CA1;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x7A0B;&#x5E8F;&#x7684;&#x5B9E;&#x73B0;&#x4E0A;&#xFF0C;&#x77E9;&#x9635;&#x7684;&#x8FD0;&#x7B97;&#x662F;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x5F88;&#x591A;&#x4F18;&#x5316;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5355;&#x7EAF;&#x5730;&#x7528;CPU&#x8DD1;&#x901F;&#x5EA6;&#x4E0A;&#x5C31;&#x4F1A;&#x6BD4;&#x5FAA;&#x73AF;&#x5FEB;&#x975E;&#x5E38;&#x591A;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x77E9;&#x9635;&#x8FD0;&#x7B97;&#x76F8;&#x5BF9;&#x4E8E;&#x4F7F;&#x7528;&#x5FAA;&#x73AF;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x4F18;&#x52BF;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x7528;GPU&#x8DD1;&#xFF0C;GPU&#x975E;&#x5E38;&#x9002;&#x5408;&#x77E9;&#x9635;&#x8FD0;&#x7B97;&#x8FD9;&#x7C7B;&#x7684;&#x5927;&#x89C4;&#x6A21;&#x5E76;&#x884C;&#x8BA1;&#x7B97;&#xFF0C;&#x56E0;&#x6B64;&#x4F1A;&#x5F97;&#x5230;&#x8FDB;&#x4E00;&#x6B65;&#x7684;&#x52A0;&#x901F;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x4E5F;&#x770B;&#x5230;&#x4E86;&#x6838;&#x5F39;&#x5382;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x8F6C;&#x578B;&#x505A;AI&#x516C;&#x53F8;&#x4E86;&#x2026;&#x2026;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x4EE5;&#x5411;&#x91CF;&#x7684;&#x5F62;&#x5F0F;&#x8868;&#x793A;&#x7279;&#x5F81;&#xFF0C;&#x5C31;&#x5F97;&#x5230;&#x4E86;&#x4E00;&#x4E2A;$n + 1$&#x7EF4;&#x7279;&#x5F81;&#x5411;&#x91CF;</p>
<script type="math/tex; mode=display">x = \begin{bmatrix}x_0 \newline x_1 \newline \vdots \newline x_n\end{bmatrix}</script><p>&#x800C;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x4E2D;&#x7684;$\theta$&#x540C;&#x6837;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x5411;&#x91CF;&#x6765;&#x8868;&#x793A;</p>
<script type="math/tex; mode=display">\theta = \begin{bmatrix}\theta_0 \newline \theta_1 \newline \vdots \newline \theta_n\end{bmatrix}</script><p>&#x6B64;&#x65F6;&#xFF0C;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x5C31;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x4E3A;</p>
<script type="math/tex; mode=display">\begin{align*}h_\theta(x) =\begin{bmatrix}\theta_0 \hspace{2em} \theta_1 \hspace{2em} \cdots \hspace{2em} \theta_n\end{bmatrix}\begin{bmatrix}x_0 \newline x_1 \newline \vdots \newline x_n\end{bmatrix}= \theta^T x\end{align*}</script><p>&#x6709;&#x4E86;&#x4E0A;&#x9762;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x90A3;&#x4E48;&#x8003;&#x8651;&#x5230;&#x77E9;&#x9635;&#x4E58;&#x6CD5;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x77E9;&#x9635;&#x7684;&#x4E58;&#x6CD5;&#x6765;&#x4E00;&#x6B65;&#x5F97;&#x51FA;&#x6240;&#x6709;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x505A;&#x5230;&#x4E00;&#x6B65;&#x51FA;&#x7ED3;&#x679C;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x8981;&#x5411;&#x91CF;&#x5316;&#x6211;&#x4EEC;&#x7684;&#x6574;&#x4E2A;&#x7279;&#x5F81;&#x96C6;&#xFF1A;</p>
<script type="math/tex; mode=display">X = \begin{bmatrix} (x^{(1)})^T \newline (x^{(2)})^T \newline \vdots \newline (x^{(m)})^T \newline \end{bmatrix}</script><p>&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#xFF0C;&#x8FD9;&#x4E2A;&#x77E9;&#x9635;&#x7684;&#x6BCF;&#x4E00;&#x884C;&#x90FD;&#x662F;&#x524D;&#x9762;&#x6240;&#x8868;&#x793A;&#x7684;&#x7279;&#x5F81;&#x5411;&#x91CF;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x8FD9;&#x91CC;&#x53D8;&#x6210;&#x4E86;&#x884C;&#x5411;&#x91CF;&#x3002;&#x77E9;&#x9635;&#x7684;&#x6BCF;&#x4E00;&#x5217;&#x4EE3;&#x8868;&#x4E86;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x7279;&#x5F81;&#x3002;</p>
<p>&#x4EE4;&#x5411;&#x91CF;&#x5316;&#x540E;&#x7684;&#x7ED3;&#x679C;&#x4E3A;</p>
<script type="math/tex; mode=display">y = \begin{bmatrix} y^{(1)} \newline y^{(2)} \newline \vdots \newline y^{(m)} \newline \end{bmatrix}</script><p>&#x5219;&#x6709;</p>
<script type="math/tex; mode=display">y = X\theta</script><p>&#x8FD9;&#x6837;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x77E9;&#x9635;&#x8FD0;&#x7B97;&#x6765;&#x4E00;&#x6B65;&#x5F97;&#x51FA;&#x6240;&#x6709;&#x6837;&#x672C;&#x8F93;&#x5165;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x6240;&#x8F93;&#x51FA;&#x7684;&#x9884;&#x6D4B;&#x503C;&#x4E86;&#x3002;&#x800C;&#x8F93;&#x51FA;&#x7684;&#x9884;&#x6D4B;&#x503C;&#x5BF9;&#x5E94;&#x7684;&#x5411;&#x91CF;&#xFF0C;&#x540C;&#x6837;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5411;&#x91CF;&#x5316;&#x540E;&#x7684;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x6765;&#x4E00;&#x6B65;&#x5F97;&#x5230;&#x76F8;&#x5E94;&#x7684;&#x4EE3;&#x4EF7;&#x3002;</p>
<h4 id="&#x4EE3;&#x4EF7;&#x51FD;&#x6570;"><a href="#&#x4EE3;&#x4EF7;&#x51FD;&#x6570;" class="headerlink" title="&#x4EE3;&#x4EF7;&#x51FD;&#x6570;"></a>&#x4EE3;&#x4EF7;&#x51FD;&#x6570;</h4><p>&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x5176;&#x5B9E;&#x6CA1;&#x4EC0;&#x4E48;&#x53D8;&#x5316;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;$\theta$&#x548C;$x$&#x53D8;&#x6210;&#x4E86;&#x5411;&#x91CF;</p>
<script type="math/tex; mode=display">J(\theta_0, \theta_1, \cdots, \theta_n) = \dfrac {1}{2m} \displaystyle \sum _{i=1}^m \left (h_\theta (x^{(i)}) - y^{(i)} \right)^2</script><h4 id="&#x68AF;&#x5EA6;&#x4E0B;&#x964D;"><a href="#&#x68AF;&#x5EA6;&#x4E0B;&#x964D;" class="headerlink" title="&#x68AF;&#x5EA6;&#x4E0B;&#x964D;"></a>&#x68AF;&#x5EA6;&#x4E0B;&#x964D;</h4><p>&#x5BF9;&#x4E8E;&#x591A;&#x7279;&#x5F81;&#x91CF;&#x7684;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#xFF0C;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x4E5F;&#x4E0E;&#x5355;&#x4E00;&#x7279;&#x5F81;&#x7684;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7C7B;&#x4F3C;&#xFF0C;&#x6301;&#x7EED;&#x540C;&#x6B65;&#x66F4;&#x65B0;&#x6240;&#x6709;&#x7684;$\theta$&#x503C;&#x5373;&#x53EF;&#x3002;</p>
<script type="math/tex; mode=display">\begin{align*} & \theta_0 := \theta_0 - \alpha \frac{1}{m} \sum\limits_{i=1}^{m} (h_\theta(x^{(i)}) - y^{(i)}) \cdot x_0^{(i)}\newline \; & \theta_1 := \theta_1 - \alpha \frac{1}{m} \sum\limits_{i=1}^{m} (h_\theta(x^{(i)}) - y^{(i)}) \cdot x_1^{(i)} \newline \; & \theta_2 := \theta_2 - \alpha \frac{1}{m} \sum\limits_{i=1}^{m} (h_\theta(x^{(i)}) - y^{(i)}) \cdot x_2^{(i)} \newline & \cdots \newline & \theta_n := \theta_n - \alpha \frac{1}{m} \sum\limits_{i=1}^{m} (h_\theta(x^{(i)}) - y^{(i)}) \cdot x_n^{(i)} \end{align*}</script><p>&#x7B80;&#x800C;&#x8A00;&#x4E4B;</p>
<script type="math/tex; mode=display">\begin{align*}& \theta_j := \theta_j - \alpha \frac{1}{m} \sum\limits_{i=1}^{m} (h_\theta(x^{(i)}) - y^{(i)}) \cdot x_j^{(i)} \; & \text{for j := 0...n}\end{align*}</script><p>&#x663E;&#x800C;&#x6613;&#x89C1;&#x5730;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E5F;&#x53EF;&#x4EE5;&#x5411;&#x91CF;&#x5316;&#xFF1A;</p>
<script type="math/tex; mode=display">\theta := \theta - \alpha \frac{1}{m} X^T (X\theta - y)</script><h4 id="&#x7279;&#x5F81;&#x7F29;&#x653E;&#xFF08;Feature-Scaling&#xFF09;"><a href="#&#x7279;&#x5F81;&#x7F29;&#x653E;&#xFF08;Feature-Scaling&#xFF09;" class="headerlink" title="&#x7279;&#x5F81;&#x7F29;&#x653E;&#xFF08;Feature Scaling&#xFF09;"></a>&#x7279;&#x5F81;&#x7F29;&#x653E;&#xFF08;Feature Scaling&#xFF09;</h4><p>&#x5BF9;&#x4E8E;&#x591A;&#x7279;&#x5F81;&#x91CF;&#x7684;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x7279;&#x5F81;&#x4E4B;&#x95F4;&#x53EF;&#x80FD;&#x76F8;&#x5DEE;&#x5341;&#x5206;&#x60AC;&#x6B8A;&#x3002;&#x6BD4;&#x5982;&#x4E00;&#x4E2A;&#x7279;&#x5F81;&#x53D6;&#x503C;&#x7684;&#x533A;&#x95F4;&#x5728;$[-1, 1]$&#xFF0C;&#x800C;&#x53E6;&#x4E00;&#x4E2A;&#x4E3A;$[-1000, 2000]$&#xFF0C;&#x6B64;&#x65F6;&#xFF0C;&#x5BF9;&#x4E8E;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x6765;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x7528;&#x7C7B;&#x4F3C;&#x7B49;&#x9AD8;&#x7EBF;&#x7684;&#x753B;&#x6CD5;&#x6765;&#x753B;&#x4E00;&#x4E0B;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x503C;&#x7684;&#x5206;&#x5E03;&#x60C5;&#x51B5;&#xFF0C;&#x4F1A;&#x53D1;&#x73B0;&#x8FD9;&#x4E9B;&#x201C;&#x7B49;&#x9AD8;&#x7EBF;&#x201D;&#xFF0C;&#x5373;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x53D6;&#x503C;&#x76F8;&#x540C;&#x7684;&#x70B9;&#x6240;&#x7EC4;&#x6210;&#x7684;&#x5F62;&#x72B6;&#x4F1A;&#x7C7B;&#x4F3C;&#x4E00;&#x4E2A;&#x5F88;&#x6241;&#x7684;&#x692D;&#x5706;&#xFF1A;</p>
<img src="/articles/1/pic4.png" alt="&#x7279;&#x5F81;&#x7F29;&#x653E;&#x5FC5;&#x8981;&#x6027;&#x7684;&#x4F8B;&#x5B50;" title="&#x7279;&#x5F81;&#x7F29;&#x653E;&#x5FC5;&#x8981;&#x6027;&#x7684;&#x4F8B;&#x5B50;">
<p>&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x5B66;&#x4E60;&#x901F;&#x7387;&#x662F;&#x76F8;&#x540C;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6BCF;&#x4E2A;&#x65B9;&#x5411;&#x6BCF;&#x6B65;&#x79FB;&#x52A8;&#x7684;&#x8DDD;&#x79BB;&#x662F;&#x76F8;&#x540C;&#x7684;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5728;&#x8FDB;&#x884C;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x65F6;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x5728;&#x201C;&#x8F83;&#x6241;&#x201D;&#x7684;&#x65B9;&#x5411;&#x4E0A;&#x6765;&#x56DE;&#x6446;&#x52A8;&#xFF0C;&#x6216;&#x8005;&#x5728;&#x201C;&#x8F83;&#x957F;&#x201D;&#x7684;&#x65B9;&#x5411;&#x4E0A;&#x4E0B;&#x964D;&#x901F;&#x5EA6;&#x8FC7;&#x6162;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x53EF;&#x4EE5;&#x5BF9;&#x53D8;&#x91CF;&#x7684;&#x7279;&#x5F81;&#x8FDB;&#x884C;&#x6536;&#x7F29;&#xFF0C;&#x4F7F;&#x4E4B;&#x53D8;&#x6210;&#x4E00;&#x4E2A;&#x201C;&#x5706;&#x201D;&#xFF0C;&#x8FD9;&#x6837;&#x8FDB;&#x884C;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x65F6;&#x5728;&#x5404;&#x4E2A;&#x65B9;&#x5411;&#x4E0A;&#x90FD;&#x80FD;&#x6BD4;&#x8F83;&#x597D;&#x5730;&#x6536;&#x655B;&#x3002;</p>
<p>&#x8FDB;&#x884C;&#x7279;&#x5F81;&#x7F29;&#x653E;&#x6700;&#x7B80;&#x5355;&#x7684;&#x529E;&#x6CD5;&#x5C31;&#x662F;&#x4F7F;</p>
<script type="math/tex; mode=display">x_i := \dfrac{x_i - \mu_i}{s_i}</script><p>&#x5BF9;$x_i$&#x8FDB;&#x884C;&#x8C03;&#x6574;&#xFF0C;&#x5C06;&#x5176;&#x7F29;&#x653E;&#x5230;&#x6EE1;&#x8DB3;$-1 \leq x_i \leq 1$&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x4E00;&#x5B9A;&#x5927;&#x4E8E;&#x6216;&#x8005;&#x5C0F;&#x4E8E;1&#xFF0C;&#x53EA;&#x8981;&#x662F;&#x76F8;&#x5BF9;&#x5408;&#x7406;&#x7684;&#x8303;&#x56F4;&#x5373;&#x53EF;&#x3002;</p>
<p>&#x901A;&#x5E38;&#xFF0C;$\mu_i$&#x662F;&#x6240;&#x6709;$x_i$&#x7684;&#x5E73;&#x5747;&#x6570;&#xFF0C;$s_i$&#x662F;&#x6240;&#x6709;$x_i$&#x7684;&#x6807;&#x51C6;&#x5DEE;&#xFF0C;&#x6216;&#x8005;&#x6700;&#x5927;&#x503C;&#x51CF;&#x53BB;&#x6700;&#x5C0F;&#x503C;&#x4E5F;&#x53EF;&#x4EE5;&#x3002;</p>
<h4 id="&#x7279;&#x5F81;&#x4E0E;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x7684;&#x9009;&#x62E9;"><a href="#&#x7279;&#x5F81;&#x4E0E;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x7684;&#x9009;&#x62E9;" class="headerlink" title="&#x7279;&#x5F81;&#x4E0E;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x7684;&#x9009;&#x62E9;"></a>&#x7279;&#x5F81;&#x4E0E;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x7684;&#x9009;&#x62E9;</h4><p>&#x5728;&#x9009;&#x62E9;&#x7279;&#x5F81;&#x4E0E;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x6709;&#x5982;&#x4E0B;&#x4E24;&#x4E2A;&#x6280;&#x5DE7;&#x3002;</p>
<h5 id="1-&#x901A;&#x8FC7;&#x5B9A;&#x4E49;&#x65B0;&#x7684;&#x7279;&#x5F81;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x5F97;&#x5230;&#x66F4;&#x597D;&#x7684;&#x6A21;&#x578B;"><a href="#1-&#x901A;&#x8FC7;&#x5B9A;&#x4E49;&#x65B0;&#x7684;&#x7279;&#x5F81;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x5F97;&#x5230;&#x66F4;&#x597D;&#x7684;&#x6A21;&#x578B;" class="headerlink" title="(1)&#x901A;&#x8FC7;&#x5B9A;&#x4E49;&#x65B0;&#x7684;&#x7279;&#x5F81;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x5F97;&#x5230;&#x66F4;&#x597D;&#x7684;&#x6A21;&#x578B;"></a><big>(1)&#x901A;&#x8FC7;&#x5B9A;&#x4E49;&#x65B0;&#x7684;&#x7279;&#x5F81;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x5F97;&#x5230;&#x66F4;&#x597D;&#x7684;&#x6A21;&#x578B;</big></h5><p>&#x6B63;&#x5982;&#x9884;&#x6D4B;&#x623F;&#x4EF7;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x4E00;&#x4E2A;&#x9884;&#x6D4B;&#x7684;&#x578B;&#x5F80;&#x5F80;&#x4E0E;&#x5F88;&#x591A;&#x56E0;&#x7D20;&#x76F8;&#x5173;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x6DFB;&#x52A0;&#x4E00;&#x4E9B;&#x65B0;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x5F97;&#x5230;&#x66F4;&#x597D;&#x7684;&#x6A21;&#x578B;&#x3002;</p>
<h5 id="2-&#x591A;&#x9879;&#x5F0F;&#x5047;&#x8BBE;&#x51FD;&#x6570;"><a href="#2-&#x591A;&#x9879;&#x5F0F;&#x5047;&#x8BBE;&#x51FD;&#x6570;" class="headerlink" title="(2)&#x591A;&#x9879;&#x5F0F;&#x5047;&#x8BBE;&#x51FD;&#x6570;"></a><big>(2)&#x591A;&#x9879;&#x5F0F;&#x5047;&#x8BBE;&#x51FD;&#x6570;</big></h5><p>&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x4E4B;&#x6240;&#x4EE5;&#x662F;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#xFF0C;&#x5C31;&#x662F;&#x56E0;&#x4E3A;&#x5176;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x6570;&#x662F;&#x7EBF;&#x6027;&#x7684;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x7528;&#x76F4;&#x7EBF;&#x3001;&#x5E73;&#x9762;&#x3001;&#x6216;&#x8005;&#x8D85;&#x5E73;&#x9762;&#x6765;&#x62DF;&#x5408;&#x90A3;&#x4E9B;&#x6570;&#x636E;&#x6240;&#x5BF9;&#x5E94;&#x7684;&#x70B9;&#x7684;&#x3002;&#x4F46;&#x662F;&#x663E;&#x7136;&#xFF0C;&#x5728;&#x66F4;&#x591A;&#x7684;&#x60C5;&#x51B5;&#x4E2D;&#xFF0C;&#x7EBF;&#x6027;&#x7684;&#x51FD;&#x6570;&#x5F80;&#x5F80;&#x4E0D;&#x80FD;&#x5F88;&#x597D;&#x5730;&#x62DF;&#x5408;&#x6570;&#x636E;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x53EF;&#x80FD;&#x5F80;&#x5F80;&#x662F;&#x975E;&#x7EBF;&#x6027;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x6BD4;&#x5982;&#x4E8C;&#x6B21;&#x51FD;&#x6570;&#x3001;&#x4E09;&#x6B21;&#x51FD;&#x6570;&#x8FD9;&#x6837;&#x7684;&#x66F2;&#x7EBF;&#x6216;&#x8005;&#x66F4;&#x9AD8;&#x7EF4;&#x7684;&#x66F2;&#x9762;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x591A;&#x9879;&#x5F0F;&#x7684;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#xFF08;&#x4E8C;&#x6B21;&#x51FD;&#x6570;&#x3001;&#x4E09;&#x6B21;&#x51FD;&#x6570;&#x2026;&#x2026;&#xFF09;&#x3002;&#x90A3;&#x591A;&#x9879;&#x5F0F;&#x7684;&#x975E;&#x7EBF;&#x6027;&#x7684;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x600E;&#x4E48;&#x7528;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x5462;&#xFF0C;&#x90A3;&#x5C31;&#x60F3;&#x529E;&#x6CD5;&#x5F80;&#x7EBF;&#x6027;&#x51FD;&#x6570;&#x4E0A;&#x9760;&#x3002;&#x65B9;&#x6CD5;&#x4E5F;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x56DE;&#x5F52;&#x7684;&#x65B9;&#x6CD5;&#x4E0D;&#x597D;&#x6539;&#xFF0C;&#x90A3;&#x5C31;&#x6539;&#x7279;&#x5F81;&#x96C6;&#x561B;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x5C06;&#x591A;&#x6B21;&#x7684;&#x9879;&#x5B9A;&#x4E49;&#x4E3A;&#x65B0;&#x7684;&#x7279;&#x5F81;&#x5373;&#x53EF;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x6211;&#x4EEC;&#x60F3;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x5047;&#x8BBE;&#x51FD;&#x6570;$y = \theta_0 + \theta_1x + \theta_2x^2$&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x4EE4;$x_1 = x, x_2 = x^2$&#xFF0C;&#x800C;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x4E5F;&#x5C31;&#x53D8;&#x6210;&#x4E86;&#x7EBF;&#x6027;&#x51FD;&#x6570;$y = \theta_0 + \theta_1x_1 + \theta_2x_2$&#x4E86;&#x3002;</p>
<h3 id="&#x6B63;&#x89C4;&#x65B9;&#x7A0B;&#xFF08;Normal-Equation&#xFF09;"><a href="#&#x6B63;&#x89C4;&#x65B9;&#x7A0B;&#xFF08;Normal-Equation&#xFF09;" class="headerlink" title="&#x6B63;&#x89C4;&#x65B9;&#x7A0B;&#xFF08;Normal Equation&#xFF09;"></a>&#x6B63;&#x89C4;&#x65B9;&#x7A0B;&#xFF08;Normal Equation&#xFF09;</h3><p>&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x6700;&#x5C0F;&#x4E8C;&#x4E58;&#x6CD5;&#x7684;&#x8FD0;&#x7528;&#xFF0C;&#x4E00;&#x8A00;&#x4EE5;&#x853D;&#x4E4B;&#xFF0C;&#x5411;&#x91CF;&#x5316;&#x7279;&#x5F81;&#x53D8;&#x91CF;&#x548C;&#x76EE;&#x6807;&#x53D8;&#x91CF;&#x540E;&#x5F97;&#x5230;&#x77E9;&#x9635;X&#x548C;&#x5411;&#x91CF;y&#xFF0C;&#x5219;&#x53C2;&#x6570;&#x4E3A;</p>
<script type="math/tex; mode=display">\theta = (X^T X)^{-1}X^T y</script><p>&#x4F7F;&#x7528;&#x6B63;&#x89C4;&#x65B9;&#x7A0B;&#x65E0;&#x9700;&#x8FED;&#x4EE3;&#xFF0C;&#x4E00;&#x6B65;&#x5373;&#x53EF;&#x5F97;&#x51FA;&#x7ED3;&#x679C;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x53EA;&#x9002;&#x7528;&#x4E8E;&#x8BAD;&#x7EC3;&#x96C6;&#x8F83;&#x5C0F;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x56E0;&#x4E3A;&#x5F53;&#x8BAD;&#x7EC3;&#x96C6;&#x8F83;&#x5927;&#x65F6;&#xFF0C;&#x77E9;&#x9635;&#x7684;&#x8BA1;&#x7B97;&#x91CF;&#x662F;&#x76F8;&#x5F53;&#x5927;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x5BF9;&#x4E8E;&#x8F83;&#x5927;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x8FD8;&#x662F;&#x6BD4;&#x8F83;&#x9002;&#x5408;&#x4F7F;&#x7528;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7684;&#x3002;</p>
<p><br></p>
<h2 id="&#x903B;&#x8F91;&#x56DE;&#x5F52;"><a href="#&#x903B;&#x8F91;&#x56DE;&#x5F52;" class="headerlink" title="&#x903B;&#x8F91;&#x56DE;&#x5F52;"></a>&#x903B;&#x8F91;&#x56DE;&#x5F52;</h2><p>&#x5728;&#x524D;&#x4E09;&#x5468;&#x7684;&#x8BFE;&#x7A0B;&#x4E2D;&#xFF0C;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x662F;&#x8D2F;&#x7A7F;&#x59CB;&#x7EC8;&#x7684;&#xFF0C;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x5176;&#x5B9E;&#x4E5F;&#x662F;&#x4ECE;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x800C;&#x6765;&#xFF0C;&#x57FA;&#x672C;&#x65B9;&#x6CD5;&#x5176;&#x5B9E;&#x662F;&#x4E00;&#x81F4;&#x7684;&#xFF0C;&#x90FD;&#x6D89;&#x53CA;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x3001;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x4EE5;&#x53CA;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x4E09;&#x90E8;&#x5206;&#x3002;&#x4E0E;&#x4E4B;&#x524D;&#x4ECB;&#x7ECD;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x7684;&#x5957;&#x8DEF;&#x76F8;&#x540C;&#xFF0C;&#x8FD9;&#x91CC;&#x4E5F;&#x662F;&#x5148;&#x4ECE;&#x4E24;&#x4E2A;&#x7C7B;&#x7684;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#x5F00;&#x59CB;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x63A8;&#x5E7F;&#x5230;&#x591A;&#x7C7B;&#x4E4B;&#x4E2D;&#x3002;</p>
<h3 id="&#x5206;&#x7C7B;&#x95EE;&#x9898;&#x7684;&#x7279;&#x70B9;"><a href="#&#x5206;&#x7C7B;&#x95EE;&#x9898;&#x7684;&#x7279;&#x70B9;" class="headerlink" title="&#x5206;&#x7C7B;&#x95EE;&#x9898;&#x7684;&#x7279;&#x70B9;"></a>&#x5206;&#x7C7B;&#x95EE;&#x9898;&#x7684;&#x7279;&#x70B9;</h3><p>&#x5BF9;&#x4E8E;&#x4E24;&#x4E2A;&#x7C7B;&#x7684;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#x6765;&#x8BF4;&#xFF1A;</p>
<ul>
<li>$y = 0 \quad or \quad 1$</li>
</ul>
<p>&#x5728;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x4E2D;&#xFF0C;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x6240;&#x8F93;&#x51FA;&#x7684;&#x5C31;&#x662F;&#x7ED3;&#x679C;&#xFF0C;&#x800C;&#x5728;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x4E2D;&#xFF0C;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x6240;&#x8F93;&#x51FA;&#x7684;&#x5219;&#x662F;&#x5C5E;&#x4E8E;&#x6BCF;&#x4E2A;&#x7C7B;&#x7684;&#x6982;&#x7387;&#xFF0C;&#x6240;&#x4EE5;&#xFF1A;</p>
<ul>
<li>$0 \leq h(\theta) \leq 1$</li>
</ul>
<h3 id="&#x5047;&#x8BBE;&#x51FD;&#x6570;-1"><a href="#&#x5047;&#x8BBE;&#x51FD;&#x6570;-1" class="headerlink" title="&#x5047;&#x8BBE;&#x51FD;&#x6570;"></a>&#x5047;&#x8BBE;&#x51FD;&#x6570;</h3><p>&#x8FD9;&#x91CC;&#x4F7F;&#x7528;&#x4E86;&#x5728;&#x5404;&#x4E2A;&#x9886;&#x57DF;&#x90FD;&#x88AB;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x7684;S&#x5F62;&#x66F2;&#x7EBF;&#x6765;&#x5BF9;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x591A;&#x8FDB;&#x884C;&#x4E86;&#x4E00;&#x6B65;&#x5904;&#x7406;&#x3002;</p>
<h4 id="&#x65B0;&#x7684;&#x5047;&#x8BBE;&#x51FD;&#x6570;"><a href="#&#x65B0;&#x7684;&#x5047;&#x8BBE;&#x51FD;&#x6570;" class="headerlink" title="&#x65B0;&#x7684;&#x5047;&#x8BBE;&#x51FD;&#x6570;"></a>&#x65B0;&#x7684;&#x5047;&#x8BBE;&#x51FD;&#x6570;</h4><script type="math/tex; mode=display">\begin{align*}& h_\theta (x) = g ( \theta^T x ) \newline \newline& z = \theta^T x \newline& g(z) = \dfrac{1}{1 + e^{-z}}\end{align*}</script><p>&#x4E5F;&#x5C31;&#x662F;</p>
<script type="math/tex; mode=display">h_\theta (x) = \dfrac{1}{1 + e^{\theta^Tx}}</script><p>&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x6240;&#x7B97;&#x5F97;&#x7684;&#x7ED3;&#x679C;&#x5176;&#x5B9E;&#x662F;$y = 1$&#x7684;&#x6982;&#x7387;&#x3002;&#x4F8B;&#x5982;$h_\theta(x)=0.7$&#xFF0C;&#x5219;&#x8BF4;&#x660E;$y=1$&#x7684;&#x6982;&#x7387;&#x4E3A;$70\%$&#x3002;</p>
<h4 id="&#x51B3;&#x7B56;&#x8FB9;&#x754C;&#xFF08;Decision-Boundary&#xFF09;"><a href="#&#x51B3;&#x7B56;&#x8FB9;&#x754C;&#xFF08;Decision-Boundary&#xFF09;" class="headerlink" title="&#x51B3;&#x7B56;&#x8FB9;&#x754C;&#xFF08;Decision Boundary&#xFF09;"></a>&#x51B3;&#x7B56;&#x8FB9;&#x754C;&#xFF08;Decision Boundary&#xFF09;</h4><p>&#x5982;&#x679C;&#xFF0C;&#x4EE4;</p>
<script type="math/tex; mode=display">\begin{align*}& h_\theta(x) \geq 0.5 \rightarrow y = 1 \newline& h_\theta(x) < 0.5 \rightarrow y = 0 \newline\end{align*}</script><p>&#x901A;&#x8FC7;&#x5BF9;S&#x5F62;&#x51FD;&#x6570;&#x7B80;&#x5355;&#x89C2;&#x5BDF;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#xFF0C;&#x5F53;$\theta^{T}x \ge 0$&#x7684;&#x65F6;&#x5019;&#xFF0C;$h_\theta (x) \ge 0$&#xFF0C;&#x53CD;&#x4E4B;&#x4EA6;&#x7136;&#x3002;</p>
<p>&#x5F53;&#x4F7F;&#x7528;S&#x5F62;&#x51FD;&#x6570;&#x7684;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x901A;&#x8FC7;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#xFF0C;&#x6700;&#x540E;&#x5F97;&#x5230;&#x7684;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x4E2D;&#x7684;$\theta^T x$&#x4F1A;&#x662F;&#x5C06;&#x4E24;&#x7C7B;&#x6837;&#x672C;&#x5206;&#x5F00;&#x7684;&#x4E00;&#x4E2A;&#x754C;&#x9762;&#x3002;&#x5728;&#x4E8C;&#x7EF4;&#x5E73;&#x9762;&#x4E2D;&#xFF0C;$\theta^T x$&#x4F1A;&#x662F;&#x4E00;&#x6761;&#x5C06;&#x4E24;&#x7C7B;&#x6837;&#x672C;&#x70B9;&#x5927;&#x81F4;&#x5206;&#x5F00;&#x7684;&#x7EBF;&#xFF08;&#x76F4;&#x7EBF;&#x6216;&#x66F2;&#x7EBF;&#xFF0C;&#x53D6;&#x51B3;&#x4E8E;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x7684;&#x6A21;&#x578B;&#xFF09;&#x3002;&#x8FD9;&#x6761;&#x7EBF;&#x6216;&#x8005;&#x591A;&#x7EF4;&#x4E2D;&#x7684;&#x754C;&#x9762;&#x88AB;&#x79F0;&#x4F5C;&#x51B3;&#x7B56;&#x8FB9;&#x754C;&#xFF0C;&#x6216;&#x8005;&#x5224;&#x522B;&#x754C;&#x9762;&#x3002;</p>
<h3 id="&#x4EE3;&#x4EF7;&#x51FD;&#x6570;-1"><a href="#&#x4EE3;&#x4EF7;&#x51FD;&#x6570;-1" class="headerlink" title="&#x4EE3;&#x4EF7;&#x51FD;&#x6570;"></a>&#x4EE3;&#x4EF7;&#x51FD;&#x6570;</h3><p>&#x7531;&#x4E8E;&#x76EE;&#x6807;&#x53D8;&#x91CF;&#x662F;&#x79BB;&#x6563;&#x503C;&#xFF0C;&#x56E0;&#x6B64;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x4E2D;&#x7684;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x5DF2;&#x4E0D;&#x9002;&#x7528;&#x4E8E;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x3002;</p>
<p>&#x5728;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;&#x6837;&#x672C;&#x4EE3;&#x4EF7;&#x4E3A;</p>
<script type="math/tex; mode=display">\begin{align*}& J(\theta) = \dfrac{1}{m} \sum_{i=1}^m \mathrm{Cost}(h_\theta(x^{(i)}),y^{(i)}) \newline & \mathrm{Cost}(h_\theta(x),y) = -\log(h_\theta(x)) \; & \text{if y = 1} \newline & \mathrm{Cost}(h_\theta(x),y) = -\log(1-h_\theta(x)) \; & \text{if y = 0}\end{align*}</script><p>&#x5316;&#x7B80;&#x540E;&#x53EF;&#x5F97;</p>
<script type="math/tex; mode=display">\mathrm{Cost}(h_\theta(x),y) = - y \; \log(h_\theta(x)) - (1 - y) \log(1 - h_\theta(x))</script><p>&#x56E0;&#x6B64;&#xFF0C;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x4E3A;</p>
<script type="math/tex; mode=display">J(\theta) = - \frac{1}{m} \displaystyle \sum_{i=1}^m [y^{(i)}\log (h_\theta (x^{(i)})) + (1 - y^{(i)})\log (1 - h_\theta(x^{(i)}))]</script><p>&#x5411;&#x91CF;&#x5316;&#x540E;&#x7684;&#x7248;&#x672C;&#x4E3A;</p>
<script type="math/tex; mode=display">\begin{align*} & h = g(X\theta)\newline & J(\theta) = \frac{1}{m} \cdot \left(-y^{T}\log(h)-(1-y)^{T}\log(1-h)\right) \end{align*}</script><p>&#x6CE8;&#x610F;&#x8FD9;&#x91CC;&#x7684;$g(X\theta)$&#x662F;&#x5BF9;$\theta$&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x8FDB;&#x884C;&#x8FD0;&#x7B97;&#x540E;&#x5F97;&#x5230;&#x7684;&#x5411;&#x91CF;&#xFF0C;$log(h)$&#x4E5F;&#x662F;&#x4E00;&#x6837;&#x7684;&#x9053;&#x7406;&#x3002;</p>
<h3 id="&#x68AF;&#x5EA6;&#x4E0B;&#x964D;-1"><a href="#&#x68AF;&#x5EA6;&#x4E0B;&#x964D;-1" class="headerlink" title="&#x68AF;&#x5EA6;&#x4E0B;&#x964D;"></a>&#x68AF;&#x5EA6;&#x4E0B;&#x964D;</h3><p>&#x6574;&#x4F53;&#x7684;&#x65B9;&#x6CD5;&#x8FD8;&#x662F;&#x91CD;&#x590D;</p>
<script type="math/tex; mode=display">\theta_j := \theta_j - \alpha \dfrac{\partial}{\partial \theta_j}J(\theta)</script><p>&#x5E26;&#x5165;&#x65B0;&#x7684;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x540E;&#x5F97;&#x5230;</p>
<script type="math/tex; mode=display">\theta_j := \theta_j - \frac{\alpha}{m} \sum_{i=1}^m (h_\theta(x^{(i)}) - y^{(i)}) x_j^{(i)}</script><p>&#x5411;&#x91CF;&#x5316;&#x540E;&#x7684;&#x7248;&#x672C;&#x4E3A;</p>
<script type="math/tex; mode=display">\theta := \theta - \frac{\alpha}{m} X^{T} (g(X \theta ) - y)</script><h3 id="&#x6700;&#x5C0F;&#x5316;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x7684;&#x5176;&#x4ED6;&#x65B9;&#x6CD5;"><a href="#&#x6700;&#x5C0F;&#x5316;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x7684;&#x5176;&#x4ED6;&#x65B9;&#x6CD5;" class="headerlink" title="&#x6700;&#x5C0F;&#x5316;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x7684;&#x5176;&#x4ED6;&#x65B9;&#x6CD5;"></a>&#x6700;&#x5C0F;&#x5316;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x7684;&#x5176;&#x4ED6;&#x65B9;&#x6CD5;</h3><p>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x9664;&#x4E86;&#x4F7F;&#x7528;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x5176;&#x4ED6;&#x7684;&#x65B9;&#x6CD5;&#x80FD;&#x591F;&#x6700;&#x5C0F;&#x5316;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x3002;</p>
<p>&#x5728;&#x8BFE;&#x7A0B;&#x91CC;&#x63D0;&#x53CA;&#x4E86;&#x76F8;&#x5BF9;&#x4E8E;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x66F4;&#x52A0;&#x9AD8;&#x7EA7;&#x7684;&#x7B97;&#x6CD5;&#xFF1A;</p>
<ul>
<li>Conjugate Gradient</li>
<li>BFGS</li>
<li>L-BFGS</li>
</ul>
<p>&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x7B97;&#x6CD5;&#x7684;&#x597D;&#x5904;&#x662F;&#xFF1A;</p>
<ul>
<li>&#x4E0D;&#x9700;&#x8981;&#x624B;&#x52A8;&#x6307;&#x5B9A;$\alpha$</li>
<li>&#x6BD4;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7684;&#x901F;&#x5EA6;&#x66F4;&#x5FEB;</li>
</ul>
<p>&#x8FD9;&#x4E9B;&#x7B97;&#x6CD5;&#x90FD;&#x6BD4;&#x8F83;&#x590D;&#x6742;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x5728;&#x8BFE;&#x7A0B;&#x7684;&#x8BA8;&#x8BBA;&#x8303;&#x56F4;&#x5185;&#xFF0C;&#x8FD9;&#x91CC;&#x63D0;&#x4E00;&#x4E0B;&#x7684;&#x539F;&#x56E0;&#x662F;Matlab&#x548C;Octave&#x91CC;&#x5DF2;&#x7ECF;&#x5B9E;&#x73B0;&#x4E86;&#x8FD9;&#x4E9B;&#x7B97;&#x6CD5;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x76F4;&#x63A5;&#x62FF;&#x6765;&#x7528;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x8BA1;&#x7B97;$J(\theta)$&#x7684;&#x65B9;&#x6CD5;&#x4EE5;&#x53CA;&#x8BA1;&#x7B97;$\dfrac{\partial}{\partial \theta_j}J(\theta)$&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<h3 id="&#x591A;&#x7C7B;&#x522B;&#x7684;&#x5206;&#x7C7B;&#x95EE;&#x9898;"><a href="#&#x591A;&#x7C7B;&#x522B;&#x7684;&#x5206;&#x7C7B;&#x95EE;&#x9898;" class="headerlink" title="&#x591A;&#x7C7B;&#x522B;&#x7684;&#x5206;&#x7C7B;&#x95EE;&#x9898;"></a>&#x591A;&#x7C7B;&#x522B;&#x7684;&#x5206;&#x7C7B;&#x95EE;&#x9898;</h3><p>&#x5BF9;&#x4E8E;&#x591A;&#x7C7B;&#x522B;&#x7684;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x91CC;&#x4ECB;&#x7ECD;&#x4E86;&#x4E00;&#x79CD;&#x201C;&#x4E00;&#x5BF9;&#x4F59;&#x201D;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x901A;&#x8FC7;&#x591A;&#x6B21;&#x4F7F;&#x7528;&#x4E24;&#x4E2A;&#x7C7B;&#x522B;&#x7684;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#x6765;&#x5B9E;&#x73B0;&#x591A;&#x4E2A;&#x7C7B;&#x522B;&#x7684;&#x5206;&#x7C7B;&#x3002;&#x4E3B;&#x8981;&#x601D;&#x60F3;&#x662F;&#xFF0C;&#x4E00;&#x4E2A;&#x7C7B;&#x4E00;&#x4E2A;&#x7C7B;&#x5730;&#x8FDB;&#x884C;&#x5224;&#x65AD;&#xFF0C;&#x5224;&#x65AD;&#x5F53;&#x524D;&#x7279;&#x5F81;&#x662F;&#x5426;&#x5C5E;&#x4E8E;&#x5F53;&#x524D;&#x7C7B;&#x3002;</p>
<p>&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5047;&#x5982;&#x6709;3&#x4E2A;&#x7C7B;&#xFF1A;1&#x3001;2&#x3001;3&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x8981;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x662F;&#xFF0C;&#x627E;&#x5230;1&#x548C;2+3&#x7684;&#x51B3;&#x7B56;&#x8FB9;&#x754C;&#x3001;2&#x548C;1+3&#x7684;&#x51B3;&#x7B56;&#x8FB9;&#x754C;&#x3001;3&#x548C;1+2&#x7684;&#x51B3;&#x7B56;&#x8FB9;&#x754C;&#xFF0C;&#x5047;&#x8BBE;&#x6700;&#x540E;&#x5F97;&#x5230;&#x7684;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#xFF0C;&#x5373;&#x5224;&#x522B;&#x51FD;&#x6570;&#x4E3A;$h_\theta^{(1)}(x)$&#xFF0C;&#x5176;&#x4E2D;$i$&#x8868;&#x793A;&#x5224;&#x65AD;&#x7B2C;i&#x4E2A;&#x7C7B;&#x7684;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x3002;</p>
<p>&#x5219;&#x8FDB;&#x884C;&#x5224;&#x65AD;&#x65F6;&#xFF0C;&#x7ED3;&#x679C;&#x4E3A;&#x6700;&#x540E;&#x5F97;&#x5230;&#x7684;$h_\theta^{(1)}(x)$&#x4E2D;&#x6700;&#x5927;&#x503C;&#x5BF9;&#x5E94;&#x7684;$i$&#x5373;&#x53EF;&#x3002;</p>
<p><br></p>
<h2 id="&#x6B63;&#x5219;&#x5316;"><a href="#&#x6B63;&#x5219;&#x5316;" class="headerlink" title="&#x6B63;&#x5219;&#x5316;"></a>&#x6B63;&#x5219;&#x5316;</h2><p>&#x5728;&#x8FDB;&#x884C;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x6216;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5982;&#x679C;&#x5BF9;&#x4E8E;&#x6A21;&#x578B;&#x7684;&#x5047;&#x8BBE;&#x4E0D;&#x591F;&#x597D;&#xFF0C;&#x90A3;&#x4E48;&#x6700;&#x7EC8;&#x5F97;&#x5230;&#x7684;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x5BF9;&#x4E8E;&#x95EE;&#x9898;&#x7684;&#x62DF;&#x5408;&#x7A0B;&#x5EA6;&#x53EF;&#x80FD;&#x5C31;&#x4F1A;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x4E00;&#x90E8;&#x5206;&#x4E3B;&#x8981;&#x4ECB;&#x7ECD;&#x901A;&#x8FC7;&#x6B63;&#x5219;&#x5316;&#x89E3;&#x51B3;&#x8FD9;&#x4E00;&#x95EE;&#x9898;&#x3002;</p>
<h3 id="&#x8FC7;&#x62DF;&#x5408;&#x95EE;&#x9898;&#x4E0E;&#x6B20;&#x62DF;&#x5408;&#x95EE;&#x9898;"><a href="#&#x8FC7;&#x62DF;&#x5408;&#x95EE;&#x9898;&#x4E0E;&#x6B20;&#x62DF;&#x5408;&#x95EE;&#x9898;" class="headerlink" title="&#x8FC7;&#x62DF;&#x5408;&#x95EE;&#x9898;&#x4E0E;&#x6B20;&#x62DF;&#x5408;&#x95EE;&#x9898;"></a>&#x8FC7;&#x62DF;&#x5408;&#x95EE;&#x9898;&#x4E0E;&#x6B20;&#x62DF;&#x5408;&#x95EE;&#x9898;</h3><p>&#x5982;&#x679C;&#x7279;&#x5F81;&#x8FC7;&#x591A;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x4F7F;&#x7528;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x6216;&#x8005;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x65F6;&#xFF0C;&#x53EF;&#x80FD;&#x6700;&#x540E;&#x5F97;&#x5230;&#x7684;&#x51FD;&#x6570;&#x5BF9;&#x4E8E;&#x6837;&#x672C;&#x6570;&#x636E;&#x62DF;&#x5408;&#x5F97;&#x975E;&#x5E38;&#x597D;&#xFF0C;&#x4F46;&#x662F;&#x65E0;&#x6CD5;&#x6CDB;&#x5316;&#x5230;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E4B;&#x4E0B;&#x3002;</p>
<p>&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#x6765;&#x8BF4;&#xFF0C;&#x4F8B;&#x5982;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x95EE;&#x9898;&#xFF0C;&#x6837;&#x672C;&#x5982;&#x4E0B;&#xFF1A;</p>
<img src="/articles/1/pic5.png" alt="&#x6837;&#x672C;" title="&#x6837;&#x672C;">
<p>&#x8FD9;&#x662F;&#x7406;&#x60F3;&#x60C5;&#x51B5;&#xFF1A;</p>
<img src="/articles/1/pic6.png" alt="&#x7406;&#x60F3;&#x60C5;&#x51B5;" title="&#x7406;&#x60F3;&#x60C5;&#x51B5;">
<p>&#x8FD9;&#x5C31;&#x662F;&#x8FC7;&#x62DF;&#x5408;&#xFF1A;</p>
<img src="/articles/1/pic7.png" alt="&#x8FC7;&#x62DF;&#x5408;" title="&#x8FC7;&#x62DF;&#x5408;">
<p>&#x53E6;&#x5916;&#xFF0C;&#x8FD8;&#x53EF;&#x80FD;&#x6709;&#x6B20;&#x62DF;&#x5408;&#x95EE;&#x9898;&#xFF1A;</p>
<img src="/articles/1/pic8.png" alt="&#x6B20;&#x62DF;&#x5408;" title="&#x6B20;&#x62DF;&#x5408;">
<p>&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x4E0E;&#x4E4B;&#x7C7B;&#x4F3C;&#xFF0C;&#x4E0D;&#x8FC7;&#x66F2;&#x7EBF;&#x8868;&#x793A;&#x7684;&#x662F;&#x51B3;&#x7B56;&#x8FB9;&#x754C;&#x3002;</p>
<h3 id="&#x4EE3;&#x4EF7;&#x51FD;&#x6570;-2"><a href="#&#x4EE3;&#x4EF7;&#x51FD;&#x6570;-2" class="headerlink" title="&#x4EE3;&#x4EF7;&#x51FD;&#x6570;"></a>&#x4EE3;&#x4EF7;&#x51FD;&#x6570;</h3><p>&#x5BF9;&#x4E8E;&#x8FC7;&#x62DF;&#x5408;&#x95EE;&#x9898;&#xFF0C;&#x901A;&#x8FC7;&#x6DFB;&#x52A0;&#x201C;&#x60E9;&#x7F5A;&#x201D;&#x9879;&#xFF0C;&#x5373;&#x6B63;&#x5219;&#x5316;&#x9879;&#xFF0C;&#x6765;&#x4F7F;&#x591A;&#x4F59;&#x7684;&#x7279;&#x5F81;&#x7684;&#x5F71;&#x54CD;&#x5C3D;&#x53EF;&#x80FD;&#x5C0F;&#x4E00;&#x4E9B;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#xFF0C;&#x6B63;&#x5219;&#x5316;&#x7684;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x4E3A;</p>
<script type="math/tex; mode=display">J(\theta) = \dfrac{1}{2m}\  \sum_{i=1}^m (h_\theta(x^{(i)}) - y^{(i)})^2 + \lambda\ \sum_{j=1}^n \theta_j^2</script><p>&#x5BF9;&#x4E8E;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#xFF0C;&#x6B63;&#x5219;&#x5316;&#x7684;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x4E3A;</p>
<script type="math/tex; mode=display">J(\theta) = - \frac{1}{m} \sum_{i=1}^m \large[ y^{(i)}\ \log (h_\theta (x^{(i)})) + (1 - y^{(i)})\ \log (1 - h_\theta(x^{(i)}))\large] + \frac{\lambda}{2m}\sum_{j=1}^n \theta_j^2</script><p>&#x5176;&#x4E2D;$\lambda$&#x662F;&#x6B63;&#x5219;&#x5316;&#x53C2;&#x6570;&#xFF0C;&#x5B83;&#x51B3;&#x5B9A;&#x4E86;&#x201C;&#x60E9;&#x7F5A;&#x7684;&#x529B;&#x5EA6;&#x201D;&#x3002;$\lambda$&#x8D8A;&#x5927;&#xFF0C;&#x51FD;&#x6570;&#x4F1A;&#x8D8A;&#x5149;&#x6ED1;&#xFF0C;&#x4F46;&#x5176;&#x53D6;&#x503C;&#x5E94;&#x9002;&#x4E2D;&#xFF0C;&#x592A;&#x5927;&#x4F1A;&#x5BFC;&#x81F4;&#x6B20;&#x62DF;&#x5408;&#xFF0C;&#x800C;&#x592A;&#x5C0F;&#x663E;&#x7136;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x8FC7;&#x62DF;&#x5408;&#x3002;</p>
<p>&#x5411;&#x91CF;&#x5316;&#x540E;&#x7684;&#x7248;&#x672C;&#x4E3A;</p>
<script type="math/tex; mode=display">\begin{align*} & h = g(X\theta)\newline & J(\theta) = \frac{1}{m} \cdot \left(-y^{T}\log(h)-(1-y)^{T}\log(1-h)\right) + \frac{\lambda}{m}{\theta^\prime}^T \theta^\prime \end{align*}</script><p>&#x8FD9;&#x91CC;&#x7684;$\theta^\prime$&#x662F;$\theta$&#x53BB;&#x6389;$\theta_0$&#x540E;&#x6784;&#x6210;&#x7684;&#x5217;&#x5411;&#x91CF;&#x3002;</p>
<h3 id="&#x68AF;&#x5EA6;&#x4E0B;&#x964D;-2"><a href="#&#x68AF;&#x5EA6;&#x4E0B;&#x964D;-2" class="headerlink" title="&#x68AF;&#x5EA6;&#x4E0B;&#x964D;"></a>&#x68AF;&#x5EA6;&#x4E0B;&#x964D;</h3><p>&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x4E2D;&#x540C;&#x6837;&#x4E5F;&#x9700;&#x8981;&#x52A0;&#x5165;&#x6B63;&#x5219;&#x5316;&#x7684;&#x9879;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x4E0D;&#x5E0C;&#x671B;&#x60E9;&#x7F5A;$\theta_0$&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x662F;&#x5E38;&#x6570;&#x9879;&#x3002;</p>
<script type="math/tex; mode=display">\theta_0 := \theta_0 - \alpha\ \frac{1}{m}\ \sum_{i=1}^m (h_\theta(x^{(i)}) - y^{(i)})x_0^{(i)}</script><script type="math/tex; mode=display">\theta_j := \theta_j - \alpha\ \left[ \left( \frac{1}{m}\ \sum_{i=1}^m (h_\theta(x^{(i)}) - y^{(i)})x_j^{(i)} \right) + \frac{\lambda}{m}\theta_j \right]</script><p>&#x8FD9;&#x91CC;&#x9762;&#x68AF;&#x5EA6;&#x5C31;&#x662F;&#x65B9;&#x62EC;&#x53F7;&#x91CC;&#x9762;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x6700;&#x4E0B;&#x9762;&#x7684;&#x516C;&#x5F0F;&#x53EF;&#x7B80;&#x5316;&#x4E3A;</p>
<script type="math/tex; mode=display">\theta_j := \theta_j(1 - \alpha\frac{\lambda}{m}) - \alpha\frac{1}{m}\sum_{i=1}^m(h_\theta(x^{(i)}) - y^{(i)})x_j^{(i)}</script><p>&#x5411;&#x91CF;&#x5316;&#x540E;&#x7684;&#x7248;&#x672C;&#xFF08;&#x56E0;&#x4E3A;&#x8003;&#x8651;&#x5230;$\theta_0$&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x518D;&#x4F7F;&#x7528;&#x4E0A;&#x9762;&#x7684;&#x5316;&#x7B80;&#x5F62;&#x5F0F;&#xFF09;&#x4E3A;</p>
<script type="math/tex; mode=display">\theta := \theta - \left[ \frac{\alpha}{m} X^{T} (g(X \theta ) - y) + \frac{\alpha\lambda}{m}\theta^{\prime\prime} \right]</script><p>&#x8FD9;&#x91CC;&#x7684;$\theta^{\prime\prime}$&#x8868;&#x793A;&#x66FF;&#x6362;$\theta$&#x4E2D;&#x7684;$\theta_0$&#x5F62;&#x6210;&#x7684;&#x5217;&#x5411;&#x91CF;&#x3002;</p>
<p><br></p>
<h2 id="&#x603B;&#x7ED3;"><a href="#&#x603B;&#x7ED3;" class="headerlink" title="&#x603B;&#x7ED3;"></a>&#x603B;&#x7ED3;</h2><p>&#x8FD9;&#x5C31;&#x662F;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x4E0E;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x7684;&#x4E3B;&#x8981;&#x5185;&#x5BB9;&#x4E86;&#x3002;&#x5176;&#x5B9E;&#x4ECE;&#x603B;&#x4F53;&#x4E0A;&#x770B;&#xFF0C;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x4E0E;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x7684;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#x5C31;&#x662F;&#x4E09;&#x6B65;&#xFF1A;</p>
<ul>
<li>&#x6784;&#x9020;&#x4E00;&#x4E2A;&#x5047;&#x8BBE;&#x51FD;&#x6570;</li>
<li>&#x6784;&#x9020;&#x4E00;&#x4E2A;&#x80FD;&#x591F;&#x8861;&#x91CF;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x62DF;&#x5408;&#x7A0B;&#x5EA6;&#x7684;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;</li>
<li>&#x4E0D;&#x65AD;&#x6539;&#x8FDB;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#xFF0C;&#x4EE5;&#x6700;&#x5C0F;&#x5316;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x3002;&#x5F53;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x6700;&#x5C0F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E5F;&#x5C31;&#x8868;&#x793A;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x80FD;&#x591F;&#x5F88;&#x597D;&#x5730;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x4E86;</li>
</ul>
<p>&#x7ED3;&#x5408;&#x4E00;&#x5F00;&#x59CB;&#x5BF9;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x5B9A;&#x4E49;&#x4E2D;&#x7684;&#x4E09;&#x8981;&#x7D20;&#x7ECF;&#x9A8C;E&#x3001;&#x4EFB;&#x52A1;T&#x548C;&#x5EA6;&#x91CF;P&#xFF0C;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#xFF1A;</p>
<ul>
<li>&#x627E;&#x5230;&#x89E3;&#x51B3;T&#x7684;&#x6A21;&#x578B;</li>
<li>&#x627E;&#x5230;&#x80FD;&#x591F;&#x5EA6;&#x91CF;&#x6A21;&#x578B;&#x7684;P</li>
<li>&#x6539;&#x8FDB;&#x6A21;&#x578B;&#x4EE5;&#x6700;&#x4F18;&#x5316;P</li>
</ul>
<p>&#x7531;&#x524D;&#x9762;&#x7684;&#x4ECB;&#x7ECD;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#xFF0C;&#x5728;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x4E0E;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x4E2D;&#xFF0C;&#x60F3;&#x8981;&#x83B7;&#x5F97;&#x8F83;&#x597D;&#x7684;&#x9884;&#x6D4B;&#x6548;&#x679C;&#xFF0C;&#x4E00;&#x65B9;&#x9762;&#x9700;&#x8981;&#x627E;&#x5230;&#x5408;&#x9002;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x6784;&#x9020;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#xFF0C;&#x5426;&#x5219;&#xFF0C;&#x5C31;&#x4E0D;&#x80FD;&#x5F88;&#x597D;&#x5730;&#x62DF;&#x5408;&#x95EE;&#x9898;&#x3002;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x4E0E;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x6240;&#x505A;&#x7684;&#xFF0C;&#x5176;&#x5B9E;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x8C03;&#x53C2;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x800C;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x7684;&#x201C;&#x5927;&#x67B6;&#x5B50;&#x201D;&#xFF0C;&#x4F8B;&#x5982;&#x5047;&#x8BBE;&#x51FD;&#x6570;&#x7528;&#x7EBF;&#x6027;&#x7684;&#x8FD8;&#x662F;&#x4E8C;&#x6B21;&#x51FD;&#x6570;&#x8FD8;&#x662F;&#x51E0;&#x6B21;&#x51FD;&#x6570;&#xFF0C;&#x7528;&#x54EA;&#x4E9B;&#x9879;&#xFF0C;&#x8FD9;&#x9700;&#x8981;&#x9760;&#x4EBA;&#x6765;&#x51B3;&#x5B9A;&#xFF0C;&#x8FD9;&#x5C31;&#x9700;&#x8981;&#x5BF9;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x6A21;&#x578B;&#x6709;&#x4E00;&#x4E2A;&#x521D;&#x6B65;&#x7684;&#x4F30;&#x8BA1;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x5C31;&#x9700;&#x8981;&#x4E8B;&#x5148;&#x5BF9;&#x6837;&#x672C;&#x5148;&#x8FDB;&#x884C;&#x4E00;&#x5B9A;&#x7684;&#x5206;&#x6790;&#x3002;</p>

      
    </div>

  </div>

  <div class="article-footer">
    <div class="article-meta pull-left">

    
      

    <span class="post-categories">
      <i class="icon-categories"></i>
        <a href="/categories/学习笔记/">学习笔记</a>
    </span>
    

    
    

    <span class="post-tags">
      <i class="icon-tags"></i>
        <a href="/tags/Coursera/">Coursera</a><a href="/tags/机器学习/">机器学习</a><a href="/tags/线性回归/">线性回归</a><a href="/tags/逻辑回归/">逻辑回归</a>
    </span>
    

    </div>

    
  </div>
</article>


    </main>

    <footer class="site-footer">
  <p class="site-info">
    Proudly powered by <a href="https://hexo.io/" target="_blank">Hexo</a> and
    Theme by <a href="https://github.com/kawaiiQ/kawaiiHacker" target="_blank">kawaiiHacker</a>
    </br>
    
    &copy; 2018 _kawaiiQ
    
  </p>
</footer>
    
    
<script>
  widget_settings = {
    maxDistance: 15,
    sensitive: 0.01
  };
</script>
<script src="/js/logo-widget.js"></script>



<script type="text/x-mathjax-config">
  MathJax.Hub.Config({
    tex2jax: {
      inlineMath: [['$','$'], ["\\(","\\)"] ],
      processEscapes: true
    }
  });
</script>
<script type="text/javascript" async
  src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/MathJax.js?config=TeX-MML-AM_CHTML">
</script>


  </div>
</div>
</body>
</html>