<!DOCTYPE HTML>
<html>
<head>
  <meta charset="utf-8">
  
  <title>Coursera《机器学习》学习笔记（八）：OCR篇 | _kawaiiQ&#39;s blog</title>

  
  <meta name="author" content="_kawaiiQ">
  

  
  <meta name="description" content="&amp;#x8FD9;&amp;#x4E00;&amp;#x7BC7;&amp;#x662F;&amp;#x300A;&amp;#x673A;&amp;#x5668;&amp;#x5B66;&amp;#x4E60;&amp;#x300B;&amp;#x6700;&amp;#x540E;&amp;#x4E00;&amp;#x5468;&amp;#x77E5;&amp;#x8BC6;&amp;#x70B9;&amp;#x7684;&amp;#x603B;&amp;#x7ED3;&amp;#xFF0C;&amp;#x4E3B;&amp;#x8981;&amp;#x4ECB;&amp;#x7ECD;&amp;#x4E86;OCR&amp;#x6280;&amp;#x672F;&amp;#xFF0C;&amp;#x5E76;&amp;#x901A;&amp;#x8FC7;OCR&amp;#x7684;&amp;#x4F8B;&amp;#x5B50;&amp;#x4ECB;&amp;#x7ECD;&amp;#x4E86;&amp;#x673A;&amp;#x5668;&amp;#x5B66;&amp;#x4E60;&amp;#x6D41;&amp;#x6C34;&amp;#x7EBF;&amp;#x7684;&amp;#x6982;&amp;#x5FF5;&amp;#xFF0C;&amp;#x5E76;&amp;#x7B80;&amp;#x5355;&amp;#x4ECB;&amp;#x7ECD;&amp;#x5BF9;&amp;#x4E8E;&amp;#x673A;&amp;#x5668;&amp;#x5B66;&amp;#x4E60;&amp;#x6D41;&amp;#x6C34;&amp;#x7EBF;&amp;#x5982;&amp;#x4F55;&amp;#x627E;&amp;#x5230;&amp;#x8FDB;&amp;#x4E00;&amp;#x6B65;&amp;#x6539;&amp;#x8FDB;&amp;#x6548;&amp;#x76CA;&amp;#x6700;&amp;#x9AD8;&amp;#x7684;&amp;#x70B9;&amp;#x3002;">
  

  
  
  <meta name="keywords" content="Coursera,机器学习">
  

  <meta id="viewport" name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no, minimal-ui">
  <meta name="apple-mobile-web-app-capable" content="yes">
  <meta name="apple-mobile-web-app-status-bar-style" content="black">

  <meta property="og:title" content="Coursera《机器学习》学习笔记（八）：OCR篇"/>

  <meta property="og:site_name" content="_kawaiiQ&#39;s blog"/>

  
  <meta property="og:image" content="/favicon.ico"/>
  

  <link href="/favicon.ico" rel="icon">
  <link rel="alternate" href="/atom.xml" title="_kawaiiQ&#39;s blog" type="application/atom+xml">
  <link rel="stylesheet" href="/css/style.css" media="screen" type="text/css">

  <link rel="dns-prefetch" href="https://cdnjs.cloudflare.com" />

</head>


<body>
<div class="blog">
  <div class="content">

    <header>
  <div class="site-branding">
    <h1 class="site-logo">
      <div>
        <a href="/"><img src="/images/logo.png" /></a>
        
          <a href="/"><img id="logo-widget" src="/images/widget.png" /></a>
        
      </div>
    </h1>
    <p class="site-description">Blind Busy All Day</p>
  </div>
  <nav class="site-navigation">
    <ul>
      
        <li><a href="/">主页</a></li>
      
        <li><a href="/categories">分类</a></li>
      
        <li><a href="/archives">所有文章</a></li>
      
        <li><a href="/about">关于我</a></li>
      
    </ul>
  </nav>
</header>

    <main class="site-main posts-loop">
    <article>

  
    
    <h3 class="article-title"><span>Coursera《机器学习》学习笔记（八）：OCR篇</span></h3>
    
  

  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/articles/8/" rel="bookmark">
        <time class="entry-date published" datetime="2018-02-09T08:18:38.000Z">
          2018-02-09
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <p>&#x8FD9;&#x4E00;&#x7BC7;&#x662F;<a href="https://www.coursera.org/learn/machine-learning" target="_blank" rel="external">&#x300A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x300B;</a>&#x6700;&#x540E;&#x4E00;&#x5468;&#x77E5;&#x8BC6;&#x70B9;&#x7684;&#x603B;&#x7ED3;&#xFF0C;&#x4E3B;&#x8981;&#x4ECB;&#x7ECD;&#x4E86;OCR&#x6280;&#x672F;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;OCR&#x7684;&#x4F8B;&#x5B50;&#x4ECB;&#x7ECD;&#x4E86;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6D41;&#x6C34;&#x7EBF;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x5E76;&#x7B80;&#x5355;&#x4ECB;&#x7ECD;&#x5BF9;&#x4E8E;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6D41;&#x6C34;&#x7EBF;&#x5982;&#x4F55;&#x627E;&#x5230;&#x8FDB;&#x4E00;&#x6B65;&#x6539;&#x8FDB;&#x6548;&#x76CA;&#x6700;&#x9AD8;&#x7684;&#x70B9;&#x3002;</p>
<a id="more"></a>
<h2 id="&#x4E3B;&#x8981;&#x5185;&#x5BB9;"><a href="#&#x4E3B;&#x8981;&#x5185;&#x5BB9;" class="headerlink" title="&#x4E3B;&#x8981;&#x5185;&#x5BB9;"></a>&#x4E3B;&#x8981;&#x5185;&#x5BB9;</h2><ul>
<li>OCR&#x4E0E;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6D41;&#x6C34;&#x7EBF;</li>
<li>&#x83B7;&#x53D6;&#x6570;&#x636E;</li>
<li>&#x4E0A;&#x9650;&#x5206;&#x6790;</li>
</ul>
<p><br></p>
<h2 id="OCR&#x4E0E;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6D41;&#x6C34;&#x7EBF;"><a href="#OCR&#x4E0E;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6D41;&#x6C34;&#x7EBF;" class="headerlink" title="OCR&#x4E0E;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6D41;&#x6C34;&#x7EBF;"></a>OCR&#x4E0E;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6D41;&#x6C34;&#x7EBF;</h2><p>OCR&#xFF0C;&#x5168;&#x79F0;&#x4E3A;&#x7167;&#x7247;&#x5149;&#x5B66;&#x5B57;&#x7B26;&#x8BC6;&#x522B;&#xFF08;Photo Optical Character Recognition&#xFF09;&#xFF0C;&#x4E3B;&#x8981;&#x4F5C;&#x7528;&#x4E3A;&#x4ECE;&#x56FE;&#x50CF;&#x4E2D;&#x8BC6;&#x522B;&#x51FA;&#x6587;&#x5B57;&#x6765;&#xFF0C;&#x4ECE;&#x800C;&#x6EE1;&#x8DB3;&#x4E00;&#x5B9A;&#x7684;&#x9700;&#x6C42;&#x3002;</p>
<p>&#x4E3E;&#x4E2A;&#x5E94;&#x7528;OCR&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5047;&#x5982;&#x6211;&#x4EEC;&#x62CD;&#x4E86;&#x8FD9;&#x4E48;&#x4E00;&#x5F20;&#x7167;&#x7247;&#xFF1A;</p>
<img src="/articles/8/pic1.jpg" alt="&#x4E00;&#x5F20;&#x7167;&#x7247;" title="&#x4E00;&#x5F20;&#x7167;&#x7247;">
<p>&#x901A;&#x8FC7;OCR&#xFF0C;&#x6211;&#x4EEC;&#x8BC6;&#x522B;&#x51FA;&#x7167;&#x7247;&#x4E0A;&#x6709;&#x8FD9;&#x4E9B;&#x8BCD;&#xFF1A;</p>
<img src="/articles/8/pic2.jpg" alt="&#x7167;&#x7247;&#x4E0A;&#x7684;&#x6587;&#x5B57;" title="&#x7167;&#x7247;&#x4E0A;&#x7684;&#x6587;&#x5B57;">
<p>&#x90A3;&#x4E48;&#x5047;&#x5982;&#x4EE5;&#x540E;&#x6211;&#x4EEC;&#x60F3;&#x518D;&#x627E;&#x8FD9;&#x5F20;&#x7167;&#x7247;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x8F93;&#x5165;&#x8FD9;&#x4E9B;&#x8BCD;&#x8FDB;&#x884C;&#x641C;&#x7D22;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x5728;&#x76F8;&#x518C;&#x91CC;&#x4E00;&#x5F20;&#x4E00;&#x5F20;&#x5730;&#x627E;&#x4E86;&#x3002;</p>
<p>&#x50CF;&#x662F;&#x6587;&#x732E;&#x626B;&#x63CF;&#xFF0C;&#x8F66;&#x724C;&#x4FE1;&#x606F;&#x8BC6;&#x522B;&#xFF0C;&#x62CD;&#x7167;&#x7FFB;&#x8BD1;&#xFF0C;&#x8FD9;&#x90FD;&#x662F;OCR&#x6280;&#x672F;&#x5E94;&#x7528;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x53EF;&#x4EE5;&#x8BF4;&#xFF0C;OCR&#x5E94;&#x7528;&#x9762;&#x662F;&#x975E;&#x5E38;&#x5E7F;&#x7684;&#x3002;</p>
<h3 id="&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6D41;&#x6C34;&#x7EBF;"><a href="#&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6D41;&#x6C34;&#x7EBF;" class="headerlink" title="&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6D41;&#x6C34;&#x7EBF;"></a>&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6D41;&#x6C34;&#x7EBF;</h3><p>&#x5565;&#x662F;&#x6D41;&#x6C34;&#x7EBF;&#x5462;&#xFF1F;&#x60F3;&#x60F3;&#x73B0;&#x5B9E;&#x751F;&#x6D3B;&#x4E2D;&#x7684;&#x6D41;&#x6C34;&#x7EBF;&#xFF0C;&#x4E00;&#x79CD;&#x4EA7;&#x54C1;&#x7684;&#x751F;&#x4EA7;&#x5F80;&#x5F80;&#x662F;&#x5206;&#x4E3A;&#x6570;&#x9053;&#x5DE5;&#x5E8F;&#xFF0C;&#x6BCF;&#x9053;&#x5DE5;&#x5E8F;&#x90FD;&#x4EC5;&#x505A;&#x4E00;&#x4EF6;&#x4E8B;&#xFF0C;&#x63A5;&#x53D7;&#x4E0A;&#x4E00;&#x9053;&#x5DE5;&#x5E8F;&#x7684;&#x751F;&#x4EA7;&#x7EBF;&#x4F20;&#x6765;&#x7684;&#x4EA7;&#x54C1;&#xFF0C;&#x8FDB;&#x884C;&#x4E00;&#x6B65;&#x52A0;&#x5DE5;&#x540E;&#x5C06;&#x52A0;&#x5DE5;&#x540E;&#x7684;&#x4EA7;&#x54C1;&#x4F20;&#x7ED9;&#x4E0B;&#x4E00;&#x9053;&#x5DE5;&#x5E8F;&#x7684;&#x751F;&#x4EA7;&#x7EBF;&#x3002;&#x4E00;&#x4EF6;&#x4EA7;&#x54C1;&#x5C31;&#x662F;&#x7ECF;&#x5386;&#x8FD9;&#x4E00;&#x9053;&#x9053;&#x5DE5;&#x5E8F;&#x7684;&#x4E00;&#x6B65;&#x6B65;&#x52A0;&#x5DE5;&#x9010;&#x6E10;&#x5F62;&#x6210;&#x4EA7;&#x54C1;&#x7684;&#x3002;</p>
<p>&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6D41;&#x6C34;&#x7EBF;&#x5176;&#x5B9E;&#x4E5F;&#x662F;&#x7C7B;&#x4F3C;&#x7684;&#x539F;&#x7406;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E9B;&#x590D;&#x6742;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x95EE;&#x9898;&#xFF0C;&#x5F80;&#x5F80;&#x4E00;&#x6B65;&#x5C31;&#x51C6;&#x786E;&#x8BA1;&#x7B97;&#x51FA;&#x6765;&#x662F;&#x6BD4;&#x8F83;&#x96BE;&#x7684;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x62C6;&#x5206;&#x4E3A;&#x591A;&#x4E2A;&#x9636;&#x6BB5;&#xFF0C;&#x6BCF;&#x4E2A;&#x9636;&#x6BB5;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x95EE;&#x9898;&#x3002;&#x9488;&#x5BF9;&#x6BCF;&#x4E2A;&#x9636;&#x6BB5;&#x5F00;&#x53D1;&#x4E00;&#x4E2A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7A0B;&#x5E8F;&#xFF0C;&#x6BCF;&#x4E2A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7A0B;&#x5E8F;&#x90FD;&#x53EA;&#x63A5;&#x53D7;&#x524D;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#x6216;&#x9884;&#x6D4B;&#x540E;&#x518D;&#x5C06;&#x7ED3;&#x679C;&#x8F93;&#x5165;&#x4E0B;&#x4E00;&#x4E2A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7A0B;&#x5E8F;&#x3002;&#x539F;&#x59CB;&#x6570;&#x636E;&#x4E5F;&#x5C31;&#x8FD9;&#x4E48;&#x4E00;&#x6B65;&#x6B65;&#x9010;&#x6E10;&#x88AB;&#x63D0;&#x53D6;&#x51FA;&#x60F3;&#x8981;&#x7684;&#x7ED3;&#x679C;&#x51FA;&#x6765;&#x3002;</p>
<p>OCR&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6D41;&#x6C34;&#x7EBF;&#x4E3B;&#x8981;&#x5206;&#x4E3A;&#x4E09;&#x4E2A;&#x90E8;&#x5206;&#x3002;&#x7B2C;&#x4E00;&#x90E8;&#x5206;&#x8D1F;&#x8D23;&#x8BC6;&#x522B;&#x51FA;&#x56FE;&#x50CF;&#x4E2D;&#x53EF;&#x80FD;&#x5305;&#x542B;&#x6587;&#x5B57;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x5C06;&#x8FD9;&#x4E9B;&#x5730;&#x65B9;&#x5207;&#x5272;&#x51FA;&#x6765;&#xFF1B;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#x8D1F;&#x8D23;&#x5C06;&#x8FD9;&#x4E9B;&#x5305;&#x542B;&#x6587;&#x5B57;&#x7684;&#x5730;&#x65B9;&#x6309;&#x7167;&#x5B57;&#x6BCD;&#x8FDB;&#x884C;&#x5207;&#x5272;&#xFF0C;&#x62C6;&#x5206;&#x6210;&#x4E00;&#x4E2A;&#x4E2A;&#x7684;&#x5B57;&#x6BCD;&#xFF1B;&#x7B2C;&#x4E09;&#x90E8;&#x5206;&#x8D1F;&#x8D23;&#x5C06;&#x8FD9;&#x4E9B;&#x5B57;&#x6BCD;&#x4E00;&#x4E2A;&#x4E2A;&#x8BC6;&#x522B;&#x51FA;&#x6765;&#xFF0C;&#x5F62;&#x6210;&#x6700;&#x540E;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<img src="/articles/8/pic5.png" alt="OCR&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6D41;&#x6C34;&#x7EBF;" title="OCR&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6D41;&#x6C34;&#x7EBF;">
<p>&#x4F8B;&#x5982;&#x4E0A;&#x9762;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x7B2C;&#x4E00;&#x90E8;&#x5206;&#x68C0;&#x6D4B;&#x51FA;&#x6765;&#x4E86;&#x4E00;&#x4E9B;&#x5176;&#x4E2D;&#x5305;&#x542B;&#x6587;&#x5B57;&#x7684;&#x5757;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x542B;&#x8FD9;&#x4E00;&#x90E8;&#x5206;&#xFF1A;</p>
<img src="/articles/8/pic3.jpg" alt="&#x5305;&#x542B;&#x6587;&#x5B57;&#x7684;&#x533A;&#x57DF;" title="&#x5305;&#x542B;&#x6587;&#x5B57;&#x7684;&#x533A;&#x57DF;">
<p>&#x7136;&#x540E;&#x5C06;&#x5176;&#x5207;&#x5272;&#x4E0B;&#x6765;&#x4EA4;&#x7ED9;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#xFF0C;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#x5224;&#x65AD;&#x54EA;&#x4E9B;&#x662F;&#x5B57;&#x6BCD;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x8FD9;&#x4E9B;&#x5B57;&#x6BCD;&#x4E00;&#x4E2A;&#x4E2A;&#x5206;&#x9694;&#x5F00;&#xFF0C;&#x4F46;&#x5E76;&#x4E0D;&#x8D1F;&#x8D23;&#x8BC6;&#x522B;&#xFF1A;</p>
<img src="/articles/8/pic4.jpg" alt="&#x62C6;&#x5206;&#x5B57;&#x6BCD;" title="&#x62C6;&#x5206;&#x5B57;&#x6BCD;">
<p>&#x6700;&#x540E;&#xFF0C;&#x8FD9;&#x4E9B;&#x88AB;&#x5206;&#x9694;&#x5F00;&#x7684;&#x5B57;&#x6BCD;&#x7531;&#x7B2C;&#x4E09;&#x90E8;&#x5206;&#x8BC6;&#x522B;&#x51FA;&#x6765;&#xFF0C;&#x5F62;&#x6210;&#x4E86;&#x6700;&#x540E;&#x7684;&#x7ED3;&#x679C;&#xFF1A;LULAB&#x2019;s ANTIQUE MALL&#x3002;&#x540E;&#x9762;&#x8FD8;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x5355;&#x8BCD;&#x7EA0;&#x9519;&#x7B49;&#x9AD8;&#x7EA7;&#x7684;&#x624B;&#x6BB5;&#x63D0;&#x9AD8;&#x8BC6;&#x522B;&#x51C6;&#x786E;&#x7387;&#x7684;&#x624B;&#x6BB5;&#xFF0C;&#x4E0D;&#x8FC7;&#x8FD9;&#x4E9B;&#x5C31;&#x4E0D;&#x5C5E;&#x4E8E;&#x57FA;&#x672C;&#x7684;OCR&#x7684;&#x8303;&#x7574;&#x4E86;&#xFF0C;&#x8FD9;&#x91CC;&#x4E0D;&#x518D;&#x6D89;&#x53CA;&#x3002;</p>
<h3 id="&#x6ED1;&#x52A8;&#x7A97;&#x53E3;"><a href="#&#x6ED1;&#x52A8;&#x7A97;&#x53E3;" class="headerlink" title="&#x6ED1;&#x52A8;&#x7A97;&#x53E3;"></a>&#x6ED1;&#x52A8;&#x7A97;&#x53E3;</h3><p>&#x5728;OCR&#x7684;&#x7B2C;&#x4E00;&#x90E8;&#x5206;&#x548C;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x8BC6;&#x522B;&#x56FE;&#x50CF;&#x4E2D;&#x7279;&#x5B9A;&#x90E8;&#x5206;&#x3002;&#x5BF9;&#x4E8E;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x4E00;&#x773C;&#x5C31;&#x80FD;&#x770B;&#x51FA;&#x6765;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x7684;&#x5927;&#x8111;&#x5DF2;&#x7ECF;&#x81EA;&#x52A8;&#x5316;&#x5730;&#x5B8C;&#x6210;&#x4E86;&#x56FE;&#x50CF;&#x7684;&#x5206;&#x6790;&#xFF0C;&#x4F46;&#x5BF9;&#x4E8E;&#x7535;&#x8111;&#x6765;&#x8BF4;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x7B97;&#x6CD5;&#x6765;&#x627E;&#x6240;&#x9700;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8FD9;&#x91CC;&#x7684;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x4E86;&#x3002;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x5176;&#x5B9E;&#x662F;&#x4E00;&#x79CD;&#x66B4;&#x529B;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x6307;&#x5B9A;&#x4E00;&#x4E2A;&#x56FA;&#x5B9A;&#x5927;&#x5C0F;&#x7684;&#x7A97;&#x53E3;&#xFF0C;&#x66B4;&#x529B;&#x679A;&#x4E3E;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x7A97;&#x53E3;&#x4F4D;&#x7F6E;&#xFF0C;&#x5206;&#x6790;&#x7A97;&#x53E3;&#x5185;&#x5185;&#x5BB9;&#x662F;&#x5426;&#x662F;&#x6240;&#x9700;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x4E00;&#x4E2A;<script type="math/tex">4 \times 4</script>&#x7684;&#x56FE;&#x50CF;&#xFF0C;&#x6211;&#x4EEC;&#x9009;&#x53D6;<script type="math/tex">2 \times 2</script>&#x7684;&#x7A97;&#x53E3;&#xFF0C;&#x90A3;&#x4E48;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x7684;&#x8FC7;&#x7A0B;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<img src="/articles/8/pic6.jpg" alt="2&#xD7;2&#x7684;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;" title="2&#xD7;2&#x7684;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;">
<p>&#x5982;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x7A97;&#x53E3;&#x4ECE;&#x5DE6;&#x4E0A;&#x89D2;&#x5F00;&#x59CB;&#xFF0C;&#x6BCF;&#x6B21;&#x50CF;&#x53F3;&#x201C;&#x6ED1;&#x52A8;&#x201D;&#x4E00;&#x70B9;&#xFF0C;&#x76F4;&#x5230;&#x6700;&#x53F3;&#x8FB9;&#xFF0C;&#x7136;&#x540E;&#x5411;&#x4E0B;&#x201C;&#x6ED1;&#x52A8;&#x201D;&#x4E00;&#x884C;&#xFF0C;&#x91CD;&#x65B0;&#x4ECE;&#x6700;&#x5DE6;&#x8FB9;&#x5F00;&#x59CB;&#x6ED1;&#x52A8;&#x3002;&#x4E0A;&#x56FE;&#x4E2D;&#x6BCF;&#x6B21;&#x6ED1;&#x52A8;&#x7684;&#x8DDD;&#x79BB;&#x4E3A;<script type="math/tex">1</script>&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x4E5F;&#x53EF;&#x4EE5;&#x5927;&#x4E8E;<script type="math/tex">1</script>&#xFF0C;&#x6BD4;&#x5982;&#x6BCF;&#x6B21;&#x6ED1;&#x52A8;<script type="math/tex">2</script>&#x4E2A;&#x5355;&#x4F4D;&#x3002;</p>
<p>&#x5982;&#x679C;&#x53D1;&#x73B0;&#x6240;&#x6709;&#x7A97;&#x53E3;&#x5747;&#x672A;&#x53D1;&#x73B0;&#xFF0C;&#x90A3;&#x4E48;&#x8FD8;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x6269;&#x5927;&#x7A97;&#x53E3;&#xFF0C;&#x6BD4;&#x5982;&#x7528;<script type="math/tex">3 \times 3</script>&#x7684;&#x7A97;&#x53E3;&#xFF1A;</p>
<img src="/articles/8/pic7.jpg" alt="3&#xD7;3&#x7684;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;" title="3&#xD7;3&#x7684;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;">
<p>&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;</p>
<img src="/articles/8/pic1.jpg" alt="&#x4E00;&#x5F20;&#x7167;&#x7247;" title="&#x4E00;&#x5F20;&#x7167;&#x7247;">
<p>&#x7B2C;&#x4E00;&#x6B65;&#x901A;&#x8FC7;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x5C31;&#x5F97;&#x5230;&#x4E86;&#x53EF;&#x80FD;&#x5305;&#x542B;&#x6587;&#x5B57;&#x7684;&#x533A;&#x57DF;&#xFF1A;</p>
<img src="/articles/8/pic8.jpg" alt="&#x53EF;&#x80FD;&#x5305;&#x542B;&#x6587;&#x5B57;&#x7684;&#x533A;&#x57DF;" title="&#x53EF;&#x80FD;&#x5305;&#x542B;&#x6587;&#x5B57;&#x7684;&#x533A;&#x57DF;">
<p>&#x56FE;&#x4E2D;&#x4EAE;&#x7684;&#x533A;&#x57DF;&#x8868;&#x793A;&#x53EF;&#x80FD;&#x5305;&#x542B;&#x6587;&#x5B57;&#x7684;&#x533A;&#x57DF;&#xFF0C;&#x8D8A;&#x4EAE;&#x8868;&#x793A;&#x53EF;&#x80FD;&#x6027;&#x8D8A;&#x5927;&#x3002;&#x6CE8;&#x610F;&#x5230;&#x6709;&#x4E00;&#x90E8;&#x5206;&#x4E0D;&#x662F;&#x5F88;&#x4EAE;&#x7684;&#x533A;&#x57DF;&#x4E5F;&#x88AB;&#x5224;&#x65AD;&#x4E3A;&#x4E86;&#x53EF;&#x80FD;&#x5305;&#x542B;&#x6587;&#x5B57;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x770B;&#x4E0A;&#x53BB;&#x5E76;&#x6CA1;&#x6709;&#x6587;&#x5B57;&#x6216;&#x8005;&#x65E0;&#x5173;&#x7D27;&#x8981;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5224;&#x65AD;&#x8BC6;&#x522B;&#x533A;&#x57DF;&#x9762;&#x79EF;&#x7B49;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x8FC7;&#x6EE4;&#x3002;&#x540C;&#x65F6;&#x4E5F;&#x53D1;&#x73B0;&#x4E00;&#x4E9B;&#x8FDE;&#x7EED;&#x7684;&#x8BCD;&#x88AB;&#x8BC6;&#x522B;&#x4E3A;&#x4E86;&#x65AD;&#x65AD;&#x7EED;&#x7EED;&#x7684;&#x6570;&#x4E2A;&#x533A;&#x57DF;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5224;&#x65AD;&#x76F8;&#x90BB;&#x533A;&#x57DF;&#x8DDD;&#x79BB;&#x5C06;&#x8FD9;&#x4E9B;&#x533A;&#x57DF;&#x8FDE;&#x6210;&#x4E00;&#x7247;&#x3002;</p>
<p>&#x800C;&#x5230;&#x4E86;&#x7B2C;&#x4E8C;&#x6B65;&#xFF0C;&#x539F;&#x7406;&#x5176;&#x5B9E;&#x4E5F;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x8FD9;&#x91CC;&#x4E0D;&#x518D;&#x8D58;&#x8FF0;&#x3002;</p>
<h3 id="&#x6570;&#x636E;&#x8BAD;&#x7EC3;"><a href="#&#x6570;&#x636E;&#x8BAD;&#x7EC3;" class="headerlink" title="&#x6570;&#x636E;&#x8BAD;&#x7EC3;"></a>&#x6570;&#x636E;&#x8BAD;&#x7EC3;</h3><p>&#x5982;&#x4F55;&#x8BC6;&#x522B;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x5185;&#x7684;&#x5185;&#x5BB9;&#x5462;&#xFF1F;&#x8FD9;&#x5C31;&#x9700;&#x8981;&#x83B7;&#x53D6;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x5B66;&#x4E60;&#x4E86;&#x3002;&#x5176;&#x8BAD;&#x7EC3;&#x5C31;&#x548C;&#x666E;&#x901A;&#x7684;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x7684;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#x5DEE;&#x4E0D;&#x591A;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5927;&#x91CF;&#x7684;&#x6B63;&#x6837;&#x672C;&#x548C;&#x8D1F;&#x6837;&#x672C;&#xFF0C;&#x4F8B;&#x5982;&#x5728;OCR&#x95EE;&#x9898;&#x4E2D;&#xFF0C;&#x5BF9;&#x5E94;&#x7684;&#x6B63;&#x6837;&#x672C;&#x5C31;&#x662F;&#x5404;&#x79CD;&#x5404;&#x6837;&#x6587;&#x5B57;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x8D1F;&#x6837;&#x672C;&#x5C31;&#x662F;&#x5404;&#x79CD;&#x4E0D;&#x5305;&#x542B;&#x6587;&#x5B57;&#x7684;&#x56FE;&#x7247;&#x3002;</p>
<img src="/articles/8/pic9.jpg" alt="&#x6B63;&#x6837;&#x672C;&#x548C;&#x8D1F;&#x6837;&#x672C;" title="&#x6B63;&#x6837;&#x672C;&#x548C;&#x8D1F;&#x6837;&#x672C;">
<p><br></p>
<h2 id="&#x83B7;&#x53D6;&#x6570;&#x636E;"><a href="#&#x83B7;&#x53D6;&#x6570;&#x636E;" class="headerlink" title="&#x83B7;&#x53D6;&#x6570;&#x636E;"></a>&#x83B7;&#x53D6;&#x6570;&#x636E;</h2><p>&#x4E3A;&#x4E86;&#x83B7;&#x5F97;&#x8F83;&#x597D;&#x7684;&#x5206;&#x7C7B;&#x6548;&#x679C;&#xFF0C;&#x6211;&#x4EEC;&#x5F80;&#x5F80;&#x9700;&#x8981;&#x5927;&#x91CF;&#x7684;&#x5E26;&#x6807;&#x7B7E;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x4EE5;&#x8FDB;&#x884C;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5F88;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x6570;&#x636E;&#x4E0D;&#x662F;&#x5F88;&#x597D;&#x641E;&#xFF0C;&#x8FD9;&#x5C31;&#x9700;&#x8981;&#x52A8;&#x8111;&#x7B4B;&#x4E86;&#x3002;</p>
<h3 id="&#x5BFB;&#x627E;&#x6D77;&#x91CF;&#x6570;&#x636E;&#x7684;&#x6765;&#x6E90;"><a href="#&#x5BFB;&#x627E;&#x6D77;&#x91CF;&#x6570;&#x636E;&#x7684;&#x6765;&#x6E90;" class="headerlink" title="&#x5BFB;&#x627E;&#x6D77;&#x91CF;&#x6570;&#x636E;&#x7684;&#x6765;&#x6E90;"></a>&#x5BFB;&#x627E;&#x6D77;&#x91CF;&#x6570;&#x636E;&#x7684;&#x6765;&#x6E90;</h3><p>&#x6709;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x4E00;&#x4E9B;&#x65B0;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x7684;&#x6765;&#x6E90;&#x3002;</p>
<p>&#x4EE5;OCR&#x95EE;&#x9898;&#x4E3A;&#x4F8B;&#xFF0C;&#x4E3A;&#x4E86;&#x66F4;&#x597D;&#x5730;&#x8BC6;&#x522B;&#x548C;&#x5224;&#x65AD;&#x6587;&#x5B57;&#xFF0C;&#x9700;&#x8981;&#x5927;&#x91CF;&#x6587;&#x5B57;&#x7684;&#x56FE;&#x7247;&#x3002;&#x56FE;&#x7247;&#x76F4;&#x63A5;&#x627E;&#x4E0D;&#x597D;&#x627E;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x8003;&#x8651;&#x65B0;&#x7684;&#x6587;&#x5B57;&#x56FE;&#x7247;&#x6765;&#x6E90;&#x3002;&#x6211;&#x4EEC;&#x76F4;&#x5230;&#x7CFB;&#x7EDF;&#x548C;&#x4E00;&#x4E9B;&#x529E;&#x516C;&#x8F6F;&#x4EF6;&#x5185;&#x90FD;&#x6709;&#x5F88;&#x591A;&#x5B57;&#x5E93;&#xFF0C;&#x800C;&#x7F51;&#x7EDC;&#x4E0A;&#x4E5F;&#x968F;&#x5904;&#x53EF;&#x89C1;&#x5927;&#x91CF;&#x5B57;&#x4F53;&#x7684;&#x5B57;&#x5E93;&#xFF0C;&#x90A3;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x5B57;&#x5E93;&#x8F6C;&#x6362;&#x6210;&#x56FE;&#x7247;&#x6765;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x4E00;&#x4E0B;&#x5B50;&#x5C31;&#x53C8;&#x6709;&#x4E86;&#x6D77;&#x91CF;&#x7684;&#x6587;&#x5B57;&#x56FE;&#x7247;&#x7528;&#x4E8E;&#x8BAD;&#x7EC3;&#x3002;</p>
<h3 id="&#x5408;&#x6210;&#x6570;&#x636E;"><a href="#&#x5408;&#x6210;&#x6570;&#x636E;" class="headerlink" title="&#x5408;&#x6210;&#x6570;&#x636E;"></a>&#x5408;&#x6210;&#x6570;&#x636E;</h3><p>&#x5F88;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x6570;&#x636E;&#x5E76;&#x4E0D;&#x662F;&#x80FD;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x83B7;&#x53D6;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x597D;&#x7684;&#x6570;&#x636E;&#x6765;&#x6E90;&#xFF0C;&#x90A3;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x201C;&#x4EE5;&#x6570;&#x636E;&#x751F;&#x6570;&#x636E;&#x201D;&#xFF0C;&#x901A;&#x8FC7;&#x7B97;&#x6CD5;&#x5408;&#x6210;&#x6570;&#x636E;&#x3002;</p>
<p>&#x600E;&#x4E48;&#x5408;&#x6210;&#x5462;&#xFF0C;&#x5F53;&#x7136;&#x4E0D;&#x662F;&#x778E;&#x5408;&#x6210;&#xFF0C;&#x800C;&#x662F;&#x5728;&#x73B0;&#x6709;&#x6570;&#x636E;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x6DFB;&#x52A0;&#x6270;&#x52A8;&#x6216;&#x8005;&#x53D8;&#x5F62;&#xFF0C;&#x751F;&#x6210;&#x65B0;&#x7684;&#x6570;&#x636E;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x5BF9;&#x4E8E;OCR&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5BF9;&#x56FE;&#x7247;&#x8FDB;&#x884C;&#x7FFB;&#x8F6C;&#xFF0C;&#x8FDB;&#x884C;&#x4E00;&#x5B9A;&#x53D8;&#x5F62;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x6DFB;&#x52A0;&#x4E00;&#x5B9A;&#x7684;&#x9AD8;&#x65AF;&#x566A;&#x58F0;&#xFF0C;&#x6765;&#x5F62;&#x6210;&#x65B0;&#x7684;&#x56FE;&#x7247;&#x3002;&#x518D;&#x4F8B;&#x5982;&#xFF0C;&#x5BF9;&#x4E8E;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5BF9;&#x4EBA;&#x58F0;&#x6765;&#x6DFB;&#x52A0;&#x4E0D;&#x540C;&#x7684;&#x80CC;&#x666F;&#x566A;&#x58F0;&#xFF0C;&#x6765;&#x589E;&#x5F3A;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#x7684;&#x6548;&#x679C;&#x3002;</p>
<p>&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x589E;&#x52A0;&#x8BAD;&#x7EC3;&#x96C6;&#x4E4B;&#x524D;&#x5148;&#x786E;&#x4FDD;&#x7A0B;&#x5E8F;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x4F4E;&#x504F;&#x5DEE;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<h3 id="&#x4EBA;&#x5DE5;&#x6807;&#x8BB0;"><a href="#&#x4EBA;&#x5DE5;&#x6807;&#x8BB0;" class="headerlink" title="&#x4EBA;&#x5DE5;&#x6807;&#x8BB0;"></a>&#x4EBA;&#x5DE5;&#x6807;&#x8BB0;</h3><p>&#x5BF9;&#x4E8E;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x4EC5;&#x9700;&#x8981;&#x539F;&#x59CB;&#x6570;&#x636E;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x7684;&#x6807;&#x7B7E;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x624B;&#x91CC;&#x6709;&#x5F88;&#x591A;&#x5F88;&#x591A;&#x5F88;&#x591A;&#x7684;&#x65E0;&#x6807;&#x7B7E;&#x6570;&#x636E;&#xFF0C;&#x6211;&#x4EEC;&#x53C8;&#x60F3;&#x7528;&#x4E0A;&#xFF0C;&#x90A3;&#x8BE5;&#x600E;&#x4E48;&#x529E;&#x5462;&#xFF1F;&#x7B54;&#x6848;&#x4E5F;&#x662F;&#x76F8;&#x5F53;&#x7B80;&#x5355;&#x7C97;&#x66B4;&#xFF0C;&#x4EBA;&#x5DE5;&#x6807;&#x8BB0;&#x561B;&#x3002;</p>
<p>&#x5F88;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x4EBA;&#x5DE5;&#x6807;&#x8BB0;&#x6570;&#x636E;&#x6240;&#x82B1;&#x7684;&#x6210;&#x672C;&#x662F;&#x8FDC;&#x5C0F;&#x4E8E;&#x6211;&#x4EEC;&#x7684;&#x9884;&#x671F;&#x7684;&#xFF0C;&#x5BF9;&#x4E8E;&#x4EBA;&#x5DE5;&#x6807;&#x8BB0;&#x6570;&#x636E;&#xFF0C;&#x8003;&#x8651;&#x4E00;&#x4E0B;&#x201C;&#x4EBA;&#x5DE5;&#x5904;&#x7406;&#x73B0;&#x5728;&#x624B;&#x4E2D;10&#x500D;&#x6570;&#x636E;&#x91CF;&#x7684;&#x7684;&#x6570;&#x636E;&#x9700;&#x8981;&#x82B1;&#x591A;&#x957F;&#x65F6;&#x95F4;&#x201D;&#xFF0C;&#x5982;&#x679C;&#x53D1;&#x73B0;&#x6210;&#x672C;&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x7684;&#xFF0C;&#x4E0D;&#x59A8;&#x8003;&#x8651;&#x4EBA;&#x5DE5;&#x6807;&#x8BB0;&#x6570;&#x636E;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6570;&#x636E;&#x7684;&#x89C4;&#x6A21;&#x8FC7;&#x5927;&#xFF0C;&#x8FDC;&#x8FDC;&#x8D85;&#x8FC7;&#x4E86;&#x51E0;&#x4E2A;&#x4EBA;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#xFF0C;&#x6211;&#x4EEC;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4EBA;&#x5DE5;&#x6807;&#x8BB0;&#x7684;&#x529E;&#x6CD5;&#x6765;&#x6807;&#x8BB0;&#x539F;&#x59CB;&#x6570;&#x636E;&#xFF0C;&#x89E3;&#x51B3;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x4F17;&#x5305;&#xFF0C;&#x5C31;&#x662F;&#x628A;&#x539F;&#x59CB;&#x6570;&#x636E;&#x5206;&#x53D1;&#x4E0B;&#x53BB;&#xFF0C;&#x8BA9;&#x597D;&#x591A;&#x4EBA;&#x4E00;&#x8D77;&#x6807;&#x8BB0;&#x3002;&#x8FD9;&#x65B9;&#x9762;&#x6700;&#x5178;&#x578B;&#x7684;&#x4F8B;&#x5B50;&#x5C31;&#x662F;&#x7ECF;&#x5178;&#x7684;reCAPTCHA&#x9A8C;&#x8BC1;&#x7801;&#xFF0C;&#x4F7F;&#x6211;&#x4EEC;&#x5728;&#x8F93;&#x5165;&#x9A8C;&#x8BC1;&#x7801;&#x7684;&#x540C;&#x65F6;&#x4E5F;&#x987A;&#x5E26;&#x5E2E;&#x52A9;&#x8C37;&#x6B4C;&#x53BB;&#x8BC6;&#x522B;&#x4E86;&#x5927;&#x91CF;&#x6587;&#x732E;&#x4E2D;&#x7684;&#x6587;&#x5B57;&#xFF0C;&#x73B0;&#x5728;&#x7684;reCAPTCHA 2.0&#x7248;&#x672C;&#x5DF2;&#x7ECF;&#x5F00;&#x59CB;&#x505A;&#x56FE;&#x50CF;&#x8BC6;&#x522B;&#x4E86;&#xFF0C;&#x8FD9;&#x79CD;&#x5229;&#x7528;&#x4EBA;&#x6C11;&#x7FA4;&#x4F17;&#x529B;&#x91CF;&#x7684;&#x529E;&#x6CD5;&#x6240;&#x53D6;&#x5F97;&#x7684;&#x6548;&#x679C;&#x4E5F;&#x662F;&#x5341;&#x5206;&#x663E;&#x8457;&#x7684;&#x3002;</p>
<p><br></p>
<h2 id="&#x4E0A;&#x9650;&#x5206;&#x6790;"><a href="#&#x4E0A;&#x9650;&#x5206;&#x6790;" class="headerlink" title="&#x4E0A;&#x9650;&#x5206;&#x6790;"></a>&#x4E0A;&#x9650;&#x5206;&#x6790;</h2><p>&#x901A;&#x8FC7;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6D41;&#x6C34;&#x7EBF;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5206;&#x6B65;&#x5730;&#x89E3;&#x51B3;&#x4E00;&#x4E2A;&#x590D;&#x6742;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x95EE;&#x9898;&#x3002;&#x7136;&#x800C;&#x5206;&#x6B65;&#x5B66;&#x4E60;&#x6240;&#x5E26;&#x6765;&#x7684;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x8C03;&#x8BD5;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x590D;&#x6742;&#x4E86;&#x3002;&#x4E00;&#x4E2A;&#x7B97;&#x6CD5;&#x80FD;&#x4E0D;&#x80FD;&#x7528;&#x4E8E;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x70B9;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x7684;&#x53C2;&#x6570;&#x6709;&#x591A;&#x5C11;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x90A3;&#x975E;&#x5E38;&#x5B8C;&#x7F8E;&#xFF0C;&#x6211;&#x4EEC;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x81EA;&#x52A8;&#x5316;&#x5730;&#x8C03;&#x6574;&#x8FD9;&#x4E2A;&#x53C2;&#x6570;&#x76F4;&#x5230;&#x6700;&#x4F18;&#xFF1B;&#x800C;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x6709;&#x597D;&#x591A;&#x53C2;&#x6570;&#xFF0C;&#x90A3;&#x5C31;&#x6BD4;&#x8F83;&#x9EBB;&#x70E6;&#x4E86;&#xFF0C;&#x5F53;&#x6548;&#x679C;&#x4E0D;&#x597D;&#x7684;&#x65F6;&#x5019;&#x6216;&#x8005;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x6539;&#x8FDB;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8C03;&#x54EA;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x8C03;&#x8FD9;&#x4E2A;&#x53C2;&#x6570;&#x4F1A;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x5176;&#x4ED6;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x8FD9;&#x90FD;&#x662F;&#x95EE;&#x9898;&#x3002;&#x5BF9;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E0A;&#x9650;&#x5206;&#x6790;&#x6765;&#x8FDB;&#x884C;&#x8C03;&#x6574;&#x3002;</p>
<p>&#x4EE5;OCR&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6D41;&#x6C34;&#x7EBF;&#x4E3A;&#x4F8B;&#xFF1A;</p>
<img src="/articles/8/pic5.png" alt="OCR&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6D41;&#x6C34;&#x7EBF;" title="OCR&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6D41;&#x6C34;&#x7EBF;">
<p>&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E00;&#x5171;&#x6709;&#x4E09;&#x4E2A;&#x90E8;&#x5206;&#x53EF;&#x4EE5;&#x8C03;&#x6574;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x8FD9;&#x79CD;&#x7B56;&#x7565;&#x8FDB;&#x884C;&#x5206;&#x6790;&#xFF1A;</p>
<ol>
<li>&#x8BA1;&#x7B97;&#x539F;&#x59CB;&#x7CFB;&#x7EDF;&#x7684;&#x51C6;&#x786E;&#x7387;&#x3002;</li>
<li>&#x901A;&#x8FC7;&#x4EBA;&#x5DE5;&#x8F85;&#x52A9;&#x6807;&#x6CE8;&#x7B49;&#x624B;&#x6BB5;&#xFF0C;&#x4F7F;&#x5B57;&#x6BCD;&#x5212;&#x5206;&#x90E8;&#x5206;&#x5F97;&#x5230;&#x7684;&#x6570;&#x636E;&#x662F;&#x5B8C;&#x5168;&#x6B63;&#x786E;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x7B49;&#x4E8E;&#x4F7F;&#x6587;&#x5B57;&#x8BC6;&#x522B;&#x90E8;&#x5206;&#x7684;&#x51C6;&#x786E;&#x7387;&#x5230;&#x8FBE;<code>%100\%%</code>&#xFF0C;&#x8BA1;&#x7B97;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x51C6;&#x786E;&#x7387;&#x3002;</li>
<li>&#x901A;&#x8FC7;&#x4EBA;&#x5DE5;&#x8F85;&#x52A9;&#x6807;&#x6CE8;&#x7B49;&#x624B;&#x6BB5;&#xFF0C;&#x4F7F;&#x5B57;&#x6BCD;&#x8BC6;&#x522B;&#x90E8;&#x5206;&#x5F97;&#x5230;&#x7684;&#x6570;&#x636E;&#x662F;&#x5B8C;&#x5168;&#x6B63;&#x786E;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x7B49;&#x4E8E;&#x4F7F;&#x5B57;&#x6BCD;&#x5212;&#x5206;&#x90E8;&#x5206;&#x7684;&#x51C6;&#x786E;&#x7387;&#x5230;&#x8FBE;<code>%100\%%</code>&#xFF0C;&#x8BA1;&#x7B97;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x51C6;&#x786E;&#x7387;&#x3002;</li>
<li>&#x901A;&#x8FC7;&#x4EBA;&#x5DE5;&#x8F85;&#x52A9;&#x6807;&#x6CE8;&#x7B49;&#x624B;&#x6BB5;&#xFF0C;&#x4F7F;&#x6700;&#x540E;&#x7684;&#x7ED3;&#x679C;&#x4F7F;&#x5B8C;&#x5168;&#x6B63;&#x786E;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x7B49;&#x4E8E;&#x4F7F;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x51C6;&#x786E;&#x7387;&#x5230;&#x8FBE;<code>%100\%%</code>&#x3002;</li>
</ol>
<p>&#x7136;&#x540E;&#x6BD4;&#x8F83;&#x524D;&#x56DB;&#x6B65;&#x7684;&#x51C6;&#x786E;&#x7387;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x6240;&#x9700;&#x8981;&#x6539;&#x8FDB;&#x5730;&#x65B9;&#x4E86;&#x3002;</p>
<p>&#x4E3E;&#x4F8B;&#x6765;&#x8BF4;&#xFF0C;&#x5047;&#x5982;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x5206;&#x6790;&#x5F97;&#x5230;&#x7684;&#x51C6;&#x786E;&#x7387;&#x5982;&#x4E0B;&#xFF1A;</p>
<div class="table-container">
<table>
<thead>
<tr>
<th>&#x51C6;&#x786E;&#x7387;&#x201C;&#x62C9;&#x6EE1;&#x201D;&#x7684;&#x90E8;&#x5206;</th>
<th>&#x7CFB;&#x7EDF;&#x51C6;&#x786E;&#x7387;</th>
</tr>
</thead>
<tbody>
<tr>
<td>&#x539F;&#x59CB;&#x7CFB;&#x7EDF;</td>
<td><script type="math/tex">72\%</script></td>
</tr>
<tr>
<td>&#x6587;&#x5B57;&#x8BC6;&#x522B;</td>
<td><script type="math/tex">89\%</script></td>
</tr>
<tr>
<td>&#x5B57;&#x6BCD;&#x5212;&#x5206;</td>
<td><script type="math/tex">90\%</script></td>
</tr>
<tr>
<td>&#x5B57;&#x6BCD;&#x8BC6;&#x522B;</td>
<td><script type="math/tex">100\%</script></td>
</tr>
</tbody>
</table>
</div>
<p>&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x6539;&#x8FDB;&#x6587;&#x5B57;&#x8BC6;&#x522B;&#x548C;&#x5B57;&#x6BCD;&#x8BC6;&#x522B;&#x6548;&#x76CA;&#x6700;&#x9AD8;&#xFF0C;&#x7559;&#x6709;&#x7684;&#x53EF;&#x63D0;&#x5347;&#x7A7A;&#x95F4;&#x4E5F;&#x5F88;&#x5927;&#xFF1B;&#x800C;&#x6539;&#x8FDB;&#x5B57;&#x6BCD;&#x5212;&#x5206;&#x90E8;&#x5206;&#x5BF9;&#x4E8E;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x6539;&#x8FDB;&#x5E2E;&#x52A9;&#x5E76;&#x4E0D;&#x5927;&#xFF0C;&#x54EA;&#x6015;&#x5B57;&#x6BCD;&#x5212;&#x5206;&#x7684;&#x51C6;&#x786E;&#x7387;&#x80FD;&#x591F;&#x5230;&#x8FBE;<script type="math/tex">100\%</script>&#xFF0C;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x51C6;&#x786E;&#x7387;&#x53EA;&#x4F1A;&#x63D0;&#x9AD8;<script type="math/tex">1\%</script>&#xFF0C;&#x8FD9;&#x663E;&#x7136;&#x4F7F;&#x4E8B;&#x500D;&#x529F;&#x534A;&#x7684;&#x3002;</p>
<p><br></p>
<h2 id="&#x603B;&#x7ED3;"><a href="#&#x603B;&#x7ED3;" class="headerlink" title="&#x603B;&#x7ED3;"></a>&#x603B;&#x7ED3;</h2><p>&#x8FD9;&#x5C31;&#x662F;&#x300A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x300B;&#x8FD9;&#x95E8;&#x8BFE;&#x7684;&#x5168;&#x90E8;&#x77E5;&#x8BC6;&#x70B9;&#x4E86;&#xFF0C;&#x4ECE;&#x5934;&#x5230;&#x5C3E;&#x8FD9;&#x4E48;&#x4E00;&#x8DEF;&#x770B;&#x4E0B;&#x6765;&#xFF0C;&#x89C9;&#x5F97;&#x8FD9;&#x95E8;&#x8BFE;&#x8FD9;&#x4E48;&#x706B;&#x5176;&#x5B9E;&#x4E5F;&#x662F;&#x6709;&#x9053;&#x7406;&#x7684;&#x3002;&#x603B;&#x7684;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x95E8;&#x8BFE;&#x786E;&#x5B9E;&#x5F88;&#x9002;&#x5408;&#x4F5C;&#x4E3A;&#x50CF;&#x6211;&#x8FD9;&#x6837;&#x96F6;&#x57FA;&#x7840;&#x7684;&#x5165;&#x95E8;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x7684;&#x7B2C;&#x4E00;&#x95E8;&#x8BFE;&#x3002;&#x8BB2;&#x7684;&#x5185;&#x5BB9;&#x5F88;&#x6D45;&#x663E;&#x4F46;&#x662F;&#x4E5F;&#x4E0D;&#x81F3;&#x4E8E;&#x8FC7;&#x4E8E;&#x7B80;&#x5355;&#xFF0C;&#x800C;&#x4E14;&#x8DB3;&#x591F;&#x62FF;&#x6765;&#x5E94;&#x4ED8;&#x4E00;&#x4E9B;&#x7B80;&#x5355;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x95EE;&#x9898;&#x4E86;&#x3002;</p>

      
    </div>

  </div>

  <div class="article-footer">
    <div class="article-meta pull-left">

    
      

    <span class="post-categories">
      <i class="icon-categories"></i>
        <a href="/categories/学习笔记/">学习笔记</a>
    </span>
    

    
    

    <span class="post-tags">
      <i class="icon-tags"></i>
        <a href="/tags/Coursera/">Coursera</a><a href="/tags/机器学习/">机器学习</a>
    </span>
    

    </div>

    
  </div>
</article>


    </main>

    <footer class="site-footer">
  <p class="site-info">
    Proudly powered by <a href="https://hexo.io/" target="_blank">Hexo</a> and
    Theme by <a href="https://github.com/kawaiiQ/kawaiiHacker" target="_blank">kawaiiHacker</a>
    </br>
    
    &copy; 2018 _kawaiiQ
    
  </p>
</footer>
    
    
<script>
  widget_settings = {
    maxDistance: 15,
    sensitive: 0.01
  };
</script>
<script src="/js/logo-widget.js"></script>



<script type="text/x-mathjax-config">
  MathJax.Hub.Config({
    tex2jax: {
      inlineMath: [['$','$'], ["\\(","\\)"] ],
      processEscapes: true
    }
  });
</script>
<script type="text/javascript" async
  src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/MathJax.js?config=TeX-MML-AM_CHTML">
</script>


  </div>
</div>
</body>
</html>