<!DOCTYPE HTML>
<html>
<head>
  <meta charset="utf-8">
  
  <title>简单讲讲，什么是贝叶斯决策？ | _kawaiiQ&#39;s blog</title>

  
  <meta name="author" content="_kawaiiQ">
  

  
  <meta name="description" content="&amp;#x8BDD;&amp;#x8BF4;&amp;#x8FD8;&amp;#x5728;&amp;#x5C71;&amp;#x79D1;&amp;#x7684;&amp;#x65F6;&amp;#x5019;&amp;#xFF0C;&amp;#x6211;&amp;#x53D1;&amp;#x73B0;&amp;#x8BA1;&amp;#x7B97;&amp;#x673A;&amp;#x4E13;&amp;#x4E1A;&amp;#x4E00;&amp;#x4E2A;&amp;#x5F88;&amp;#x6709;&amp;#x610F;&amp;#x601D;&amp;#x7684;&amp;#x73B0;&amp;#x8C61;&amp;#xFF0C;&amp;#x90A3;&amp;#x5C31;&amp;#x662F;&amp;#x9AD8;&amp;#x624B;&amp;#x4EEC;&amp;#x6700;&amp;#x7EC8;&amp;#x5F80;&amp;#x5F80;&amp;#x5206;&amp;#x5316;&amp;#x6210;&amp;#x4E24;&amp;#x6D3E;&amp;#xFF0C;&amp;#x4E00;&amp;#x6D3E;&amp;#x91CD;&amp;#x89C6;&amp;#x7406;&amp;#x8BBA;&amp;#x57FA;&amp;#x7840;&amp;#xFF0C;&amp;#x4E00;&amp;#x6D3E;&amp;#x91CD;&amp;#x89C6;&amp;#x5B9E;&amp;#x8DF5;&amp;#x80FD;&amp;#x529B;&amp;#x3002;&amp;#x7406;&amp;#x8BBA;&amp;#x6D3E;&amp;#x90FD;&amp;#x662F;&amp;#x5B66;&amp;#x795E;&amp;#x5B66;&amp;#x9738;&amp;#xFF0C;&amp;#x8003;&amp;#x8BD5;&amp;#x6781;&amp;#x5176;&amp;#x4F18;&amp;#x79C0;&amp;#xFF0C;&amp;#x6210;&amp;#x4E3A;&amp;#x5927;&amp;#x5BB6;&amp;#x505A;&amp;#x4F5C;&amp;#x4E1A;&amp;#x7684;&amp;#x597D;&amp;#x5E2E;&amp;#x624B;&amp;#xFF0C;&amp;#x4F46;&amp;#x662F;&amp;#x51E0;&amp;#x4E4E;&amp;#x4E00;&amp;#x884C;&amp;#x4EE3;&amp;#x7801;&amp;#x90FD;&amp;#x5199;&amp;#x4E0D;&amp;#x51FA;&amp;#x6765;&amp;#xFF1B;&amp;#x5B9E;&amp;#x8DF5;&amp;#x6D3E;&amp;#x6210;&amp;#x4E86;&amp;#x5927;&amp;#x795E;&amp;#x5927;&amp;#x4F6C;&amp;#xFF0C;&amp;#x4EE3;&amp;#x7801;&amp;#x80FD;&amp;#x529B;&amp;#x4E00;&amp;#x6D41;&amp;#xFF0C;&amp;#x8BFE;&amp;#x7A0B;&amp;#x8BBE;&amp;#x8BA1;&amp;#x5927;&amp;#x817F;&amp;#xFF0C;&amp;#x4F46;&amp;#x662F;&amp;#x8003;&amp;#x8BD5;&amp;#x5C31;&amp;#x5F98;&amp;#x5F8A;&amp;#x5728;&amp;#x53CA;&amp;#x683C;&amp;#x7EBF;&amp;#x9644;&amp;#x8FD1;&amp;#x3002;&amp;#x800C;&amp;#x4E14;&amp;#x4E24;&amp;#x8FB9;&amp;#x5F80;&amp;#x5F80;&amp;#x76F8;&amp;#x4E92;&amp;#x770B;&amp;#x4E0D;&amp;#x8D77;&amp;#x5BF9;&amp;#x65B9;&amp;#xFF0C;&amp;#x8FD9;&amp;#x8FB9;&amp;#x8BF4;&amp;#x4F60;&amp;#x5149;&amp;#x4F1A;&amp;#x5199;&amp;#x4EE3;&amp;#x7801;&amp;#x6280;&amp;#x6821;&amp;#x6C34;&amp;#x5E73;&amp;#x4E00;&amp;#x8F88;&amp;#x5B50;&amp;#x4E5F;&amp;#x5C31;&amp;#x642C;&amp;#x7816;&amp;#x7684;&amp;#x547D;&amp;#xFF0C;&amp;#x53E6;&amp;#x4E00;&amp;#x8FB9;&amp;#x5C31;&amp;#x8BF4;&amp;#x4F60;&amp;#x4EEC;&amp;#x5C31;&amp;#x662F;&amp;#x4E66;&amp;#x5446;&amp;#x5B50;&amp;#x5149;&amp;#x5403;&amp;#x4E66;&amp;#x5199;&amp;#x4E0D;&amp;#x51FA;&amp;#x4EE3;&amp;#x7801;&amp;#x6765;&amp;#x6709;&amp;#x5375;&amp;#x7528;&amp;#x3002;
&amp;#x4EC0;&amp;#x4E48;&amp;#xFF1F;&amp;#x4F60;&amp;#x95EE;&amp;#x6211;&amp;#x662F;&amp;#x90A3;&amp;#x4E00;&amp;#x6D3E;&amp;#xFF1F;&amp;#x6211;&amp;#x662F;&amp;#x5B66;&amp;#x6E23;&amp;#x554A;&amp;#x3002;

&amp;#x4E0D;&amp;#x8FC7;&amp;#x5766;&amp;#x7387;&amp;#x5730;&amp;#x8BB2;&amp;#xFF0C;&amp;#x6211;&amp;#x7B97;&amp;#x662F;&amp;#x7A0D;&amp;#x5FAE;&amp;#x504F;&amp;#x5411;&amp;#x5B9E;&amp;#x8DF5;&amp;#x6D3E;&amp;#x90A3;&amp;#x8FB9;&amp;#x7684;&amp;#xFF0C;&amp;#x6240;&amp;#x4EE5;&amp;#x7406;&amp;#x8BBA;&amp;#x6C34;&amp;#x5E73;&amp;#x76F8;&amp;#x5BF9;&amp;#x5C31;&amp;#x6BD4;&amp;#x8F83;&amp;#x5F31;&amp;#x9E21;&amp;#xFF0C;&amp;#x6211;&amp;#x4E2A;&amp;#x4EBA;&amp;#x4E5F;&amp;#x6BD4;&amp;#x8F83;&amp;#x503E;&amp;#x5411;&amp;#x4E8E;&amp;#x5199;&amp;#x4EE3;&amp;#x7801;&amp;#x800C;&amp;#x4E0D;&amp;#x662F;&amp;#x63A8;&amp;#x516C;&amp;#x5F0F;&amp;#x3002;&amp;#x7ED3;&amp;#x679C;&amp;#x4E0A;&amp;#x5B66;&amp;#x671F;&amp;#x6A21;&amp;#x5F0F;&amp;#x8BC6;&amp;#x522B;&amp;#x4E0E;&amp;#x673A;&amp;#x5668;&amp;#x5B66;&amp;#x4E60;&amp;#x90A3;&amp;#x95E8;&amp;#x8BFE;&amp;#xFF0C;&amp;#x672C;&amp;#x6765;&amp;#x4EE5;&amp;#x4E3A;&amp;#x662F;&amp;#x8BB2;&amp;#x5B9E;&amp;#x8DF5;&amp;#x8DDF;&amp;#x5E94;&amp;#x7528;&amp;#xFF0C;&amp;#x5C31;&amp;#x50CF;&amp;#x672C;&amp;#x79D1;&amp;#x90A3;&amp;#x6837;&amp;#xFF0C;&amp;#x7ED3;&amp;#x679C;&amp;#x4E00;&amp;#x4E0A;&amp;#x6765;&amp;#x8BB2;&amp;#x8D1D;&amp;#x53F6;&amp;#x65AF;&amp;#x51B3;&amp;#x7B56;&amp;#xFF0C;&amp;#x76F4;&amp;#x63A5;&amp;#x5728;&amp;#x6CA1;&amp;#x6709;&amp;#x4E00;&amp;#x70B9;&amp;#x70B9;&amp;#x9632;&amp;#x5907;&amp;#x7684;&amp;#x60C5;&amp;#x51B5;&amp;#x4E0B;&amp;#x88AB;&amp;#x516C;&amp;#x5F0F;&amp;#x9A91;&amp;#x8138;&amp;#xFF0C;&amp;#x516C;&amp;#x5F0F;&amp;#x9A91;&amp;#x8138;&amp;#x600E;&amp;#x4E48;&amp;#x8F93;&amp;#xFF1F;&amp;#x4E8E;&amp;#x662F;&amp;#x5FC3;&amp;#x6001;&amp;#x5C31;&amp;#x5D29;&amp;#x4E86;&amp;#xFF0C;&amp;#x4E8E;&amp;#x662F;&amp;#x671F;&amp;#x672B;&amp;#x8003;&amp;#x8BD5;&amp;#x5C31;&amp;#x5D29;&amp;#x76D8;&amp;#x4E86;&amp;#x2026;&amp;#x2026;
&amp;#x4F46;&amp;#x8001;&amp;#x5B9E;&amp;#x8BF4;&amp;#xFF0C;&amp;#x8D1D;&amp;#x53F6;&amp;#x65AF;&amp;#x51B3;&amp;#x7B56;&amp;#x5176;&amp;#x5B9E;&amp;#x5E76;&amp;#x4E0D;&amp;#x662F;&amp;#x591A;&amp;#x96BE;&amp;#x7684;&amp;#x4E1C;&amp;#x897F;&amp;#xFF0C;&amp;#x5F53;&amp;#x521D;&amp;#x4E5F;&amp;#x662F;&amp;#x4E00;&amp;#x5F00;&amp;#x59CB;&amp;#x6CA1;&amp;#x9002;&amp;#x5E94;&amp;#x516C;&amp;#x5F0F;&amp;#x9A91;&amp;#x8138;&amp;#x7684;&amp;#x5B66;&amp;#x4E60;&amp;#x65B9;&amp;#x5F0F;&amp;#xFF08;&amp;#x55EF;&amp;#xFF0C;&amp;#x6211;&amp;#x7684;&amp;#x7529;&amp;#x9505;&amp;#x80FD;&amp;#x529B;&amp;#x4E00;&amp;#x6D41;&amp;#xFF09;&amp;#x3002;&amp;#x90A3;&amp;#x8FD9;&amp;#x4E00;&amp;#x6B21;&amp;#xFF0C;&amp;#x6211;&amp;#x4EEC;&amp;#x5C31;&amp;#x6765;&amp;#x770B;&amp;#x770B;&amp;#xFF0C;&amp;#x8D1D;&amp;#x53F6;&amp;#x65AF;&amp;#x51B3;&amp;#x7B56;&amp;#x5230;&amp;#x5E95;&amp;#x662F;&amp;#x4EC0;&amp;#x4E48;&amp;#x3002;">
  

  
  
  <meta name="keywords" content="机器学习,模式识别,统计决策">
  

  <meta id="viewport" name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no, minimal-ui">
  <meta name="apple-mobile-web-app-capable" content="yes">
  <meta name="apple-mobile-web-app-status-bar-style" content="black">

  <meta property="og:title" content="简单讲讲，什么是贝叶斯决策？"/>

  <meta property="og:site_name" content="_kawaiiQ&#39;s blog"/>

  
  <meta property="og:image" content="/favicon.ico"/>
  

  <link href="/favicon.ico" rel="icon">
  <link rel="alternate" href="/atom.xml" title="_kawaiiQ&#39;s blog" type="application/atom+xml">
  <link rel="stylesheet" href="/css/style.css" media="screen" type="text/css">

  <link rel="dns-prefetch" href="https://cdnjs.cloudflare.com" />

</head>


<body>
<div class="blog">
  <div class="content">

    <header>
  <div class="site-branding">
    <h1 class="site-logo">
      <div>
        <a href="/"><img src="/images/logo.png" /></a>
        
          <a href="/"><img id="logo-widget" src="/images/widget.png" /></a>
        
      </div>
    </h1>
    <p class="site-description">Blind Busy All Day</p>
  </div>
  <nav class="site-navigation">
    <ul>
      
        <li><a href="/">主页</a></li>
      
        <li><a href="/categories">分类</a></li>
      
        <li><a href="/archives">所有文章</a></li>
      
        <li><a href="/about">关于我</a></li>
      
    </ul>
  </nav>
</header>

    <main class="site-main posts-loop">
    <article>

  
    
    <h3 class="article-title"><span>简单讲讲，什么是贝叶斯决策？</span></h3>
    
  

  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/articles/12/" rel="bookmark">
        <time class="entry-date published" datetime="2018-03-08T13:59:47.000Z">
          2018-03-08
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <p>&#x8BDD;&#x8BF4;&#x8FD8;&#x5728;&#x5C71;&#x79D1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x53D1;&#x73B0;&#x8BA1;&#x7B97;&#x673A;&#x4E13;&#x4E1A;&#x4E00;&#x4E2A;&#x5F88;&#x6709;&#x610F;&#x601D;&#x7684;&#x73B0;&#x8C61;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x9AD8;&#x624B;&#x4EEC;&#x6700;&#x7EC8;&#x5F80;&#x5F80;&#x5206;&#x5316;&#x6210;&#x4E24;&#x6D3E;&#xFF0C;&#x4E00;&#x6D3E;&#x91CD;&#x89C6;&#x7406;&#x8BBA;&#x57FA;&#x7840;&#xFF0C;&#x4E00;&#x6D3E;&#x91CD;&#x89C6;&#x5B9E;&#x8DF5;&#x80FD;&#x529B;&#x3002;&#x7406;&#x8BBA;&#x6D3E;&#x90FD;&#x662F;&#x5B66;&#x795E;&#x5B66;&#x9738;&#xFF0C;&#x8003;&#x8BD5;&#x6781;&#x5176;&#x4F18;&#x79C0;&#xFF0C;&#x6210;&#x4E3A;&#x5927;&#x5BB6;&#x505A;&#x4F5C;&#x4E1A;&#x7684;&#x597D;&#x5E2E;&#x624B;&#xFF0C;&#x4F46;&#x662F;&#x51E0;&#x4E4E;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#x90FD;&#x5199;&#x4E0D;&#x51FA;&#x6765;&#xFF1B;&#x5B9E;&#x8DF5;&#x6D3E;&#x6210;&#x4E86;&#x5927;&#x795E;&#x5927;&#x4F6C;&#xFF0C;&#x4EE3;&#x7801;&#x80FD;&#x529B;&#x4E00;&#x6D41;&#xFF0C;&#x8BFE;&#x7A0B;&#x8BBE;&#x8BA1;&#x5927;&#x817F;&#xFF0C;&#x4F46;&#x662F;&#x8003;&#x8BD5;&#x5C31;&#x5F98;&#x5F8A;&#x5728;&#x53CA;&#x683C;&#x7EBF;&#x9644;&#x8FD1;&#x3002;&#x800C;&#x4E14;&#x4E24;&#x8FB9;&#x5F80;&#x5F80;&#x76F8;&#x4E92;&#x770B;&#x4E0D;&#x8D77;&#x5BF9;&#x65B9;&#xFF0C;&#x8FD9;&#x8FB9;&#x8BF4;&#x4F60;&#x5149;&#x4F1A;&#x5199;&#x4EE3;&#x7801;&#x6280;&#x6821;&#x6C34;&#x5E73;&#x4E00;&#x8F88;&#x5B50;&#x4E5F;&#x5C31;&#x642C;&#x7816;&#x7684;&#x547D;&#xFF0C;&#x53E6;&#x4E00;&#x8FB9;&#x5C31;&#x8BF4;&#x4F60;&#x4EEC;&#x5C31;&#x662F;&#x4E66;&#x5446;&#x5B50;&#x5149;&#x5403;&#x4E66;&#x5199;&#x4E0D;&#x51FA;&#x4EE3;&#x7801;&#x6765;&#x6709;&#x5375;&#x7528;&#x3002;</p>
<p>&#x4EC0;&#x4E48;&#xFF1F;&#x4F60;&#x95EE;&#x6211;&#x662F;&#x90A3;&#x4E00;&#x6D3E;&#xFF1F;&#x6211;&#x662F;&#x5B66;&#x6E23;&#x554A;&#x3002;</p>
<p><img src="/images/01.jpg" alt=""></p>
<p>&#x4E0D;&#x8FC7;&#x5766;&#x7387;&#x5730;&#x8BB2;&#xFF0C;&#x6211;&#x7B97;&#x662F;&#x7A0D;&#x5FAE;&#x504F;&#x5411;&#x5B9E;&#x8DF5;&#x6D3E;&#x90A3;&#x8FB9;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x7406;&#x8BBA;&#x6C34;&#x5E73;&#x76F8;&#x5BF9;&#x5C31;&#x6BD4;&#x8F83;&#x5F31;&#x9E21;&#xFF0C;&#x6211;&#x4E2A;&#x4EBA;&#x4E5F;&#x6BD4;&#x8F83;&#x503E;&#x5411;&#x4E8E;&#x5199;&#x4EE3;&#x7801;&#x800C;&#x4E0D;&#x662F;&#x63A8;&#x516C;&#x5F0F;&#x3002;&#x7ED3;&#x679C;&#x4E0A;&#x5B66;&#x671F;&#x6A21;&#x5F0F;&#x8BC6;&#x522B;&#x4E0E;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x90A3;&#x95E8;&#x8BFE;&#xFF0C;&#x672C;&#x6765;&#x4EE5;&#x4E3A;&#x662F;&#x8BB2;&#x5B9E;&#x8DF5;&#x8DDF;&#x5E94;&#x7528;&#xFF0C;&#x5C31;&#x50CF;&#x672C;&#x79D1;&#x90A3;&#x6837;&#xFF0C;&#x7ED3;&#x679C;&#x4E00;&#x4E0A;&#x6765;&#x8BB2;&#x8D1D;&#x53F6;&#x65AF;&#x51B3;&#x7B56;&#xFF0C;&#x76F4;&#x63A5;&#x5728;&#x6CA1;&#x6709;&#x4E00;&#x70B9;&#x70B9;&#x9632;&#x5907;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x88AB;&#x516C;&#x5F0F;&#x9A91;&#x8138;&#xFF0C;&#x516C;&#x5F0F;&#x9A91;&#x8138;&#x600E;&#x4E48;&#x8F93;&#xFF1F;&#x4E8E;&#x662F;&#x5FC3;&#x6001;&#x5C31;&#x5D29;&#x4E86;&#xFF0C;&#x4E8E;&#x662F;&#x671F;&#x672B;&#x8003;&#x8BD5;&#x5C31;&#x5D29;&#x76D8;&#x4E86;&#x2026;&#x2026;</p>
<p>&#x4F46;&#x8001;&#x5B9E;&#x8BF4;&#xFF0C;&#x8D1D;&#x53F6;&#x65AF;&#x51B3;&#x7B56;&#x5176;&#x5B9E;&#x5E76;&#x4E0D;&#x662F;&#x591A;&#x96BE;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5F53;&#x521D;&#x4E5F;&#x662F;&#x4E00;&#x5F00;&#x59CB;&#x6CA1;&#x9002;&#x5E94;&#x516C;&#x5F0F;&#x9A91;&#x8138;&#x7684;&#x5B66;&#x4E60;&#x65B9;&#x5F0F;&#xFF08;&#x55EF;&#xFF0C;&#x6211;&#x7684;&#x7529;&#x9505;&#x80FD;&#x529B;&#x4E00;&#x6D41;&#xFF09;&#x3002;&#x90A3;&#x8FD9;&#x4E00;&#x6B21;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x6765;&#x770B;&#x770B;&#xFF0C;&#x8D1D;&#x53F6;&#x65AF;&#x51B3;&#x7B56;&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#x3002;</p>
<a id="more"></a>
<h2 id="&#x4ECE;&#x4E00;&#x4E2A;&#x516C;&#x5F0F;&#x5F00;&#x59CB;"><a href="#&#x4ECE;&#x4E00;&#x4E2A;&#x516C;&#x5F0F;&#x5F00;&#x59CB;" class="headerlink" title="&#x4ECE;&#x4E00;&#x4E2A;&#x516C;&#x5F0F;&#x5F00;&#x59CB;"></a>&#x4ECE;&#x4E00;&#x4E2A;&#x516C;&#x5F0F;&#x5F00;&#x59CB;</h2><p>&#x65B0;&#x65F6;&#x4EE3;&#x5C31;&#x662F;&#x597D;&#xFF0C;&#x751F;&#x7537;&#x751F;&#x5973;&#x90FD;&#x662F;&#x5B9D;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8FD1;&#x6765;&#x5374;&#x51FA;&#x73B0;&#x4E86;&#x4E00;&#x4E9B;&#x5947;&#x602A;&#x7684;<span class="heimu" title="&#x5BCC;&#x5F3A;&#x6C11;&#x4E3B;&#x6587;&#x660E;&#x548C;&#x8C10;">&#x91CC;&#x756A;</span>&#x4F5C;&#x54C1;&#xFF0C;&#x5728;&#x8FD9;&#x4E9B;&#x4F5C;&#x54C1;&#x7684;&#x4E16;&#x754C;&#x91CC;&#xFF0C;&#x5F80;&#x5F80;&#x56E0;&#x4E3A;&#x67D0;&#x4E9B;&#x5947;&#x602A;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x7537;&#x5973;&#x6BD4;&#x4F8B;&#x51FA;&#x73B0;&#x4E86;&#x6781;&#x5176;&#x4E25;&#x91CD;&#x7684;&#x4E0D;&#x5E73;&#x8861;&#xFF0C;&#x4ECE;&#x800C;&#x5BFC;&#x81F4;&#x4E86;&#x2026;&#x2026;&#x54B3;&#x54B3;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x5C11;&#x770B;&#x90A3;&#x4E9B;&#x5947;&#x602A;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x591A;&#x5B66;&#x4E60;&#x79D1;&#x5B66;&#x77E5;&#x8BC6;&#x3002;&#x90A3;&#x5047;&#x8BBE;&#x5728;&#x4E00;&#x4E2A;&#x5982;&#x6B64;&#x5947;&#x602A;&#x7684;&#x4E16;&#x754C;&#x91CC;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x5F85;&#x4EA7;&#x7684;&#x5B55;&#x5987;&#xFF0C;&#x90A3;&#x4E48;&#x8BF7;&#x9884;&#x6D4B;&#x4E00;&#x4E0B;&#x5979;&#x751F;&#x4E0B;&#x7684;&#x5B69;&#x5B50;&#x7684;&#x6027;&#x522B;&#x3002;</p>
<p>&#x5728;&#x6570;&#x5B66;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x7528;<script type="math/tex">P(x)</script>&#x6765;&#x8868;&#x793A;&#x201C;&#x4E8B;&#x4EF6;<script type="math/tex">x</script>&#x53D1;&#x751F;&#x7684;&#x6982;&#x7387;&#x201D;&#x3002;&#x90A3;&#x4E48;&#x5BF9;&#x5E94;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x9996;&#x5148;&#x6211;&#x4EEC;&#x7528;<script type="math/tex">\omega_1</script>&#x8868;&#x793A;&#x7537;&#x5B69;&#x8FD9;&#x4E2A;&#x7C7B;&#x522B;&#xFF0C;<script type="math/tex">\omega_2</script>&#x8868;&#x793A;&#x5973;&#x5B69;&#x8FD9;&#x4E2A;&#x7C7B;&#x522B;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x7528;<script type="math/tex">P(\omega_1)</script>&#x8868;&#x793A;&#x751F;&#x7537;&#x5B69;&#x7684;&#x6982;&#x7387;&#xFF0C;&#x7528;<script type="math/tex">P(\omega_2)</script>&#x8868;&#x793A;&#x751F;&#x5973;&#x5B69;&#x7684;&#x6982;&#x7387;&#x3002;&#x8FD9;&#x4E2A;&#x6982;&#x7387;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5927;&#x6570;&#x636E;&#xFF0C;&#x6BD4;&#x5982;&#x5168;&#x4E16;&#x754C;&#x65B0;&#x751F;&#x513F;&#x51FA;&#x751F;&#x60C5;&#x51B5;&#x7EDF;&#x8BA1;&#x5F97;&#x5230;&#x3002;&#x524D;&#x9762;&#x8BF4;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x5B58;&#x5728;&#x7740;&#x4E25;&#x91CD;&#x7684;&#x6027;&#x522B;&#x6BD4;&#x4F8B;&#x5931;&#x8C03;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x9009;&#x62E9;&#x6982;&#x7387;&#x66F4;&#x5927;&#x7684;&#x90A3;&#x4E2A;&#x663E;&#x7136;&#x66F4;&#x6709;&#x628A;&#x63E1;&#x3002;&#x6BD4;&#x5982;&#xFF0C;<script type="math/tex">P(\omega_1) \gt P(\omega_2)</script>&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;&#x9884;&#x6D4B;&#x751F;&#x4E0B;&#x7537;&#x5B69;&#x66F4;&#x6709;&#x628A;&#x63E1;&#x4E00;&#x70B9;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x6982;&#x7387;&#x5B9E;&#x9645;&#x4E0A;&#x8868;&#x793A;&#x7684;&#x662F;&#x201C;&#x5927;&#x73AF;&#x5883;&#x201D;&#x4E2D;&#x7684;&#x6982;&#x7387;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x9762;&#x524D;&#x7684;&#x5B55;&#x5987;&#x65E0;&#x8BBA;&#x662F;&#x8C01;&#xFF0C;&#x90FD;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x6211;&#x4EEC;&#x7684;&#x6982;&#x7387;&#x503C;&#xFF0C;&#x6982;&#x7387;&#x503C;&#x662F;&#x6052;&#x5B9A;&#x7684;&#xFF0C;&#x800C;&#x6211;&#x4EEC;&#x636E;&#x6B64;&#x4F5C;&#x51FA;&#x7684;&#x9884;&#x6D4B;&#x4E5F;&#x90FD;&#x662F;&#x76F8;&#x540C;&#x7684;&#x3002;&#x8FD9;&#x79CD;&#x6982;&#x7387;&#x53EB;&#x505A;<strong>&#x5148;&#x9A8C;&#x6982;&#x7387;(A Priori Probability)</strong>&#x3002;</p>
<p>&#x7136;&#x800C;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x5F53;&#x5E73;&#x6210;&#x5E9F;&#x7269;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x56DE;&#x5230;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x4E2D;&#x6765;&#x3002;&#x5728;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x4E2D;&#xFF0C;&#x751F;&#x7537;&#x751F;&#x5973;&#x7684;&#x6982;&#x7387;&#x51E0;&#x4E4E;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x90A3;&#x6211;&#x4EEC;&#x5C31;&#x5F88;&#x96BE;&#x4F5C;&#x51FA;&#x9884;&#x6D4B;&#x3002;&#x90A3;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x5176;&#x4ED6;&#x7684;&#x7279;&#x5F81;&#x6765;&#x8F85;&#x52A9;&#x6211;&#x4EEC;&#x505A;&#x51FA;&#x9884;&#x6D4B;&#x3002;&#x4FD7;&#x8BDD;&#x8BF4;&#x5F97;&#x597D;&#xFF0C;&#x9178;&#x513F;&#x8FA3;&#x5973;&#xFF0C;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x6709;&#x4E00;&#x4E2A;&#x7231;&#x5403;&#x8FA3;&#x7684;&#x5B55;&#x5987;&#xFF0C;&#x8BF7;&#x9884;&#x6D4B;&#x4E00;&#x4E0B;&#x5979;&#x751F;&#x4E0B;&#x7684;&#x5B69;&#x5B50;&#x7684;&#x6027;&#x522B;&#x3002;</p>
<p>&#x6570;&#x5B66;&#x4E0A;&#x4F1A;&#x7528;<script type="math/tex">P(a|b)</script>&#x8868;&#x793A;&#x201C;&#x5728;&#x4E8B;&#x4EF6;<script type="math/tex">b</script>&#x53D1;&#x751F;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x4E8B;&#x4EF6;<script type="math/tex">a</script>&#x7684;&#x6982;&#x7387;&#x201D;&#xFF0C;&#x3002;&#x56DE;&#x5230;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x7528;<script type="math/tex">x</script>&#x8868;&#x793A;&#x5B55;&#x5987;&#x7684;&#x53E3;&#x5473;&#xFF0C;&#x5373;&#x662F;&#x5B55;&#x5987;&#x7231;&#x5403;&#x8FA3;&#x8FD8;&#x662F;&#x7231;&#x5403;&#x9178;&#xFF0C;&#x90A3;&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x6BD4;&#x8F83;&#x7684;&#x5C31;&#x662F;<script type="math/tex">P(\omega_1|x)</script>&#x548C;<script type="math/tex">P(\omega_2|x)</script>&#x4E24;&#x4E2A;&#x6982;&#x7387;&#x503C;&#xFF0C;&#x5373;&#x5B55;&#x5987;&#x5728;&#x7231;&#x5403;&#x8FA3;&#x6216;&#x7231;&#x5403;&#x9178;&#x7684;&#x6761;&#x4EF6;&#x4E0B;&#x751F;&#x4E0B;&#x7537;&#x5B69;&#x6216;&#x5973;&#x5B69;&#x7684;&#x6982;&#x7387;&#x3002;&#x8FD9;&#x79CD;&#x6982;&#x7387;&#x591A;&#x4E86;&#x4E00;&#x6761;&#x7AD6;&#x7EBF;<script type="math/tex">|</script>&#xFF0C;&#x8868;&#x793A;&#x4E86;&#x6982;&#x7387;&#x53D1;&#x751F;&#x7684;&#x6761;&#x4EF6;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x9884;&#x6D4B;&#x662F;&#x4F1A;&#x968F;&#x7740;<script type="math/tex">x</script>&#x800C;&#x6539;&#x53D8;&#x7684;&#xFF0C;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x540E;&#x9A8C;&#x6982;&#x7387;(A Posterior Probability)</strong>&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x73B0;&#x5728;&#x95EE;&#x9898;&#x6765;&#x4E86;&#xFF0C;&#x5F62;&#x5982;<script type="math/tex">P(\omega_i|x)</script>&#x8FD9;&#x79CD;&#x7684;&#x540E;&#x9A8C;&#x6982;&#x7387;&#x5F80;&#x5F80;&#x5F88;&#x96BE;&#x8BA1;&#x7B97;&#x3002;&#x5373;&#x4FBF;&#x662F;&#x7B80;&#x5355;&#x5982;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x8BA1;&#x7B97;&#x201C;&#x7231;&#x5403;&#x8FA3;&#x7684;&#x5B55;&#x5987;&#x5269;&#x4E0B;&#x7537;&#x5B69;&#x7684;&#x6982;&#x7387;&#x201D;&#x5F80;&#x5F80;&#x7EDF;&#x8BA1;&#x8D77;&#x6765;&#x8981;&#x4E5F;&#x662F;&#x8981;&#x5148;&#x7EDF;&#x8BA1;&#x201C;&#x751F;&#x4E0B;&#x7537;&#x5B69;&#x7684;&#x5B55;&#x5987;&#x7231;&#x5403;&#x8FA3;&#x7684;&#x6982;&#x7387;&#x201D;&#x548C;&#x201C;&#x751F;&#x4E0B;&#x5973;&#x5B69;&#x7684;&#x5B55;&#x5987;&#x7231;&#x5403;&#x8FA3;&#x7684;&#x6982;&#x7387;&#x201D;&#x7136;&#x540E;&#x5012;&#x8FC7;&#x6765;&#x7B97;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x60F3;&#x66F4;&#x5168;&#x9762;&#x4E00;&#x70B9;&#xFF0C;&#x52A0;&#x4E0A;&#x201C;&#x7231;&#x5403;&#x54B8;&#x201D;&#x3001;&#x201C;&#x7231;&#x5403;&#x82E6;&#x201D;&#x8FD9;&#x6837;&#x66F4;&#x591A;&#x7684;&#x53E3;&#x5473;&#xFF0C;&#x7136;&#x540E;&#x9664;&#x4E86;&#x7537;&#x5B69;&#x5973;&#x5B69;&#x518D;&#x52A0;&#x4E0A;&#x4E0D;&#x786E;&#x5B9A;&#x6216;&#x8005;&#x53CC;&#x6027;&#x4EBA;&#x8FD9;&#x6837;&#x7684;&#x5206;&#x7C7B;&#xFF0C;&#x663E;&#x7136;&#x5C31;&#x66F4;&#x590D;&#x6742;&#x4E86;&#x3002;&#x800C;&#x5F88;&#x591A;&#x5176;&#x4ED6;&#x60C5;&#x51B5;&#x7684;&#x7EDF;&#x8BA1;&#x5F80;&#x5F80;&#x66F4;&#x96BE;&#xFF0C;&#x751A;&#x81F3;&#x65E0;&#x6CD5;&#x8BA1;&#x7B97;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x5927;&#x540D;&#x9F0E;&#x9F0E;&#x7684;<strong>&#x8D1D;&#x53F6;&#x65AF;&#x516C;&#x5F0F;(Bayes&#x2019;formula &#x6216;&#x8005; Bayesian Theorem)</strong>&#x3002;&#x6572;&#x9ED1;&#x677F;&#x5212;&#x91CD;&#x70B9;&#xFF0C;&#x4E00;&#x5207;&#x90FD;&#x662F;&#x4EE5;&#x8FD9;&#x4E2A;&#x516C;&#x5F0F;&#x4E3A;&#x6838;&#x5FC3;&#x7684;&#xFF0C;&#x4E3A;</p>
<script type="math/tex; mode=display">P(\omega_i|x) = \frac{p(x,\omega_i)}{p(x)} = \frac{p(x|\omega_i)P(\omega_i)}{p(x)}</script><p>&#x5728;&#x4E0A;&#x9762;&#x7684;&#x516C;&#x5F0F;&#x91CC;&#xFF0C;<script type="math/tex">P(\omega_i)</script>&#x662F;&#x540E;&#x9A8C;&#x6982;&#x7387;&#xFF1B;<script type="math/tex">p(x,\omega_i)</script>&#x662F;<script type="math/tex">x</script>&#x4E0E;<script type="math/tex">\omega_i</script>&#x7684;<strong>&#x8054;&#x5408;&#x6982;&#x7387;&#x5BC6;&#x5EA6;</strong>&#xFF1B;<script type="math/tex">p(x)</script>&#x662F;&#x5B55;&#x5987;&#x6240;&#x6709;&#x53E3;&#x5473;&#x7684;&#x6982;&#x7387;&#x5BC6;&#x5EA6;&#xFF0C;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x603B;&#x4F53;&#x5BC6;&#x5EA6;</strong>&#xFF1B;&#x800C;<script type="math/tex">p(x|\omega_i)</script>&#x662F;&#x5B55;&#x5987;&#x5728;&#x751F;&#x51FA;&#x5BF9;&#x5E94;&#x6027;&#x522B;&#x5B9D;&#x5B9D;&#x7684;&#x6761;&#x4EF6;&#x4E0B;&#x6240;&#x6709;&#x53E3;&#x5473;&#x7684;&#x6982;&#x7387;&#x5BC6;&#x5EA6;&#xFF0C;&#x79F0;&#x4E3A;<strong>&#x7C7B;&#x6761;&#x4EF6;&#x5BC6;&#x5EA6;</strong>&#xFF0C;&#x5B83;&#x53CD;&#x6620;&#x4E86;&#x5728;<script type="math/tex">\omega_i</script>&#x7C7B;&#x4E2D;&#x89C2;&#x5BDF;&#x5230;<script type="math/tex">x</script>&#x7684;<strong>&#x76F8;&#x5BF9;&#x53EF;&#x80FD;&#x6027;(likelihod)</strong>&#x3002;</p>
<p>&#x8FD9;&#x6837;&#xFF0C;&#x901A;&#x8FC7;&#x8D1D;&#x53F6;&#x65AF;&#x516C;&#x5F0F;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x5C06;&#x540E;&#x9A8C;&#x6982;&#x7387;&#x8F6C;&#x6362;&#x4E3A;&#x4E86;&#x5148;&#x9A8C;&#x6982;&#x7387;&#x548C;&#x7C7B;&#x6761;&#x4EF6;&#x5BC6;&#x5EA6;&#x7684;&#x6210;&#x7EE9;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x9664;&#x4EE5;&#x603B;&#x4F53;&#x5BC6;&#x5EA6;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x8981;&#x6BD4;&#x8F83;&#x7684;&#xFF0C;&#x5C31;&#x662F;<script type="math/tex">\frac{p(x|\omega_1)P(\omega_1)}{p(x)}</script>&#x548C;<script type="math/tex">\frac{p(x|\omega_2)P(\omega_2)}{p(x)}</script>&#x4E86;&#x3002;&#x6CE8;&#x610F;&#x5230;&#xFF0C;&#x4E24;&#x8FB9;&#x90FD;&#x9664;&#x4EE5;&#x4E86;&#x540C;&#x4E00;&#x9879;<script type="math/tex">p(x)</script>&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E00;&#x9879;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x7EA6;&#x51CF;&#x6389;&#xFF0C;&#x65E0;&#x9700;&#x8BA1;&#x7B97;&#xFF0C;&#x8FD9;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x4E8B;&#x5B9E;&#x4E0A;&#x9700;&#x8981;&#x8BA1;&#x7B97;&#x7684;&#x5C31;&#x4EC5;&#x4E3A;<script type="math/tex">p(x|\omega_i)P(\omega_i)</script>&#x4E86;&#xFF0C;&#x5177;&#x4F53;&#x5230;&#x4E24;&#x7C7B;&#x5224;&#x522B;&#x95EE;&#x9898;&#x4E0A;&#xFF0C;&#x5C31;&#x662F;&#x5224;&#x65AD;&#x662F;&#x5426;&#x6EE1;&#x8DB3;</p>
<script type="math/tex; mode=display">p(x|\omega_1)P(\omega_1) \gt p(x|\omega_2)P(\omega_2)</script><p>&#x5982;&#x679C;&#x6EE1;&#x8DB3;&#xFF0C;&#x5219;&#x6837;&#x672C;&#x5C5E;&#x4E8E;<script type="math/tex">\omega_1</script>&#xFF0C;&#x5426;&#x5219;&#x5C5E;&#x4E8E;<script type="math/tex">\omega_2</script>&#x3002;&#xFF08;&#x4E24;&#x8FB9;&#x76F8;&#x7B49;&#x7684;&#x65F6;&#x5019;&#x600E;&#x4E48;&#x5224;&#x5176;&#x5B9E;&#x662F;&#x65E0;&#x6240;&#x8C13;&#x7684;&#xFF09;</p>
<p>&#x90A3;&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7EDF;&#x8BA1;&#x5F97;&#x51FA;&#x7684;&#xFF0C;&#x5C31;&#x4EC5;&#x4EC5;&#x662F;&#x7C7B;&#x6761;&#x4EF6;&#x5BC6;&#x5EA6;&#x4E86;&#xFF0C;&#x800C;&#x7C7B;&#x6761;&#x4EF6;&#x5BC6;&#x5EA6;&#x7684;&#x7EDF;&#x8BA1;&#x5F80;&#x5F80;&#x6BD4;&#x76F4;&#x63A5;&#x7B97;&#x540E;&#x9A8C;&#x6982;&#x7387;&#x8981;&#x5BB9;&#x6613;&#x5F97;&#x591A;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x751F;&#x5B69;&#x5B50;&#x95EE;&#x9898;&#x7684;&#x9884;&#x6D4B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x7EDF;&#x8BA1;&#x201C;&#x751F;&#x7537;&#x5B69;&#x7684;&#x5B55;&#x5987;&#x7231;&#x5403;&#x8FA3;&#x7684;&#x6BD4;&#x4F8B;&#x201D;&#x548C;&#x201C;&#x751F;&#x5973;&#x5B69;&#x7684;&#x5B55;&#x5987;&#x5403;&#x8FA3;&#x7684;&#x6BD4;&#x4F8B;&#x201D;&#xFF0C;&#x7ED3;&#x5408;&#x751F;&#x7537;&#x751F;&#x5973;&#x7684;&#x5148;&#x9A8C;&#x6982;&#x7387;&#xFF0C;&#x5C31;&#x80FD;&#x591F;&#x505A;&#x51FA;&#x9884;&#x6D4B;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x8D1D;&#x53F6;&#x65AF;&#x51B3;&#x7B56;&#x4E86;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x524D;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x53EA;&#x662F;&#x5F00;&#x73A9;&#x7B11;&#x3002;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x5B55;&#x5987;&#x53E3;&#x5473;&#x548C;&#x5B69;&#x5B50;&#x7684;&#x6027;&#x522B;&#x5E76;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x5173;&#x7CFB;&#xFF0C;&#x4E24;&#x8005;&#x662F;&#x72EC;&#x7ACB;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6709;</p>
<script type="math/tex; mode=display">p(x, \omega_i) = p(x)P(\omega_i)</script><p>&#x6240;&#x4EE5;</p>
<script type="math/tex; mode=display">p(x|\omega_i)P(\omega_i) = \frac{p(x, \omega_i)}{P(\omega_i)}P(\omega_i) = p(x)P(\omega_i)</script><p>&#x6700;&#x540E;&#x4E00;&#x5316;&#x7B80;&#xFF0C;&#x4E24;&#x8FB9;&#x540C;&#x65F6;&#x7EA6;&#x53BB;<script type="math/tex">p(x)</script>&#xFF0C;&#x6700;&#x540E;&#x53C8;&#x6210;&#x4E3A;&#x4E86;&#x6BD4;&#x8F83;<script type="math/tex">P(\omega_1)</script>&#x8DDF;<script type="math/tex">P(\omega_2)</script>&#x4E86;&#x3002;</p>
<p><br></p>
<h2 id="&#x9884;&#x6D4B;&#x9760;&#x4E0D;&#x9760;&#x8C31;&#xFF1F;"><a href="#&#x9884;&#x6D4B;&#x9760;&#x4E0D;&#x9760;&#x8C31;&#xFF1F;" class="headerlink" title="&#x9884;&#x6D4B;&#x9760;&#x4E0D;&#x9760;&#x8C31;&#xFF1F;"></a>&#x9884;&#x6D4B;&#x9760;&#x4E0D;&#x9760;&#x8C31;&#xFF1F;</h2><p>&#x4EFB;&#x4F55;&#x9884;&#x6D4B;&#x90FD;&#x4F1A;&#x6709;&#x51FA;&#x9519;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EA;&#x662F;&#x6709;&#x591A;&#x548C;&#x5C11;&#x7684;&#x533A;&#x522B;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x9884;&#x6D4B;&#x51C6;&#x4E0D;&#x51C6;&#xFF0C;&#x603B;&#x5F97;&#x6709;&#x4E2A;&#x57FA;&#x51C6;&#x5427;&#x3002;&#x90A3;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x5C31;&#x770B;&#x6700;&#x7B80;&#x5355;&#x7684;&#xFF0C;&#x9519;&#x8BEF;&#x7387;&#x3002;&#x5BF9;&#x9519;&#x8BEF;&#x7387;&#x7684;&#x5B9A;&#x4E49;&#x4E3A;&#xFF0C;&#x6240;&#x6709;&#x670D;&#x4ECE;&#x540C;&#x6837;&#x5206;&#x5E03;&#x7684;&#x72EC;&#x7ACB;&#x6837;&#x672C;&#x4E0A;&#x9519;&#x8BEF;&#x6982;&#x7387;&#x7684;&#x671F;&#x671B;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E24;&#x7C7B;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x679C;&#x7B80;&#x5355;&#x4F9D;&#x7167;&#x5148;&#x9A8C;&#x6982;&#x7387;&#x8FDB;&#x884C;&#x51B3;&#x7B56;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x9884;&#x6D4B;&#x9519;&#x8BEF;&#x7684;&#x6982;&#x7387;&#x663E;&#x7136;&#x5C31;&#x662F;&#x6837;&#x672C;&#x5C5E;&#x4E8E;&#x6211;&#x4EEC;&#x6CA1;&#x9884;&#x6D4B;&#x7684;&#x90A3;&#x4E00;&#x7C7B;&#x7684;&#x6982;&#x7387;&#x3002;&#x4E5F;&#x5C31;&#x662F;</p>
<script type="math/tex; mode=display">P(error) = 1 - P(\omega_{predict})</script><p>&#x800C;&#x5BF9;&#x4E8E;&#x8D1D;&#x53F6;&#x65AF;&#x51B3;&#x7B56;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x6837;&#x672C;&#xFF0C;&#x51FA;&#x9519;&#x7684;&#x6982;&#x7387;&#x4E3A;</p>
<script type="math/tex; mode=display">p(e|x) = \begin{cases}
P(\omega_2 | x)& x \in \omega_1 \\
P(\omega_1 | x)& x \in \omega_2
\end{cases}</script><p>&#x56E0;&#x4E3A;&#x53EA;&#x6709;&#x4E24;&#x7C7B;&#xFF0C;&#x6240;&#x4EE5;&#x6EE1;&#x8DB3;<script type="math/tex">P(\omega_1 | x) + P(\omega_2 | x) = 1</script>&#xFF0C;&#x56E0;&#x6B64;&#x4E5F;&#x53EF;&#x4EE5;&#x8BF4;</p>
<script type="math/tex; mode=display">p(e|x) = 1 - P(\omega_{predict} | x)</script><p>&#x7531;&#x4E8E;&#x662F;&#x540E;&#x9A8C;&#x6982;&#x7387;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x9884;&#x6D4B;&#x662F;&#x4F1A;&#x968F;&#x7740;<script type="math/tex">x</script>&#x53D8;&#xFF0C;&#x6240;&#x4EE5;&#x8D1D;&#x53F6;&#x65AF;&#x51B3;&#x7B56;&#x6574;&#x4F53;&#x4E0A;&#x7684;&#x9519;&#x8BEF;&#x7387;&#x8981;&#x901A;&#x8FC7;&#x6240;&#x6709;&#x7684;&#x6837;&#x672C;&#x8BA1;&#x7B97;&#x5F97;&#x51FA;&#xFF0C;&#x4E3A;</p>
<script type="math/tex; mode=display">P(e) = \int P(e|x)p(x) \mathrm{d} x</script><p>&#x4E5F;&#x5C31;&#x662F;&#x7279;&#x5F81;<script type="math/tex">x</script>&#x5728;&#x5168;&#x90E8;&#x7684;&#x6837;&#x672C;&#x7A7A;&#x95F4;&#x505A;&#x79EF;&#x5206;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x53D6;&#x503C;&#x8BA1;&#x7B97;&#x540E;&#x7D2F;&#x52A0;&#xFF0C;&#x6700;&#x540E;&#x5F97;&#x5230;&#x7684;&#x5C31;&#x662F;&#x9519;&#x8BEF;&#x7387;&#x4E86;&#x3002;</p>
<p>&#x56DE;&#x5230;&#x6211;&#x4EEC;&#x524D;&#x9762;&#x9178;&#x513F;&#x8FA3;&#x5973;&#x7684;&#x9884;&#x6D4B;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x8BF4;&#x4E86;&#xFF0C;&#x9178;&#x513F;&#x8FA3;&#x5973;&#x662F;&#x6CA1;&#x6709;&#x79D1;&#x5B66;&#x6839;&#x636E;&#x7684;&#xFF0C;&#x4E8E;&#x662F;&#x6211;&#x4EEC;&#x628A;&#x8D1D;&#x53F6;&#x65AF;&#x9884;&#x6D4B;&#x5B8C;&#x7F8E;&#x5730;&#x5316;&#x7B80;&#x56DE;&#x4E86;&#x6839;&#x636E;&#x5148;&#x9A8C;&#x6982;&#x7387;&#x7684;&#x9884;&#x6D4B;&#x3002;&#x90A3;&#x597D;&#x5427;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x5B9A;&#x6B7B;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x59CB;&#x7EC8;&#x4F5C;&#x51FA;&#x662F;&#x7537;&#x5B69;&#x513F;&#x7684;&#x9884;&#x6D4B;&#x3002;&#x90A3;&#x4E48;&#x9519;&#x8BEF;&#x7387;&#x4E5F;&#x5C31;&#x662F;<script type="math/tex">1 - P(w_1) \approx 50\%</script>&#xFF0C;&#x57FA;&#x672C;&#x8FD8;&#x662F;&#x7B49;&#x4E8E;&#x778E;&#x731C;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x4E00;&#x5B9A;&#x8981;&#x76F8;&#x4FE1;&#x79D1;&#x5B66;&#x3002;</p>
<p>&#x4E0D;&#x8FC7;&#x5462;&#xFF0C;&#x4ECE;&#x79D1;&#x5B66;&#x7684;&#x89D2;&#x5EA6;&#x51FA;&#x53D1;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x53BB;&#x5356;&#x836F;&#x554A;&#xFF0C;&#x4E00;&#x9897;<script type="math/tex">10</script>&#x4E07;&#xFF0C;&#x5C31;&#x8BF4;&#x5403;&#x4E86;&#x4E00;&#x5B9A;&#x751F;&#x7537;&#x5B69;&#xFF0C;&#x751F;&#x4E0D;&#x51FA;&#x6765;&#x5168;&#x989D;&#x9000;&#x6B3E;&#xFF0C;&#x53EA;&#x8D5A;&#x4E0D;&#x8D54;&#xFF0C;&#x53D1;&#x5BB6;&#x81F4;&#x5BCC;&#x3002;&#x54EA;&#x6015;&#x8BF4;&#x751F;&#x4E0D;&#x51FA;&#x6765;&#x5168;&#x989D;&#x9000;&#x6B3E;&#x518D;&#x52A0;&#x8D54;<script type="math/tex">5</script>&#x4E07;&#xFF0C;&#x53EA;&#x8981;&#x4E0D;&#x662F;&#x975E;&#x914B;&#xFF0C;&#x90A3;&#x4E5F;&#x6709;&#x9AD8;&#x8FBE;&#x4E00;&#x4E2A;&#x4EBA;<script type="math/tex">-15 \times 0.5 + 10 \times 0.5 = 2.5</script>&#x4E07;&#x7684;&#x671F;&#x671B;&#x6536;&#x5165;&#x5462;&#x3002;&#x4EBA;&#x6709;&#x591A;&#x5927;&#x80C6;&#xFF0C;&#x5730;&#x6709;&#x591A;&#x5927;&#x4EA7;&#xFF0C;&#x8FD8;&#x80FD;&#x8DDF;&#x8B66;&#x5BDF;&#x53D4;&#x53D4;&#x559D;&#x8336;&#x5462;&#x3002;</p>
<p><img src="/images/02.jpg" alt=""></p>
<p><br></p>
<h2 id="&#x4F7F;&#x7528;&#x66F4;&#x591A;&#x7279;&#x5F81;"><a href="#&#x4F7F;&#x7528;&#x66F4;&#x591A;&#x7279;&#x5F81;" class="headerlink" title="&#x4F7F;&#x7528;&#x66F4;&#x591A;&#x7279;&#x5F81;"></a>&#x4F7F;&#x7528;&#x66F4;&#x591A;&#x7279;&#x5F81;</h2><p>&#x524D;&#x9762;&#x6211;&#x4EEC;&#x5BF9;&#x5B55;&#x5987;&#x7684;&#x9884;&#x6D4B;&#x4EC5;&#x4EC5;&#x662F;&#x6839;&#x636E;&#x5B55;&#x5987;&#x7684;&#x53E3;&#x5473;&#x6765;&#x8FDB;&#x884C;&#x63A8;&#x65AD;&#x7684;&#xFF0C;&#x7136;&#x800C;&#xFF0C;&#x4FA6;&#x63A2;&#x5267;&#x65AD;&#x6848;&#x8981;&#x7EC6;&#x81F4;&#x5168;&#x9762;&#x4E0D;&#x653E;&#x8FC7;&#x4E00;&#x70B9;&#x86DB;&#x4E1D;&#x9A6C;&#x8FF9;&#xFF0C;&#x505A;&#x9884;&#x6D4B;&#x4E5F;&#x8981;&#x5982;&#x6B64;&#x3002;&#x8981;&#x60F3;&#x9884;&#x6D4B;&#x5F97;&#x51C6;&#xFF0C;&#x5C31;&#x8981;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x5730;&#x628A;&#x63E1;&#x7EBF;&#x7D22;&#x3002;</p>
<p>&#x5728;&#x524D;&#x9762;&#x4E00;&#x8282;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x8BC1;&#x660E;&#x9178;&#x513F;&#x8FA3;&#x5973;&#x7684;&#x7279;&#x5F81;&#x4E0D;&#x9760;&#x8C31;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x4E3A;&#x4E86;&#x51C6;&#x786E;&#x9884;&#x6D4B;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5176;&#x5B83;&#x7684;&#x7279;&#x5F81;&#x3002;&#x4E2D;&#x533B;&#x91CC;&#x7ECF;&#x5E38;&#x8BB2;&#x8109;&#x8C61;&#xFF0C;&#x4E0D;&#x8FC7;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x592A;&#x7384;&#x5B66;&#x4E0D;&#x597D;&#x91CF;&#x5316;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x6539;&#x6210;&#x91CF;&#x5316;&#x5730;&#x6D4B;&#x5FC3;&#x7387;&#x8DDF;&#x8840;&#x538B;&#x4E00;&#x7C7B;&#x7684;&#x6307;&#x6807;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x91C7;&#x96C6;&#x5B55;&#x5987;&#x8840;&#x6DB2;&#xFF0C;&#x5206;&#x6790;&#x7279;&#x5B9A;&#x5143;&#x7D20;&#x7684;&#x542B;&#x91CF;&#x554A;&#x4E4B;&#x7C7B;&#x7684;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x6709;&#x5B66;&#x533B;&#x7684;&#x540C;&#x5B66;&#x53EF;&#x80FD;&#x4F1A;&#x8BF4;&#xFF0C;&#x5077;&#x5077;&#x505A;&#x4E2A;B&#x8D85;&#x4E0D;&#x5C31;&#x5B8C;&#x4E86;&#x3002;&#x8BF7;&#x4F60;&#x51FA;&#x53BB;&#xFF0C;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x8BB2;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x5462;&#xFF01;</p>
<p><img src="/images/03.jpg" alt=""></p>
<p>&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x7531;&#x4E8E;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#x8D1D;&#x53F6;&#x65AF;&#x51B3;&#x7B56;&#x91CC;&#x7531;&#x4E8E;&#x9700;&#x8981;&#x7EDF;&#x8BA1;&#x8BA1;&#x7B97;&#x6982;&#x7387;&#xFF0C;&#x6240;&#x4EE5;&#x8981;&#x6C42;&#x7279;&#x5F81;&#x503C;&#x662F;<strong>&#x79BB;&#x6563;</strong>&#x7684;&#x3002;&#x800C;&#x521A;&#x624D;&#x6211;&#x4EEC;&#x60F3;&#x5230;&#x7684;&#x5F88;&#x591A;&#x6307;&#x6807;&#x90FD;&#x662F;&#x8FDE;&#x7EED;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x9700;&#x8981;&#x79BB;&#x6563;&#x5316;&#xFF0C;&#x6700;&#x7B80;&#x5355;&#x7684;&#x529E;&#x6CD5;&#x5C31;&#x662F;&#x4EBA;&#x4E3A;&#x5212;&#x5206;&#x4E3A;&#x51E0;&#x4E2A;&#x533A;&#x95F4;&#xFF0C;&#x5C06;&#x843D;&#x5728;&#x540C;&#x4E00;&#x533A;&#x95F4;&#x7684;&#x503C;&#x7B97;&#x4F5C;&#x4E00;&#x4E2A;&#x79BB;&#x6563;&#x503C;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x8FDE;&#x7EED;&#x503C;&#x4E5F;&#x4E0D;&#x662F;&#x4E0D;&#x53EF;&#x4EE5;&#x7684;&#xFF0C;&#x53EA;&#x662F;&#x8F83;&#x4E3A;&#x590D;&#x6742;&#xFF0C;&#x9700;&#x8981;&#x786E;&#x4FDD;&#x79EF;&#x5206;&#x7B49;&#x4E8E;<script type="math/tex">1</script>&#x3002;</p>
<p>&#x603B;&#x4E4B;&#xFF0C;&#x7ECF;&#x8FC7;&#x4E00;&#x7CFB;&#x5217;&#x7EDF;&#x8BA1;&#x4E0E;&#x5206;&#x6790;&#xFF0C;&#x6211;&#x4EEC;&#x5F97;&#x5230;&#x4E86;<script type="math/tex">n</script>&#x4E2A;&#x6307;&#x6807;&#xFF0C;&#x6216;&#x8005;&#x6B63;&#x5F0F;&#x4E00;&#x70B9;&#xFF0C;&#x6211;&#x4EEC;&#x6709;<script type="math/tex">n</script>&#x4E2A;&#x7279;&#x5F81;&#x7528;&#x6765;&#x9884;&#x6D4B;&#xFF0C;&#x90A3;&#x4E48;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x6837;&#x672C;<script type="math/tex">\boldsymbol{x}</script>&#xFF0C;&#x5B83;&#x73B0;&#x5728;&#x5C31;&#x662F;&#x4E00;&#x4E2A;<script type="math/tex">n</script>&#x7EF4;&#x5411;&#x91CF;&#x4E86;&#xFF0C;&#x800C;&#x6BCF;&#x4E2A;&#x5206;&#x91CF;&#x90FD;&#x5BF9;&#x5E94;&#x7740;&#x4E00;&#x9879;&#x6307;&#x6807;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x6837;&#x672C;<script type="math/tex">\boldsymbol{x}</script>&#x5BF9;&#x5E94;&#x7740;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x503C;<script type="math/tex">\boldsymbol{x_1}, \boldsymbol{x_2}, \cdots, \boldsymbol{x_n}</script>&#xFF0C;&#x800C;&#x540E;&#x9A8C;&#x6982;&#x7387;<script type="math/tex">P(\omega_i|\boldsymbol{x})</script>&#x4E5F;&#x5C31;&#x8868;&#x793A;<script type="math/tex">P(\omega_i|\boldsymbol{x_1},\boldsymbol{x_2},\cdots,\boldsymbol{x_n})</script>&#xFF0C;&#x800C;&#x8BA1;&#x7B97;<script type="math/tex">p(\boldsymbol{x}|\omega_i)P(\omega_i)</script>&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x5728;&#x8BA1;&#x7B97;</p>
<script type="math/tex; mode=display">p(\boldsymbol{x_1},\boldsymbol{x_2},\cdots,\boldsymbol{x_n}|\omega_i)P(\omega_i)</script><p>&#x9519;&#x8BEF;&#x7387;&#x7684;&#x8BA1;&#x7B97;&#x8FD8;&#x662F;&#x4E00;&#x6837;&#xFF0C;&#x4ECD;&#x65E7;&#x662F;&#x5BF9;&#x6574;&#x4E2A;&#x6837;&#x672C;&#x7A7A;&#x95F4;&#x505A;&#x79EF;&#x5206;&#x3002;</p>
<p>&#x4F46;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5C31;&#x6709;&#x95EE;&#x9898;&#x4E86;&#xFF0C;&#x524D;&#x9762;&#x53EA;&#x6709;&#x53E3;&#x5473;&#x4E00;&#x4E2A;&#x7279;&#x5F81;&#x7684;&#x65F6;&#x5019;&#x7EDF;&#x8BA1;&#x8D77;&#x6765;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x8FD9;&#x4E2A;&#x7279;&#x5F81;&#x53EF;&#x80FD;&#x7684;&#x53D6;&#x503C;&#x53EA;&#x6709;<script type="math/tex">2</script>&#x4E2A;&#xFF0C;&#x90A3;&#x4E00;&#x5171;&#x5C31;&#x53EA;&#x6709;<script type="math/tex">2</script>&#x79CD;&#x60C5;&#x51B5;&#x9700;&#x8981;&#x7EDF;&#x8BA1;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;&#x6709;<script type="math/tex">10</script>&#x79CD;&#x53EF;&#x80FD;&#x53D6;&#x503C;&#x7684;&#x7279;&#x5F81;&#x65F6;&#xFF0C;&#x603B;&#x5171;&#x7684;&#x60C5;&#x51B5;&#x5E76;&#x4E0D;&#x662F;<script type="math/tex">2+10</script>&#xFF0C;&#x800C;&#x662F;<script type="math/tex">2 \times 10</script>&#xFF0C;&#x5171;<script type="math/tex">20</script>&#x79CD;&#x60C5;&#x51B5;&#x9700;&#x8981;&#x7EDF;&#x8BA1;&#x3002;&#x518D;&#x52A0;&#x4E00;&#x4E2A;&#x6709;<script type="math/tex">10</script>&#x4E2A;&#x53EF;&#x80FD;&#x53D6;&#x503C;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x60C5;&#x51B5;&#x5C31;&#x8FC5;&#x901F;&#x589E;&#x52A0;&#x5230;<script type="math/tex">200</script>&#x79CD;&#x3002;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#xFF0C;&#x7279;&#x5F81;&#x4E4B;&#x95F4;&#x662F;&#x76F8;&#x4E58;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x603B;&#x60C5;&#x51B5;&#x6570;&#x662F;&#x6307;&#x6570;&#x7EA7;&#x589E;&#x52A0;&#x7684;&#xFF0C;&#x8FD9;&#x663E;&#x7136;&#x662F;&#x6709;&#x7EC4;&#x5408;&#x7206;&#x70B8;&#x7684;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x6211;&#x4EEC;&#x7528;&#x4E00;&#x4E9B;&#x5176;&#x4ED6;&#x7684;&#x624B;&#x6BB5;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<p><br></p>
<h2 id="&#x6734;&#x7D20;&#x8D1D;&#x53F6;&#x65AF;"><a href="#&#x6734;&#x7D20;&#x8D1D;&#x53F6;&#x65AF;" class="headerlink" title="&#x6734;&#x7D20;&#x8D1D;&#x53F6;&#x65AF;"></a>&#x6734;&#x7D20;&#x8D1D;&#x53F6;&#x65AF;</h2><p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x518D;&#x4F5C;&#x4E00;&#x4E2A;&#x9650;&#x5236;&#xFF0C;&#x8981;&#x6C42;&#x7279;&#x5F81;&#x4E4B;&#x95F4;&#x76F8;&#x4E92;&#x72EC;&#x7ACB;&#x3002;&#x90A3;&#x4E48;&#x663E;&#x7136;&#xFF0C;<script type="math/tex">p(x|\omega_i)</script>&#x5B9E;&#x9645;&#x4E0A;&#x5C31;&#x6210;&#x4E86;&#x5404;&#x4E2A;&#x5206;&#x91CF;&#x5BF9;&#x5E94;&#x503C;&#x6982;&#x7387;&#x7684;&#x4E58;&#x79EF;&#x4E86;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;</p>
<script type="math/tex; mode=display">p(x|\omega_i) = p(x_1,x_2,\cdots,x_n|\omega_i) = p(x_1|\omega_i)p(x_2|\omega_i) \cdots p(x_n|\omega_i)</script><p>&#x7279;&#x5F81;&#x4E4B;&#x95F4;&#x4E92;&#x4E0D;&#x5F71;&#x54CD;&#xFF0C;&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x5206;&#x5F00;&#x5355;&#x72EC;&#x7EDF;&#x8BA1;&#xFF0C;&#x90A3;&#x4E48;&#x9700;&#x8981;&#x7EDF;&#x8BA1;&#x7684;&#x60C5;&#x51B5;&#x6570;&#x5C31;&#x4E0D;&#x662F;&#x5404;&#x7279;&#x5F81;&#x76F8;&#x4E58;&#xFF0C;&#x800C;&#x662F;&#x5404;&#x4E2A;&#x7279;&#x5F81;&#x7684;&#x9700;&#x8981;&#x7EDF;&#x8BA1;&#x7684;&#x60C5;&#x51B5;&#x6570;&#x7684;&#x548C;&#x4E86;&#x3002;<strong>&#x6734;&#x7D20;&#x8D1D;&#x53F6;&#x65AF;</strong>&#x6B63;&#x662F;&#x5728;&#x8FD9;&#x4E2A;&#x601D;&#x60F3;&#x4E0A;&#x7684;&#x4E00;&#x79CD;&#x6269;&#x5C55;&#xFF0C;&#x4E4B;&#x6240;&#x4EE5;&#x8BF4;&#x662F;&#x6734;&#x7D20;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x4F5C;&#x51FA;&#x4E86;&#x4E24;&#x4E2A;&#x57FA;&#x672C;&#x5047;&#x8BBE;&#xFF1A;</p>
<ul>
<li>&#x7279;&#x5F81;&#x4E4B;&#x95F4;&#x76F8;&#x4E92;&#x72EC;&#x7ACB;&#xFF0C;&#x76F8;&#x4E92;&#x4E4B;&#x95F4;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5173;&#x7CFB;</li>
<li>&#x6BCF;&#x4E2A;&#x7279;&#x5F81;&#x540C;&#x7B49;&#x91CD;&#x8981;</li>
</ul>
<p>&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x4E2A;&#x5047;&#x8BBE;&#x80AF;&#x5B9A;&#x4E0D;&#x662F;&#x5B8C;&#x5168;&#x6B63;&#x786E;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5F88;&#x96BE;&#x8BB2;&#x6211;&#x4EEC;&#x9009;&#x53D6;&#x7684;&#x7279;&#x5F81;&#x6CA1;&#x6709;&#x4E00;&#x70B9;&#x70B9;&#x5173;&#x7CFB;&#xFF0C;&#x800C;&#x4E14;&#x6211;&#x4EEC;&#x4E5F;&#x5F88;&#x96BE;&#x8BB2;&#x8BF4;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x9009;&#x53D6;&#x4E0D;&#x91CD;&#x8981;&#x7684;&#x7279;&#x5F81;&#x3002;&#x6240;&#x4EE5;&#x6734;&#x7D20;&#x8D1D;&#x53F6;&#x65AF;&#x5B9E;&#x9645;&#x662F;&#x5BF9;&#x95EE;&#x9898;&#x7684;&#x4E00;&#x79CD;&#x7B80;&#x5316;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x867D;&#x7136;&#x8FD9;&#x6837;&#x8BF4;&#xFF0C;&#x6734;&#x7D20;&#x8D1D;&#x53F6;&#x65AF;&#x7684;&#x5B9E;&#x9645;&#x6548;&#x679C;&#x5374;&#x8FD8;&#x662F;&#x5F88;&#x597D;&#x7684;&#x3002;</p>
<p><br></p>
<h2 id="&#x6700;&#x5C0F;&#x9519;&#x8BEF;&#x7387;&#x8D1D;&#x53F6;&#x65AF;&#x51B3;&#x7B56;"><a href="#&#x6700;&#x5C0F;&#x9519;&#x8BEF;&#x7387;&#x8D1D;&#x53F6;&#x65AF;&#x51B3;&#x7B56;" class="headerlink" title="&#x6700;&#x5C0F;&#x9519;&#x8BEF;&#x7387;&#x8D1D;&#x53F6;&#x65AF;&#x51B3;&#x7B56;"></a>&#x6700;&#x5C0F;&#x9519;&#x8BEF;&#x7387;&#x8D1D;&#x53F6;&#x65AF;&#x51B3;&#x7B56;</h2><p>&#x524D;&#x9762;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x4E86;&#x8BA1;&#x7B97;&#x9519;&#x8BEF;&#x7387;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x4ECE;&#x9519;&#x8BEF;&#x7387;&#x7684;&#x89D2;&#x5EA6;&#x51FA;&#x53D1;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x4F7F;&#x5F97;&#x9519;&#x8BEF;&#x7387;&#x6700;&#x5C0F;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x5760;&#x543C;&#x7684;&#x3002;&#x4E8E;&#x662F;&#x5C31;&#x6709;&#x4E86;&#x6700;&#x5C0F;&#x9519;&#x8BEF;&#x7387;&#x8D1D;&#x53F6;&#x65AF;&#x51B3;&#x7B56;&#xFF0C;&#x5176;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#x5C31;&#x662F;&#x4F7F;&#x5F97;&#x51B3;&#x7B56;&#x7684;&#x9519;&#x8BEF;&#x7387;&#x6700;&#x5C0F;&#x3002;</p>
<p>&#x90A3;&#x8981;&#x4F7F;&#x5F97;&#x9519;&#x8BEF;&#x7387;&#x6700;&#x5C0F;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x6700;&#x5C0F;&#x5316;</p>
<script type="math/tex; mode=display">P(e) = \int P(e|\boldsymbol{x})p(\boldsymbol{x}) \mathrm{d} \boldsymbol{x}</script><p>&#x800C;&#x524D;&#x9762;&#x6211;&#x4EEC;&#x5BF9;&#x9519;&#x8BEF;&#x7387;&#x7684;&#x5B9A;&#x4E49;&#x4E3A;</p>
<script type="math/tex; mode=display">p(e|\boldsymbol{x}) = 1 - P(\omega_{predict} | \boldsymbol{x})</script><p>&#x6240;&#x4EE5;&#xFF0C;&#x4E3A;&#x4E86;&#x4F7F;&#x9519;&#x8BEF;&#x7387;&#x6700;&#x5C0F;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x8981;&#x4F7F;&#x540E;&#x9A8C;&#x6982;&#x7387;&#x6700;&#x5927;&#xFF0C;&#x5373;&#x6700;&#x5927;&#x5316;</p>
<script type="math/tex; mode=display">P(\omega_i|\boldsymbol{x}) = \frac{p(\boldsymbol{x}|\omega_i)P(\omega_i)}{p(\boldsymbol{x})} = \frac{p(\boldsymbol{x}|\omega_i)P(\omega_i)}{\sum_{j=1}^{2}P(\boldsymbol{x}|\omega_j)P(\omega_j)}</script><p>&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x51B3;&#x7B56;&#x89C4;&#x5219;&#x4E3A;</p>
<script type="math/tex; mode=display">\text{若 } P(\omega_1|\boldsymbol{x}) \gt P(\omega_2|\boldsymbol{x}) \text{，则 } \boldsymbol{x} \in \omega_1 \text{，否则 } \boldsymbol{x} \in \omega_2</script><p>&#x5176;&#x5B9E;&#x8FD9;&#x5C31;&#x662F;&#x4E00;&#x5F00;&#x59CB;&#x8BF4;&#x7684;&#x51B3;&#x7B56;&#x7B56;&#x7565;&#xFF0C;&#x6240;&#x4EE5;&#x4E00;&#x822C;&#x8BF4;&#x8D1D;&#x53F6;&#x65AF;&#x51B3;&#x7B56;&#x90FD;&#x662F;&#x6307;&#x6700;&#x5C0F;&#x98CE;&#x9669;&#x8D1D;&#x53F6;&#x65AF;&#x51B3;&#x7B56;&#x3002;</p>
<p>&#x4E0A;&#x9762;&#x7684;&#x51B3;&#x7B56;&#x7B56;&#x7565;&#x53EF;&#x4EE5;&#x8FDB;&#x4E00;&#x6B65;&#x7B80;&#x5199;&#x4E3A;</p>
<script type="math/tex; mode=display">\text{若 } P(\omega_i|\boldsymbol{x}) = \max_{j=1,2}P(\omega_j|\boldsymbol{x}) \text{，则 } \boldsymbol{x} \in \omega_i</script><p>&#x5F53;&#x7136;&#xFF0C;&#x6309;&#x7167;&#x8D1D;&#x53F6;&#x65AF;&#x516C;&#x5F0F;&#x5C55;&#x5F00;&#xFF0C;&#x7531;&#x4E8E;&#x5206;&#x6BCD;&#x76F8;&#x540C;&#x53EF;&#x4EE5;&#x7EA6;&#x53BB;&#xFF0C;&#x56E0;&#x6B64;&#x53C8;&#x53EF;&#x4EE5;&#x5199;&#x4F5C;</p>
<script type="math/tex; mode=display">\text{若 } p(\boldsymbol{x}|\omega_i)P(\omega_i) = \max_{j=1,2}p(\boldsymbol{x}|\omega_j)P(\omega_j) \text{，则 } \boldsymbol{x} \in \omega_i</script><p>&#x53C8;&#x6CE8;&#x610F;&#x5230;&#xFF0C;<script type="math/tex">P(\omega_i)</script>&#x662F;&#x4E8B;&#x5148;&#x786E;&#x5B9A;&#x7684;&#xFF0C;&#x800C;&#x4E0E;&#x6837;&#x672C;<script type="math/tex">x</script>&#x65E0;&#x5173;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x51FA;&#x4E8E;&#x4E60;&#x60EF;&#xFF0C;&#x628A;&#x5E38;&#x91CF;&#x653E;&#x5230;&#x4E00;&#x8FB9;&#xFF0C;&#x628A;&#x53D8;&#x91CF;&#x653E;&#x5728;&#x53E6;&#x4E00;&#x8FB9;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x4EE4;</p>
<script type="math/tex; mode=display">l(\boldsymbol{x}) = \frac{p(\boldsymbol{x}|\omega_1)}{p(\boldsymbol{x}|\omega_2)}</script><script type="math/tex; mode=display">\lambda = \frac{P(\omega_2)}{\omega_1}</script><p>&#x800C;&#x6211;&#x4EEC;&#x7684;&#x51B3;&#x7B56;&#x7B56;&#x7565;&#x5219;&#x662F;</p>
<script type="math/tex; mode=display">\text{若 } l(\boldsymbol{x}) \gt \lambda \text{，则 } \boldsymbol{x} \in \omega_1 \text{，否则 } \boldsymbol{x} \in \omega_2</script><p>&#x5176;&#x4E2D;&#xFF0C;<script type="math/tex">l</script>&#x88AB;&#x79F0;&#x4F5C;<strong>&#x4F3C;&#x7136;&#x6BD4;(likelihood ratio)</strong>&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x76F8;&#x5BF9;&#x53EF;&#x80FD;&#x6027;(likelihood)&#x7684;&#x6BD4;&#xFF0C;<script type="math/tex">\lambda</script>&#x88AB;&#x79F0;&#x4E3A;<strong>&#x4F3C;&#x7136;&#x6BD4;&#x9608;&#x503C;</strong>&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x8BA1;&#x7B97;&#x597D;&#x9608;&#x503C;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x6BCF;&#x4E2A;&#x6837;&#x672C;&#x8BA1;&#x7B97;l(x)&#x3002;</p>
<p>&#x6709;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7531;&#x4E8E;&#x6982;&#x7387;&#x503C;&#x5F88;&#x5C0F;&#xFF0C;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x5F88;&#x53EF;&#x80FD;&#x56E0;&#x4E3A;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x8BEF;&#x5DEE;&#x800C;&#x5BFC;&#x81F4;&#x9519;&#x8BEF;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x6BD4;&#x5982;&#x591A;&#x7C7B;&#x60C5;&#x51B5;&#x4E0B;&#x5BF9;&#x6BD4;&#x7684;&#x4E24;&#x4E2A;&#x6982;&#x7387;&#x503C;&#x90FD;&#x592A;&#x5C0F;&#xFF0C;&#x56E0;&#x4E3A;&#x8BEF;&#x5DEE;&#x76F4;&#x63A5;&#x7B97;&#x51FA;&#x4E86;<script type="math/tex">0</script>&#xFF0C;&#x90A3;&#x7ED3;&#x679C;&#x6CE2;&#x52A8;&#x5C31;&#x592A;&#x5927;&#x4E86;&#x3002;&#x90A3;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5BF9;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x53D6;&#x5BF9;&#x6570;&#xFF0C;&#x4EE4;</p>
<script type="math/tex; mode=display">h(\boldsymbol{x}) = -\ln(l(\boldsymbol{x})) = -\ln p(\boldsymbol{x}|\omega_1) + \ln p(\boldsymbol{x}|\omega_2)</script><p>&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x5C31;&#x628A;&#x9664;&#x6CD5;&#x53D8;&#x6210;&#x4E86;&#x52A0;&#x51CF;&#x6CD5;&#x3002;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x53D6;&#x7684;&#x662F;&#x8D1F;&#x5BF9;&#x6570;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x7684;&#x9608;&#x503C;&#x5C31;&#x53D8;&#x6210;&#x4E86;</p>
<script type="math/tex; mode=display">-\ln\lambda = -\ln P(\omega_2) + \ln P(\omega_1) = \ln\frac{P(\omega_1)}{P(\omega_2)}</script><p>&#x6839;&#x636E;&#x4E0D;&#x7B49;&#x5F0F;&#x7684;&#x53D8;&#x6362;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x51B3;&#x7B56;&#x7B56;&#x7565;&#x9700;&#x8981;&#x53D8;&#x53F7;&#xFF0C;&#x7B56;&#x7565;&#x4E3A;</p>
<script type="math/tex; mode=display">\text{若 } h(\boldsymbol{x}) \lt \ln\frac{P(\omega_1)}{P(\omega_2)} \text{，则 } \boldsymbol{x} \in \omega_1 \text{，否则 } \boldsymbol{x} \in \omega_2</script><p><br></p>
<h2 id="&#x6700;&#x5C0F;&#x98CE;&#x9669;&#x8D1D;&#x53F6;&#x65AF;&#x51B3;&#x7B56;"><a href="#&#x6700;&#x5C0F;&#x98CE;&#x9669;&#x8D1D;&#x53F6;&#x65AF;&#x51B3;&#x7B56;" class="headerlink" title="&#x6700;&#x5C0F;&#x98CE;&#x9669;&#x8D1D;&#x53F6;&#x65AF;&#x51B3;&#x7B56;"></a>&#x6700;&#x5C0F;&#x98CE;&#x9669;&#x8D1D;&#x53F6;&#x65AF;&#x51B3;&#x7B56;</h2><p>&#x524D;&#x9762;&#x7684;&#x505A;&#x6CD5;&#x662F;&#x6700;&#x5C0F;&#x5316;&#x51B3;&#x7B56;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5206;&#x7C7B;&#x7684;&#x9519;&#x8BEF;&#x7387;&#x3002;&#x7136;&#x800C;&#x4E00;&#x5473;&#x5730;&#x7684;&#x8FFD;&#x6C42;&#x6700;&#x4F4E;&#x9519;&#x8BEF;&#x7387;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x5C31;&#x662F;&#x597D;&#x7684;&#x3002;&#x5728;&#x4E00;&#x4E9B;&#x7279;&#x6B8A;&#x7684;&#x9886;&#x57DF;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x51B3;&#x7B56;&#x72AF;&#x9519;&#x6240;&#x9020;&#x6210;&#x7684;&#x635F;&#x5931;&#x662F;&#x8FDC;&#x4E0D;&#x76F8;&#x540C;&#x7684;&#x3002;&#x4EE5;&#x764C;&#x75C7;&#x68C0;&#x6D4B;&#x4E3A;&#x4F8B;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5168;&#x6743;&#x4EA4;&#x4E88;&#x673A;&#x5668;&#x51B3;&#x5B9A;&#x6CBB;&#x7597;&#x65B9;&#x6848;&#xFF0C;&#x7ED3;&#x679C;&#x628A;&#x6B63;&#x5E38;&#x4EBA;&#x8BEF;&#x5224;&#x4E3A;&#x764C;&#x75C7;&#x75C5;&#x4EBA;&#x800C;&#x9519;&#x8BEF;&#x5730;&#x5C55;&#x5F00;&#x4E86;&#x6CBB;&#x7597;&#xFF0C;&#x4F1A;&#x5BF9;&#x4ED6;&#x7684;&#x8EAB;&#x4F53;&#x9020;&#x6210;&#x6781;&#x5927;&#x6740;&#x4F24;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x5E94;&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x8BEF;&#x8BCA;&#xFF1B;&#x800C;&#x4ECE;&#x53E6;&#x4E00;&#x4E2A;&#x89D2;&#x5EA6;&#x8BB2;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5C06;&#x673A;&#x5668;&#x4F5C;&#x4E3A;&#x524D;&#x671F;&#x9884;&#x8B66;&#x624B;&#x6BB5;&#x4F46;&#x673A;&#x5668;&#x6CA1;&#x6709;&#x68C0;&#x6D4B;&#x51FA;&#x75C5;&#x4EBA;&#x7684;&#x764C;&#x75C7;&#xFF0C;&#x90A3;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x60A3;&#x8005;&#x9519;&#x8FC7;&#x4E86;&#x6700;&#x4F73;&#x7684;&#x6CBB;&#x7597;&#x65F6;&#x673A;&#x3002;&#x8FD9;&#x90FD;&#x662F;&#x4E0D;&#x80FD;&#x63A5;&#x53D7;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x8FDB;&#x884C;&#x51B3;&#x7B56;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x5BF9;&#x67D0;&#x79CD;&#x7C7B;&#x522B;&#x6709;&#x6240;&#x503E;&#x5411;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x7EA6;&#x5B9A;&#xFF1A;</p>
<ul>
<li><script type="math/tex">\omega_1, \omega_2, \cdots, \omega_c</script>&#x8868;&#x793A;&#x6837;&#x672C;&#x6240;&#x5C5E;&#x7684;&#x771F;&#x5B9E;&#x7C7B;&#x522B;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x6837;&#x672C;&#x7684;&#x72B6;&#x6001;&#x3002;</li>
<li><script type="math/tex">\alpha_1, \alpha_2, \cdots, \omega_k</script>&#x8868;&#x793A;&#x6211;&#x4EEC;&#x7684;&#x51B3;&#x7B56;&#xFF0C;&#x5373;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x6837;&#x672C;&#x6240;&#x5C5E;&#x7684;&#x7C7B;&#x522B;&#x6216;&#x72B6;&#x6001;&#x3002;</li>
</ul>
<p>&#x6CE8;&#x610F;&#x5230;&#xFF0C;<script type="math/tex">k \neq c</script>&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x6211;&#x4EEC;&#x7684;&#x51B3;&#x7B56;&#x8DDF;&#x6240;&#x5C5E;&#x7684;&#x771F;&#x662F;&#x7C7B;&#x522B;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x5BF9;&#x53F7;&#x5165;&#x5EA7;&#x7684;&#x3002;&#x56E0;&#x4E3A;&#x6709;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x7684;&#x51B3;&#x7B56;&#x53EF;&#x80FD;&#x4F1A;&#x628A;&#x51E0;&#x4E2A;&#x7C7B;&#x522B;&#x5408;&#x5E76;&#x4E3A;&#x4E00;&#x4E2A;&#xFF0C;&#x5BFC;&#x81F4;<script type="math/tex">k \lt c</script>&#xFF1B;&#x6709;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x8FD8;&#x6709;&#x53EF;&#x80FD;&#x4F5C;&#x51FA;&#x201C;&#x62D2;&#x7EDD;&#x201D;&#x7684;&#x51B3;&#x7B56;&#xFF0C;&#x5373;&#x5224;&#x5B9A;&#x6837;&#x672C;&#x4E0D;&#x5C5E;&#x4E8E;&#x4EFB;&#x4F55;&#x4E00;&#x7C7B;&#xFF1B;&#x6709;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x8FD8;&#x4F1A;&#x5BF9;&#x67D0;&#x4E2A;&#x7C7B;&#x522B;&#x518D;&#x5177;&#x4F53;&#x7EC6;&#x5206;&#x4E3A;&#x51E0;&#x4E2A;&#x7C7B;&#x522B;&#x3002;</p>
<p>&#x5728;&#x533A;&#x5206;&#x51FA;&#x771F;&#x5B9E;&#x7C7B;&#x522B;&#x548C;&#x51B3;&#x7B56;&#x7684;&#x7C7B;&#x522B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x5F15;&#x5165;&#x98CE;&#x9669;&#x8FD9;&#x4E00;&#x6982;&#x5FF5;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;</p>
<script type="math/tex; mode=display">\lambda(\alpha_i,\omega_j) \qquad \left(\ i = 1,\cdots,k,\ j = 1,\cdots,c\ \right)</script><p>&#x8868;&#x793A;&#x5C06;&#x5B9E;&#x9645;&#x5C5E;&#x4E8E;<script type="math/tex">\omega_j</script>&#x7684;&#x6837;&#x672C;&#x51B3;&#x7B56;&#x4E3A;<script type="math/tex">\alpha_i</script>&#x6240;&#x5E26;&#x6765;&#x7684;&#x635F;&#x5931;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x98CE;&#x9669;&#x3002;</p>
<p>&#x7136;&#x800C;&#xFF0C;&#x5728;&#x5B9E;&#x9645;&#x51B3;&#x7B56;&#x4E2D;&#xFF0C;&#x5BF9;&#x4E8E;&#x5F53;&#x524D;&#x7684;&#x6837;&#x672C;<script type="math/tex">\boldsymbol{x}</script>&#xFF0C;&#x6211;&#x4EEC;&#x5E76;&#x4E0D;&#x77E5;&#x9053;&#x5B83;&#x5B9E;&#x9645;&#x5C5E;&#x4E8E;&#x54EA;&#x4E00;&#x7C7B;&#xFF0C;&#x4E0D;&#x7136;&#x6211;&#x4EEC;&#x4E5F;&#x4E0D;&#x7528;&#x51B3;&#x7B56;&#x4E86;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x76F8;&#x5BF9;&#x4E8E;&#x76F4;&#x63A5;&#x8BA1;&#x7B97;&#x635F;&#x5931;&#xFF0C;&#x6211;&#x4EEC;&#x6539;&#x4E3A;&#x8BA1;&#x7B97;&#x82E5;&#x51B3;&#x7B56;&#x4E3A;<script type="math/tex">\alpha_i</script>&#xFF0C;&#x6240;&#x5E26;&#x6765;&#x7684;&#x671F;&#x671B;&#x635F;&#x5931;&#xFF0C;&#x4E3A;</p>
<script type="math/tex; mode=display">R(\alpha_i|\boldsymbol{x}) = E(\lambda(\alpha_i,\omega_j)|\boldsymbol{x}) = \sum_{j=1}^c\lambda(\alpha_i,\omega_j)P(\omega_j|\boldsymbol{x})</script><p>&#x4E5F;&#x5C31;&#x662F;&#x6837;&#x672C;<script type="math/tex">\boldsymbol{x}</script>&#x5C5E;&#x4E8E;&#x6BCF;&#x4E2A;&#x5B9E;&#x9645;&#x7C7B;&#x7684;&#x635F;&#x5931;&#x4E58;&#x4EE5;&#x5C5E;&#x4E8E;&#x6BCF;&#x4E2A;&#x5B9E;&#x9645;&#x7C7B;&#x7684;&#x6982;&#x7387;&#x7136;&#x540E;&#x6C42;&#x548C;&#xFF0C;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x8FD9;&#x662F;&#x5728;&#x8BA1;&#x7B97;&#x51B3;&#x7B56;<script type="math/tex">\alpha_i</script>&#x7684;&#x5E73;&#x5747;&#x635F;&#x5931;&#x6216;&#x8005;&#x8BF4;&#x98CE;&#x9669;&#x3002;</p>
<p>&#x6709;&#x4E86;&#x4E0A;&#x9762;&#x8FD9;&#x4E00;&#x5B9A;&#x4E49;&#xFF0C;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x6709;&#x4E00;&#x4E2A;&#x51B3;&#x7B56;&#x89C4;&#x5219;&#x6216;&#x8005;&#x8BF4;&#x7B56;&#x7565;<script type="math/tex">\alpha(x)</script>&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x51B3;&#x7B56;&#x7279;&#x5F81;&#x7A7A;&#x95F4;&#x5185;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x6837;&#x672C;<script type="math/tex">\boldsymbol{x}</script>&#x6240;&#x4EA7;&#x751F;&#x7684;&#x671F;&#x671B;&#x635F;&#x5931;&#x4E3A;</p>
<script type="math/tex; mode=display">R(\alpha) = \int R(\alpha(\boldsymbol{x})|\boldsymbol{x})p(\boldsymbol{x}) \mathrm{d} \boldsymbol{x}</script><p>&#x5176;&#x4E2D;&#xFF0C;<script type="math/tex">R(\alpha)</script>&#x88AB;&#x79F0;&#x4E3A;<strong>&#x5E73;&#x5747;&#x98CE;&#x9669;</strong>&#x6216;&#x8005;<strong>&#x671F;&#x671B;&#x98CE;&#x9669;</strong>&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x6700;&#x5C0F;&#x98CE;&#x9669;&#x8D1D;&#x53F6;&#x65AF;&#x51B3;&#x7B56;&#x6240;&#x8981;&#x6700;&#x5C0F;&#x5316;&#x7684;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6700;&#x5C0F;&#x98CE;&#x9669;&#x8D1D;&#x53F6;&#x65AF;&#x51B3;&#x7B56;&#x7684;&#x51B3;&#x7B56;&#x7B56;&#x7565;&#x4E3A;</p>
<script type="math/tex; mode=display">\text{若 } R(\alpha_i|\boldsymbol{x}) = \min_{j=1,\cdots,k}R(\alpha_j|\boldsymbol{x}) \text{，则 } \alpha = \alpha_i</script><p>&#x7279;&#x522B;&#x5730;&#xFF0C;&#x5BF9;&#x4E8E;<script type="math/tex">k=c=2</script>&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x51B3;&#x7B56;&#x7B56;&#x7565;&#x4E3A;</p>
<script type="math/tex; mode=display">\text{若 } \lambda_{11}P(\omega_1|\boldsymbol{x})+\lambda_{12}P(\omega_2|\boldsymbol{x}) < \lambda_{21}P(\omega_1|\boldsymbol{x})+\lambda_{22}P(\omega_2|\boldsymbol{x})  \text{，则 } \boldsymbol{x} \in \omega_1 \text{，否则 } \boldsymbol{x} \in \omega_2</script><p>&#x5176;&#x4E2D;&#xFF0C;<script type="math/tex">\lambda_{ij}</script>&#x8868;&#x793A;<script type="math/tex">\lambda(\alpha_i,\omega_j)</script>&#x3002;</p>
<p>&#x5BF9;&#x516C;&#x5F0F;&#x7A0D;&#x52A0;&#x6574;&#x7406;&#xFF0C;&#x5F97;</p>
<script type="math/tex; mode=display">\text{若 } (\lambda_{11}-\lambda_{21})P(\omega_1|\boldsymbol{x}) < (\lambda_{22}-\lambda_{12})P(\omega_2|\boldsymbol{x})  \text{，则 } \boldsymbol{x} \in \omega_1 \text{，否则 } \boldsymbol{x} \in \omega_2</script><p>&#x6309;&#x8D1D;&#x53F6;&#x65AF;&#x516C;&#x5F0F;&#x5C55;&#x5F00;&#xFF0C;&#x8BA1;&#x7B97;&#x540E;&#x9A8C;&#x6982;&#x7387;&#xFF0C;&#x5F97;</p>
<script type="math/tex; mode=display">\text{若 } (\lambda_{11}-\lambda_{21})\frac{p(\boldsymbol{x}|\omega_1)P(\omega_1)}{p(\boldsymbol{x})} < (\lambda_{22}-\lambda_{12})\frac{p(\boldsymbol{x}|\omega_2)P(\omega_2)}{p(\boldsymbol{x})}  \text{，则 } \boldsymbol{x} \in \omega_1 \text{，否则 } \boldsymbol{x} \in \omega_2</script><p>&#x540C;&#x6837;&#x5730;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7EA6;&#x53BB;<script type="math/tex">p(\boldsymbol{x})</script>&#xFF0C;&#x5F97;</p>
<script type="math/tex; mode=display">\text{若 }  \frac{p(\boldsymbol{x}|\omega_1)P(\omega_1)}{p(\boldsymbol{x}|\omega_2)P(\omega2)} > \frac{\lambda_{22}-\lambda_{12}}{\lambda_{11}-\lambda_{21}} = \frac{\lambda_{12}-\lambda_{22}}{\lambda_{21}-\lambda_{11}}  \text{，则 } \boldsymbol{x} \in \omega_1 \text{，否则 } \boldsymbol{x} \in \omega_2</script><p>&#x628A;&#x5E38;&#x91CF;&#x653E;&#x5230;&#x4E00;&#x8FB9;&#xFF0C;&#x5F97;&#x5230;&#x6700;&#x5C0F;&#x98CE;&#x9669;&#x8D1D;&#x53F6;&#x65AF;&#x51B3;&#x7B56;&#x4E0B;&#x7684;&#x4F3C;&#x7136;&#x6BD4;&#x9608;&#x503C;&#xFF0C;&#x51B3;&#x7B56;&#x89C4;&#x5219;&#x4E3A;</p>
<script type="math/tex; mode=display">\text{若 }  l(\boldsymbol{x}) = \frac{p(\boldsymbol{x}|\omega_1)}{p(\boldsymbol{x}|\omega_2)} > \frac{P(\omega_2)}{P(\omega_1)} \cdot \frac{\lambda_{12}-\lambda_{22}}{\lambda_{21}-\lambda_{11}}  \text{，则 } \boldsymbol{x} \in \omega_1 \text{，否则 } \boldsymbol{x} \in \omega_2</script><p>&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#xFF0C;&#x5F53;<script type="math/tex">\lambda_{11}=\lambda_{22}</script>&#x4E14;<script type="math/tex">\lambda_{12}=\lambda_{21}=1</script>&#x65F6;&#xFF0C;&#x6700;&#x4E0B;&#x98CE;&#x9669;&#x8D1D;&#x53F6;&#x65AF;&#x51B3;&#x7B56;&#x5C31;&#x53D8;&#x6210;&#x4E86;&#x6700;&#x5C0F;&#x9519;&#x8BEF;&#x7387;&#x8D1D;&#x53F6;&#x65AF;&#x51B3;&#x7B56;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x6700;&#x5C0F;&#x9519;&#x8BEF;&#x7387;&#x8D1D;&#x53F6;&#x65AF;&#x51B3;&#x7B56;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x6700;&#x5C0F;&#x98CE;&#x9669;&#x8D1D;&#x53F6;&#x65AF;&#x51B3;&#x7B56;&#x7684;&#x4E00;&#x79CD;&#x7279;&#x4F8B;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5728;&#x591A;&#x7C7B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x91C7;&#x7528;&#x8FD9;&#x79CD;&#x201C;0-1&#x201D;&#x7B56;&#x7565;&#x7684;&#x51B3;&#x7B56;&#x8868;&#xFF0C;&#x5373;&#x201C;&#x76F8;&#x540C;&#x4E3A;0&#xFF0C;&#x4E0D;&#x540C;&#x4E3A;1&#x201D;&#x7684;&#x7B56;&#x7565;&#xFF0C;&#x90A3;&#x4E48;&#x6700;&#x5C0F;&#x98CE;&#x9669;&#x8D1D;&#x53F6;&#x65AF;&#x51B3;&#x7B56;&#x5C31;&#x7B49;&#x540C;&#x4E8E;&#x6700;&#x5C0F;&#x9519;&#x8BEF;&#x7387;&#x8D1D;&#x53F6;&#x65AF;&#x51B3;&#x7B56;&#x3002;</p>
<p><br></p>
<h2 id="&#x4E24;&#x7C7B;&#x9519;&#x8BEF;"><a href="#&#x4E24;&#x7C7B;&#x9519;&#x8BEF;" class="headerlink" title="&#x4E24;&#x7C7B;&#x9519;&#x8BEF;"></a>&#x4E24;&#x7C7B;&#x9519;&#x8BEF;</h2><p>&#x5728;<a href="/articles/3/">&#x6211;&#x4E4B;&#x524D;&#x5199;&#x8FC7;&#x7684;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;</a>&#x4E2D;&#xFF0C;&#x8C08;&#x5230;&#x8FC7;&#x504F;&#x659C;&#x6570;&#x636E;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4E3B;&#x8981;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x4E24;&#x7C7B;&#x76F8;&#x5DEE;&#x60AC;&#x6B8A;&#xFF0C;&#x5E76;&#x4E0D;&#x76F8;&#x7B49;&#xFF0C;&#x8FD9;&#x79CD;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x5F80;&#x5F80;&#x66F4;&#x52A0;&#x5173;&#x6CE8;&#x5176;&#x4E2D;&#x67D0;&#x4E00;&#x65B9;&#x9762;&#x7684;&#x68C0;&#x6D4B;&#xFF0C;&#x4E8E;&#x662F;&#x5C31;&#x6709;&#x4E86;&#x4EE5;&#x4E0B;&#x5173;&#x7CFB;&#xFF0C;&#x5982;&#x4E0B;&#x8868;&#x3002;</p>
<div class="table-container">
<table>
<thead>
<tr>
<th></th>
<th>&#x5B9E;&#x9645;&#x4E3A;&#x9633;&#x6027;</th>
<th>&#x5B9E;&#x9645;&#x4E3A;&#x9634;&#x6027;</th>
</tr>
</thead>
<tbody>
<tr>
<td><strong>&#x9884;&#x6D4B;&#x4E3A;&#x9633;&#x6027;</strong></td>
<td>&#x771F;&#x9633;&#x6027;(TP)</td>
<td>&#x5047;&#x9633;&#x6027;(FP)</td>
</tr>
<tr>
<td><strong>&#x9884;&#x6D4B;&#x4E3A;&#x9634;&#x6027;</strong></td>
<td>&#x5047;&#x9634;&#x6027;(FN)</td>
<td>&#x771F;&#x9634;&#x6027;(TN)</td>
</tr>
</tbody>
</table>
</div>
<p>&#x63A5;&#x4E0B;&#x6765;&#x5B9A;&#x4E49;&#x4E24;&#x4E2A;&#x51B3;&#x7B56;&#x7684;&#x68C0;&#x9A8C;&#x6807;&#x51C6;&#xFF0C;&#x5B9A;&#x4E49;</p>
<script type="math/tex; mode=display">Sn=\frac{TP}{TP+FN}</script><p>&#x4E3A;&#x7075;&#x654F;&#x5EA6;&#xFF0C;&#x8868;&#x793A;&#x771F;&#x9633;&#x6027;&#x7684;&#x6837;&#x672C;&#x4E2D;&#x6709;&#x591A;&#x5C11;&#x80FD;&#x591F;&#x88AB;&#x68C0;&#x6D4B;&#x51FA;&#x6765;&#x3002;</p>
<p>&#x53C8;&#x5B9A;&#x4E49;</p>
<script type="math/tex; mode=display">Sp=\frac{TN}{TN+FP}</script><p>&#x4E3A;&#x7279;&#x5F02;&#x5EA6;&#xFF0C;&#x8868;&#x793A;&#x771F;&#x9634;&#x6027;&#x7684;&#x6837;&#x672C;&#x4E2D;&#x6709;&#x591A;&#x5C11;&#x6CA1;&#x6709;&#x88AB;&#x8BEF;&#x5224;&#x3002;</p>
<p>&#x51FA;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x76EE;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x4F1A;&#x9009;&#x62E9;&#x4E24;&#x8005;&#x5F53;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x4F5C;&#x4E3A;&#x4F18;&#x5316;&#x7684;&#x76EE;&#x6807;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x5BF9;&#x4E8E;&#x764C;&#x75C7;&#x68C0;&#x6D4B;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x60F3;&#x653E;&#x8FC7;&#x4EFB;&#x4F55;&#x6F5C;&#x5728;&#x7684;&#x60A3;&#x8005;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x81EA;&#x7136;&#x662F;&#x5E0C;&#x671B;&#x8FFD;&#x6C42;<script type="math/tex">100\%</script>&#x7684;&#x7075;&#x654F;&#x5EA6;&#xFF1B;&#x800C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x68C0;&#x6D4B;&#x7ED3;&#x679C;&#x6709;&#x5341;&#x6210;&#x628A;&#x63E1;&#xFF0C;&#x4E0D;&#x5E0C;&#x671B;&#x8BEF;&#x8BCA;&#x4EFB;&#x4F55;&#x5065;&#x5EB7;&#x4EBA;&#xFF0C;&#x90A3;&#x4E48;&#x663E;&#x7136;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x8FFD;&#x6C42;<script type="math/tex">100\%</script>&#x7684;&#x7279;&#x5F02;&#x5EA6;&#x3002;</p>
<p>&#x5728;&#x4E00;&#x4E9B;&#x6587;&#x732E;&#x4E2D;&#xFF0C;&#x5047;&#x9633;&#x6027;&#x4E5F;&#x88AB;&#x79F0;&#x4F5C;<strong>&#x865A;&#x8B66;(False Alarm)</strong>&#xFF0C;&#x5047;&#x9634;&#x6027;&#x5219;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x6F0F;&#x62A5;(Missed Detection)</strong>&#x3002;&#x5728;&#x7EDF;&#x8BA1;&#x5B66;&#x4E2D;&#xFF0C;&#x5047;&#x9633;&#x6027;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x7B2C;&#x4E00;&#x7C7B;&#x9519;&#x8BEF;(Type-I Error)</strong>&#xFF0C;&#x800C;&#x5047;&#x9633;&#x6027;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x7B2C;&#x4E8C;&#x7C7B;&#x9519;&#x8BEF;(Type-II Error)</strong>&#x3002;&#x4E24;&#x7C7B;&#x9519;&#x8BEF;&#x6240;&#x5BF9;&#x5E94;&#x7684;&#x9519;&#x8BEF;&#x7387;&#x4E5F;&#x5C31;&#x88AB;&#x79F0;&#x4E3A;&#x7B2C;&#x4E00;&#x7C7B;&#x9519;&#x8BEF;&#x7387;&#xFF08;&#x5047;&#x9633;&#x6027;&#x7387;&#xFF09;&#x548C;&#x7B2C;&#x4E8C;&#x7C7B;&#x9519;&#x8BEF;&#x7387;&#xFF08;&#x5047;&#x9634;&#x6027;&#x7387;&#xFF09;&#xFF0C;&#x8868;&#x793A;&#x6240;&#x6709;&#x9634;&#x6027;&#x6837;&#x672C;&#x88AB;&#x8BEF;&#x5224;&#x4E3A;&#x9633;&#x6027;&#x548C;&#x6240;&#x6709;&#x9633;&#x6027;&#x6837;&#x672C;&#x88AB;&#x8BEF;&#x5224;&#x4E3A;&#x9634;&#x6027;&#x7684;&#x6BD4;&#x4F8B;&#xFF0C;&#x5206;&#x522B;&#x7528;<script type="math/tex">\alpha</script>&#x548C;<script type="math/tex">\beta</script>&#x8868;&#x793A;&#xFF0C;&#x90A3;&#x4E48;&#x663E;&#x7136;&#xFF0C;&#x6709;</p>
<script type="math/tex; mode=display">Sn=1-\beta</script><script type="math/tex; mode=display">Sp=1-\alpha</script><p><br></p>
<h2 id="Neyman-Pearson&#x51B3;&#x7B56;"><a href="#Neyman-Pearson&#x51B3;&#x7B56;" class="headerlink" title="Neyman-Pearson&#x51B3;&#x7B56;"></a>Neyman-Pearson&#x51B3;&#x7B56;</h2><p>&#x524D;&#x9762;&#x5B9A;&#x4E49;&#x4E86;&#x4E24;&#x7C7B;&#x9519;&#x8BEF;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x4E3A;&#x4E86;&#x6700;&#x5C0F;&#x5316;&#x67D0;&#x79CD;&#x9519;&#x8BEF;&#x800C;&#x91C7;&#x53D6;&#x9002;&#x5408;&#x7684;&#x7B56;&#x7565;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x5728;&#x8FFD;&#x6C42;&#x4E00;&#x79CD;&#x9519;&#x8BEF;&#x7387;&#x6700;&#x5C0F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x53E6;&#x4E00;&#x7C7B;&#x9519;&#x8BEF;&#x7387;&#x53D8;&#x5927;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x7684;&#x7A0B;&#x5E8F;&#x59CB;&#x7EC8;&#x5224;&#x5B9A;&#x9633;&#x6027;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x5047;&#x9633;&#x6027;&#x7387;&#x663E;&#x7136;&#x5C31;&#x662F;<script type="math/tex">0</script>&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x6837;&#x505A;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#xFF0C;&#x56E0;&#x4E3A;&#x6240;&#x6709;&#x7684;&#x9634;&#x6027;&#x6837;&#x672C;&#x90FD;&#x88AB;&#x8BEF;&#x5224;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x66F4;&#x5E0C;&#x671B;&#x80FD;&#x591F;&#x5728;&#x628A;&#x4E00;&#x7C7B;&#x9519;&#x8BEF;&#x7387;&#x63A7;&#x5236;&#x5728;&#x4E00;&#x5B9A;&#x6C34;&#x5E73;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FFD;&#x6C42;&#x53E6;&#x4E00;&#x7C7B;&#x9519;&#x8BEF;&#x7387;&#x6700;&#x5C0F;&#xFF0C;&#x8FD9;&#x79CD;&#x51B3;&#x7B56;&#x89C4;&#x5219;&#x5C31;&#x662F;Neyman-Pearson&#x51B3;&#x7B56;&#x89C4;&#x5219;&#x3002;</p>
<p>&#x4EE5;&#x201C;&#x63A7;&#x5236;&#x7B2C;&#x4E8C;&#x7C7B;&#x9519;&#x8BEF;&#x7387;&#xFF0C;&#x6700;&#x5C0F;&#x5316;&#x7B2C;&#x4E00;&#x7C7B;&#x9519;&#x8BEF;&#x7387;&#x201D;&#x4E3A;&#x4F8B;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x6807;&#x662F;</p>
<script type="math/tex; mode=display">\begin{cases}
\min P_1(e) \\
P_2(e) - \epsilon_0 = 0 \\
\end{cases}</script><p>&#x4E3A;&#x4E86;&#x6C42;&#x89E3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x7528;&#x5230;&#x4E00;&#x79CD;&#x6570;&#x5B66;&#x4E0A;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x53EB;&#x505A;&#x62C9;&#x683C;&#x6717;&#x65E5;&#x4E58;&#x5B50;&#x6CD5;&#xFF0C;&#x8BE6;&#x7EC6;&#x89E3;&#x91CA;&#x767E;&#x79D1;&#x548C;&#x6559;&#x79D1;&#x4E66;&#x6BD4;&#x6211;&#x89E3;&#x91CA;&#x7684;&#x6E05;&#x695A;&#xFF0C;&#x7B80;&#x5355;&#x6765;&#x8BB2;&#x5C31;&#x662F;&#x5C06;&#x7EA6;&#x675F;&#x6761;&#x4EF6;&#x4E58;&#x4EE5;&#x4E00;&#x4E2A;&#x88AB;&#x79F0;&#x4E3A;&#x62C9;&#x683C;&#x6717;&#x65E5;&#x4E58;&#x5B50;&#x7684;&#x6570;<script type="math/tex">\lambda</script>&#xFF0C;&#x7136;&#x540E;&#x52A0;&#x5230;&#x539F;&#x51FD;&#x6570;&#x4E0A;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x8F6C;&#x5316;&#x4E3A;</p>
<script type="math/tex; mode=display">\min \gamma=P_1(e)+\lambda(P_2(e)-\epsilon_0)</script><p>&#x63A5;&#x4E0B;&#x6765;&#x6C42;&#x89E3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x6837;&#x672C;<script type="math/tex">\boldsymbol{x}</script>&#xFF0C;&#x8003;&#x8651;&#x6574;&#x4E2A;&#x6837;&#x672C;&#x7A7A;&#x95F4;&#xFF0C;&#x8BBE;&#x5176;&#x4E3A;<script type="math/tex">R</script>&#x3002;&#x5BF9;&#x4E8E;&#x4E24;&#x7C7B;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x51B3;&#x7B56;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x5C06;&#x5176;&#x4E00;&#x5206;&#x4E3A;&#x4E8C;&#xFF0C;&#x4E00;&#x4E2A;&#x533A;&#x57DF;&#x5185;&#x7684;&#x6837;&#x672C;&#x6211;&#x4EEC;&#x51B3;&#x7B56;&#x4E3A;<script type="math/tex">\omega_1</script>&#xFF0C;&#x8BBE;&#x5176;&#x4E3A;<script type="math/tex">R_1</script>&#xFF1B;&#x53E6;&#x4E00;&#x4E2A;&#x533A;&#x57DF;&#x51B3;&#x7B56;&#x4E3A;<script type="math/tex">\omega_2</script>&#xFF0C;&#x8BBE;&#x5176;&#x4E3A;<script type="math/tex">R_2</script>&#x3002;&#x4E24;&#x4E2A;&#x533A;&#x57DF;&#x4E4B;&#x95F4;&#x7684;&#x5206;&#x754C;&#x7EBF;&#x6216;&#x8005;&#x5206;&#x5272;&#x9762;&#x6211;&#x4EEC;&#x79F0;&#x4E4B;&#x4E3A;<strong>&#x51B3;&#x7B56;&#x8FB9;&#x754C;</strong>&#x6216;&#x8005;<strong>&#x5224;&#x522B;&#x754C;&#x9762;</strong>&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x663E;&#x7136;&#x6709;</p>
<script type="math/tex; mode=display">P_1(e)=\int_{R2}p(\boldsymbol{x}|\omega_1)\mathrm{d}\boldsymbol{x}</script><script type="math/tex; mode=display">P_2(e)=\int_{R1}p(\boldsymbol{x}|\omega_2)\mathrm{d}\boldsymbol{x}</script><p>&#x4EE3;&#x5165;&#x76EE;&#x6807;&#x516C;&#x5F0F;&#x4E2D;&#xFF0C;&#x6709;</p>
<script type="math/tex; mode=display">\gamma=\int_{R2}p(\boldsymbol{x}|\omega_1)\mathrm{d}\boldsymbol{x}+\lambda(\int_{R1}p(\boldsymbol{x}|\omega_2)\mathrm{d}\boldsymbol{x}-\epsilon_0)</script><p>&#x53E6;&#x5916;&#xFF0C;&#x7531;&#x6982;&#x7387;&#x76F8;&#x5173;&#x77E5;&#x8BC6;&#xFF0C;&#x6709;</p>
<script type="math/tex; mode=display">\begin{cases}
\int_R p(\boldsymbol{x}|\omega_1)\mathrm{d}\boldsymbol{x}=1 \\
\int_R p(\boldsymbol{x}|\omega_1)\mathrm{d}\boldsymbol{x}=\int_{R1} p(\boldsymbol{x}|\omega_1)\mathrm{d}\boldsymbol{x}+\int_{R2} p(\boldsymbol{x}|\omega_1)\mathrm{d}\boldsymbol{x} \\
\end{cases}</script><p>&#x53EF;&#x5F97;</p>
<script type="math/tex; mode=display">\int_{R2} p(\boldsymbol{x}|\omega_1)\mathrm{d}\boldsymbol{x} = 1 - \int_{R1} p(\boldsymbol{x}|\omega_1)\mathrm{d}\boldsymbol{x}</script><p>&#x518D;&#x6B21;&#x5E26;&#x5165;&#x5230;&#x76EE;&#x6807;&#x516C;&#x5F0F;&#x4E2D;&#xFF0C;&#x6709;</p>
<script type="math/tex; mode=display">
\begin{equation}
 \begin{split}
 \gamma
   &= 1-\int_{R1}p(\boldsymbol{x}|\omega_1)\mathrm{d}\boldsymbol{x}+\lambda(\int_{R1}p(\boldsymbol{x}|\omega_2)\mathrm{d}\boldsymbol{x}-\epsilon_0) \\
   &= (1-\lambda\epsilon_0)-\int_{R1}p(\boldsymbol{x}|\omega_1)\mathrm{d}\boldsymbol{x}+\lambda\int_{R1}p(\boldsymbol{x}|\omega_2)\mathrm{d}\boldsymbol{x} \\
   &= (1-\lambda\epsilon_0)+\int_{R1} \left( \lambda p(\boldsymbol{x}|\omega_2)-p(\boldsymbol{x}|\omega_1) \right)\mathrm{d}\boldsymbol{x}
 \end{split}
\end{equation}</script><p>&#x8BBE;&#x5224;&#x522B;&#x754C;&#x9762;&#x4E3A;<script type="math/tex">t</script>&#xFF0C;&#x5982;&#x679C;<script type="math/tex">\gamma</script>&#x53D6;&#x5F97;&#x6781;&#x503C;&#xFF0C;&#x90A3;&#x4E48;&#x5176;&#x504F;&#x5BFC;&#x6570;&#x90FD;&#x5E94;&#x4E3A;0&#xFF0C;&#x5373;<script type="math/tex">\gamma</script>&#x5BF9;<script type="math/tex">\lambda</script>&#x548C;<script type="math/tex">t</script>&#x6C42;&#x5BFC;&#x90FD;&#x5E94;&#x4E3A;0&#xFF0C;&#x6C42;&#x5F97;&#xFF1A;</p>
<ul>
<li>&#x5728;&#x5224;&#x522B;&#x754C;&#x9762;&#x4E0A;&#x6709;<script type="math/tex; mode=display">\lambda=\frac{p(\boldsymbol{x}|\omega_1)}{p(\boldsymbol{x}|\omega_2)}</script></li>
<li>&#x800C;&#x5224;&#x522B;&#x754C;&#x9762;&#x5E94;&#x4F7F;&#x5F97;&#x4E0B;&#x5F0F;&#x6210;&#x7ACB;<script type="math/tex; mode=display">P_2(e)=\int_{R1}p(\boldsymbol{x}|\omega_2)\mathrm{d}\boldsymbol{x}=\epsilon_0</script></li>
</ul>
<p>&#x7531;&#x76EE;&#x6807;&#x516C;&#x5F0F;</p>
<script type="math/tex; mode=display">\gamma=(1-\lambda\epsilon_0)+\int_{R1} \left( \lambda p(\boldsymbol{x}|\omega_2)-p(\boldsymbol{x}|\omega_1) \right)\mathrm{d}\boldsymbol{x}</script><p>&#x53EF;&#x77E5;&#xFF0C;&#x8981;&#x662F;<script type="math/tex">\gamma</script>&#x53D6;&#x5F97;&#x6700;&#x5C0F;&#x503C;&#xFF0C;&#x5E94;&#x4F7F;<script type="math/tex">R_1</script>&#x5185;&#x7684;&#x79EF;&#x5206;&#x9879;&#x5168;&#x4E3A;&#x8D1F;&#x503C;&#xFF0C;&#x5426;&#x5219;&#xFF0C;&#x53EF;&#x4EE5;&#x8C03;&#x6574;&#x5224;&#x522B;&#x754C;&#x9762;&#xFF0C;&#x5C06;&#x53D6;&#x5F97;&#x6B63;&#x503C;&#x7684;&#x533A;&#x57DF;&#x5212;&#x51FA;<script type="math/tex">R1</script>&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;<script type="math/tex">\gamma</script>&#x66F4;&#x5C0F;&#xFF0C;&#x6545;<script type="math/tex">R_1</script>&#x5E94;&#x6709;</p>
<script type="math/tex; mode=display">\lambda p(\boldsymbol{x}|\omega_2)-p(\boldsymbol{x}|\omega_1) \lt 0</script><p>&#x5C06;&#x4E0D;&#x7B49;&#x5F0F;&#x53D8;&#x6362;&#x4E00;&#x4E0B;&#xFF0C;&#x6709;</p>
<script type="math/tex; mode=display">\lambda p(\boldsymbol{x}|\omega_2) \lt p(\boldsymbol{x}|\omega_1)</script><p>&#x5C06;&#x53D8;&#x91CF;&#x79FB;&#x5230;&#x4E00;&#x8FB9;&#xFF0C;&#x5F97;</p>
<script type="math/tex; mode=display">\frac{p(\boldsymbol{x}|\omega_1)}{p(\boldsymbol{x}|\omega_2)}  \gt \lambda</script><p>&#x8FD9;&#x662F;<script type="math/tex">R_1</script>&#x7684;&#x51B3;&#x7B56;&#x533A;&#x57DF;&#xFF0C;&#x90A3;&#x4E48;<script type="math/tex">R_2</script>&#x663E;&#x7136;&#x5E94;&#x8BE5;&#x5C0F;&#x4E8E;<script type="math/tex">\lambda</script>&#xFF0C;&#x4EE4;</p>
<script type="math/tex; mode=display">l(\boldsymbol{x})=\frac{p(\boldsymbol{x}|\omega_1)}{p(\boldsymbol{x}|\omega_2)}</script><p>&#x6211;&#x4EEC;&#x5C31;&#x5F97;&#x5230;&#x4E86;&#x51B3;&#x7B56;&#x89C4;&#x5219;&#xFF0C;&#x4E3A;</p>
<script type="math/tex; mode=display">\text{若 }  l(\boldsymbol{x}) > \lambda  \text{，则 } \boldsymbol{x} \in \omega_1 \text{，否则 } \boldsymbol{x} \in \omega_2</script><p>&#x5176;&#x4E2D;&#x7684;&#x9608;&#x503C;<script type="math/tex">\lambda</script>&#x5E94;&#x5F53;&#x6EE1;&#x8DB3;&#x524D;&#x9762;&#x7684;<script type="math/tex">\int_{R1}p(\boldsymbol{x}|\omega_2)\mathrm{d}\boldsymbol{x}=\epsilon_0</script>&#xFF0C;&#x76F4;&#x63A5;&#x6C42;&#x6EE1;&#x8DB3;&#x6761;&#x4EF6;&#x7684;<script type="math/tex">\lambda</script>&#x5F80;&#x5F80;&#x5F88;&#x96BE;&#xFF0C;&#x6211;&#x4EEC;&#x5F80;&#x5F80;&#x901A;&#x8FC7;&#x5C1D;&#x8BD5;&#x7684;&#x529E;&#x6CD5;&#x5C1D;&#x8BD5;&#x51FA;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x597D;&#x7684;<script type="math/tex">\lambda</script>&#x503C;&#x6765;&#x3002;&#x4E00;&#x79CD;&#x529E;&#x6CD5;&#x662F;&#x4F7F;&#x7528;&#x4F3C;&#x7136;&#x6BD4;&#x51FD;&#x6570;<script type="math/tex">l(\boldsymbol{x})</script>&#x548C;&#x4F3C;&#x7136;&#x6BD4;&#x5BC6;&#x5EA6;&#x51FD;&#x6570;<script type="math/tex">p(l|\omega_2)</script>&#x6765;&#x5BF9;&#x4E0A;&#x9762;&#x7684;&#x9700;&#x6EE1;&#x8DB3;&#x6761;&#x4EF6;&#x7684;&#x516C;&#x5F0F;&#x8FDB;&#x884C;&#x8F6C;&#x6362;&#xFF0C;&#x5F97;</p>
<script type="math/tex; mode=display">
P_2(e)=\int_{R1}p(\boldsymbol{x}|\omega_2)\mathrm{d}\boldsymbol{x}=1-\int_0^{\lambda}p(l|\omega_2)\mathrm{d}l=\epsilon_0</script><p>&#x663E;&#x7136;&#xFF0C;<script type="math/tex">p(l|\omega_2) \geq 0</script>&#xFF0C;&#x6240;&#x4EE5;<script type="math/tex">P_2(e)</script>&#x662F;<script type="math/tex">\lambda</script>&#x7684;&#x5355;&#x8C03;&#x9012;&#x51CF;&#x51FD;&#x6570;&#x3002;&#x5F53;<script type="math/tex">\lambda=0</script>&#x65F6;&#xFF0C;<script type="math/tex">P(e)=1</script>&#xFF1B;&#x5F53;<script type="math/tex">\lambda\rightarrow\infty</script>&#x65F6;&#xFF0C;<script type="math/tex">P(e)\rightarrow1</script>&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x9009;&#x53D6;&#x4E0D;&#x540C;&#x7684;<script type="math/tex">\lambda</script>&#x8FDB;&#x884C;&#x5C1D;&#x8BD5;&#xFF0C;&#x603B;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x6EE1;&#x8DB3;&#x6761;&#x4EF6;&#x7684;&#x5408;&#x9002;&#x7684;<script type="math/tex">\lambda</script>&#x503C;&#x3002;</p>
<p><br></p>
<h2 id="&#x603B;&#x7ED3;"><a href="#&#x603B;&#x7ED3;" class="headerlink" title="&#x603B;&#x7ED3;"></a>&#x603B;&#x7ED3;</h2><p>&#x8FD9;&#x5927;&#x6982;&#x5C31;&#x662F;<strong>&#x7B80;&#x5355;&#x4ECB;&#x7ECD;</strong>&#x8D1D;&#x53F6;&#x65AF;&#x51B3;&#x7B56;&#x7684;&#x5927;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x4E86;&#xFF0C;&#x4E3B;&#x8981;&#x4ECB;&#x7ECD;&#x4E86;&#x8D1D;&#x53F6;&#x65AF;&#x516C;&#x5F0F;&#x548C;&#x57FA;&#x4E8E;&#x8D1D;&#x53F6;&#x65AF;&#x516C;&#x5F0F;&#x7684;&#x4E09;&#x79CD;&#x51B3;&#x7B56;&#x65B9;&#x6CD5;&#xFF1A;&#x6700;&#x5C0F;&#x9519;&#x8BEF;&#x7387;&#x8D1D;&#x53F6;&#x65AF;&#x51B3;&#x7B56;&#x3001;&#x6700;&#x5C0F;&#x98CE;&#x9669;&#x8D1D;&#x53F6;&#x65AF;&#x51B3;&#x7B56;&#x548C;Neyman-Pearson&#x51B3;&#x7B56;&#x3002;</p>
<p>&#x5BF9;&#x6BD4;&#x4E09;&#x79CD;&#x51B3;&#x7B56;&#x65B9;&#x6CD5;&#xFF0C;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#xFF0C;&#x5176;&#x5B9E;&#x4E09;&#x79CD;&#x51B3;&#x7B56;&#x7B56;&#x7565;&#x7684;&#x533A;&#x522B;&#x4EC5;&#x5728;&#x4E8E;&#x9608;&#x503C;&#x7684;&#x4E0D;&#x540C;&#x3002;&#x6700;&#x5C0F;&#x9519;&#x8BEF;&#x7387;&#x8D1D;&#x53F6;&#x65AF;&#x51B3;&#x7B56;&#x9009;&#x62E9;&#x5148;&#x9A8C;&#x6982;&#x7387;&#x6BD4;&#x4F5C;&#x4E3A;&#x9608;&#x503C;&#xFF0C;&#x4F7F;&#x603B;&#x7684;&#x9519;&#x8BEF;&#x7387;&#x6700;&#x5C0F;&#xFF1B;&#x6700;&#x5C0F;&#x98CE;&#x9669;&#x8D1D;&#x53F6;&#x65AF;&#x51B3;&#x7B56;&#x5219;&#x8003;&#x8651;&#x4E86;&#x5BF9;&#x4E8E;&#x4E0D;&#x540C;&#x51B3;&#x7B56;&#x7684;&#x201C;&#x60E9;&#x7F5A;&#x201D;&#xFF0C;&#x4F7F;&#x5F97;&#x51B3;&#x7B56;&#x7684;&#x98CE;&#x9669;&#x6700;&#x5C0F;&#xFF1B;Neyman-Pearson&#x51B3;&#x7B56;&#x5219;&#x662F;&#x901A;&#x8FC7;&#x8C03;&#x6574;&#x9608;&#x503C;&#xFF0C;&#x5728;&#x5C06;&#x67D0;&#x4E00;&#x7C7B;&#x9519;&#x8BEF;&#x7387;&#x63A7;&#x5236;&#x5728;&#x4E00;&#x5B9A;&#x6C34;&#x5E73;&#x7684;&#x6761;&#x4EF6;&#x4E0B;&#xFF0C;&#x4F7F;&#x53E6;&#x4E00;&#x7C7B;&#x9519;&#x8BEF;&#x7387;&#x5C3D;&#x53EF;&#x80FD;&#x5C0F;&#x3002;</p>
<p>&#x8BDD;&#x8BF4;&#x8FD9;&#x51E0;&#x5468;&#x6574;&#x7406;&#x7684;&#x4E1C;&#x897F;&#x4F3C;&#x4E4E;&#x90FD;&#x548C;&#x6211;&#x7684;&#x4E3B;&#x8981;&#x7814;&#x7A76;&#x65B9;&#x5411;&#x4E0D;&#x592A;&#x76F8;&#x5173;&#x554A;&#x2026;&#x2026;</p>
<p>&#x5514;&#x59C6;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x8981;&#x8BA4;&#x771F;&#x7814;&#x7A76;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x4E86;&#x3002;</p>
<p><img src="/images/04.jpg" alt=""></p>
<p>&#x8BDD;&#x8BF4;FE&#x8FD9;&#x8BDD;&#x771F;&#x662F;&#x9ED1;&#x554A;&#xFF0C;&#x592A;&#x4ED6;&#x5988;&#x7684;&#x9ED1;&#x4E86;&#x2026;&#x2026;</p>
<p><br></p>
<h2 id="&#x53C2;&#x8003;&#x6587;&#x732E;"><a href="#&#x53C2;&#x8003;&#x6587;&#x732E;" class="headerlink" title="&#x53C2;&#x8003;&#x6587;&#x732E;"></a>&#x53C2;&#x8003;&#x6587;&#x732E;</h2><p>&#x8FD9;&#x4E00;&#x7BC7;&#x4E3B;&#x8981;&#x53C2;&#x8003;&#x4E86;&#x6E05;&#x534E;&#x5927;&#x5B66;&#x51FA;&#x7248;&#x793E;&#x51FA;&#x7248;&#x7684;&#x5F20;&#x5B66;&#x5DE5;&#x7F16;&#x8457;&#x7684;&#x300A;&#x6A21;&#x5F0F;&#x8BC6;&#x522B;&#xFF08;&#x7B2C;&#x4E09;&#x7248;&#xFF09;&#x300B;&#x4E2D;&#x7B2C;&#x4E8C;&#x7AE0;&#x8D1D;&#x53F6;&#x65AF;&#x51B3;&#x7B56;&#x76F8;&#x5173;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x53E6;&#x5916;&#x4E5F;&#x53C2;&#x8003;&#x4E86;Peter Harrington&#x8457;&#xFF0C;&#x674E;&#x60A6;&#x3001;&#x674E;&#x9E4F;&#x3001;&#x66F2;&#x4E9A;&#x4E1C;&#x3001;&#x738B;&#x658C;&#x7FFB;&#x8BD1;&#x7684;&#x300A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x5B9E;&#x6218;&#x300B;&#x4E2D;&#x7B2C;&#x56DB;&#x7AE0;&#x6734;&#x7D20;&#x8D1D;&#x53F6;&#x65AF;&#x76F8;&#x5173;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>

      
    </div>

  </div>

  <div class="article-footer">
    <div class="article-meta pull-left">

    
      

    <span class="post-categories">
      <i class="icon-categories"></i>
        <a href="/categories/简单讲讲/">简单讲讲</a>
    </span>
    

    
    

    <span class="post-tags">
      <i class="icon-tags"></i>
        <a href="/tags/机器学习/">机器学习</a><a href="/tags/模式识别/">模式识别</a><a href="/tags/统计决策/">统计决策</a>
    </span>
    

    </div>

    
  </div>
</article>


    </main>

    <footer class="site-footer">
  <p class="site-info">
    Proudly powered by <a href="https://hexo.io/" target="_blank">Hexo</a> and
    Theme by <a href="https://github.com/kawaiiQ/kawaiiHacker" target="_blank">kawaiiHacker</a>
    </br>
    
    &copy; 2018 _kawaiiQ
    
  </p>
</footer>
    
    
<script>
  widget_settings = {
    maxDistance: 15,
    sensitive: 0.01
  };
</script>
<script src="/js/logo-widget.js"></script>



<script type="text/x-mathjax-config">
  MathJax.Hub.Config({
    tex2jax: {
      inlineMath: [['$','$'], ["\\(","\\)"] ],
      processEscapes: true
    }
  });
</script>
<script type="text/javascript" async
  src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/MathJax.js?config=TeX-MML-AM_CHTML">
</script>


  </div>
</div>
</body>
</html>