<!DOCTYPE HTML>
<html>
<head>
  <meta charset="utf-8">
  
  <title>简单讲讲，卷积神经网络是啥？ | _kawaiiQ&#39;s blog</title>

  
  <meta name="author" content="_kawaiiQ">
  

  
  <meta name="description" content="&amp;#x4E0D;&amp;#x77E5;&amp;#x4E0D;&amp;#x89C9;&amp;#x4E24;&amp;#x4E2A;&amp;#x591A;&amp;#x6708;&amp;#x8FC7;&amp;#x53BB;&amp;#x4E86;&amp;#x3002;&amp;#x56DE;&amp;#x60F3;&amp;#x8D77;&amp;#x4E0A;&amp;#x6B21;&amp;#x66F4;&amp;#x65B0;&amp;#x7684;&amp;#x65F6;&amp;#x5019;&amp;#x6253;&amp;#x7B97;&amp;#x5728;&amp;#x4E2A;&amp;#x4EBA;&amp;#x4ECB;&amp;#x7ECD;&amp;#x7684;&amp;#x9875;&amp;#x9762;&amp;#x91CC;&amp;#x7684;&amp;#x8FD1;&amp;#x671F;&amp;#x8BA1;&amp;#x5212;&amp;#x91CC;&amp;#x7ACB;&amp;#x5FD7;&amp;#x8981;&amp;#x5468;&amp;#x66F4;&amp;#xFF0C;&amp;#x81F3;&amp;#x5C11;&amp;#x4E5F;&amp;#x8981;&amp;#x6708;&amp;#x66F4;&amp;#xFF0C;&amp;#x73B0;&amp;#x5728;&amp;#x770B;&amp;#x6765;&amp;#x2026;&amp;#x2026;&amp;#x591A;&amp;#x4E8F;&amp;#x6211;&amp;#x673A;&amp;#x667A;&amp;#x5730;&amp;#x5728;&amp;#x6700;&amp;#x540E;&amp;#x4E00;&amp;#x523B;&amp;#x628A;&amp;#x5B83;&amp;#x5220;&amp;#x6389;&amp;#x4E86;(&amp;#x9003;

&amp;#x8BDD;&amp;#x8BF4;&amp;#x6700;&amp;#x8FD1;&amp;#x6DF1;&amp;#x5EA6;&amp;#x5B66;&amp;#x4E60;&amp;#x90A3;&amp;#x662F;&amp;#x76F8;&amp;#x5F53;&amp;#x706B;&amp;#x554A;&amp;#xFF0C;&amp;#x5443;&amp;#x2026;&amp;#x2026;&amp;#x81F3;&amp;#x5C11;&amp;#x6211;&amp;#x5F53;&amp;#x521D;&amp;#x60F3;&amp;#x5199;&amp;#x8FD9;&amp;#x7BC7;&amp;#x7684;&amp;#x65F6;&amp;#x5019;&amp;#x8FD8;&amp;#x6BD4;&amp;#x8F83;&amp;#x706B;&amp;#xFF0C;&amp;#x73B0;&amp;#x5728;&amp;#x597D;&amp;#x50CF;&amp;#x98CE;&amp;#x53E3;&amp;#x5DF2;&amp;#x7ECF;&amp;#x5230;&amp;#x533A;&amp;#x5757;&amp;#x94FE;&amp;#x4E0A;&amp;#x53BB;&amp;#x4E86;&amp;#x3002;&amp;#x4E0D;&amp;#x8FC7;&amp;#x8D77;&amp;#x7801;&amp;#x73B0;&amp;#x5728;&amp;#x6DF1;&amp;#x5EA6;&amp;#x5B66;&amp;#x4E60;&amp;#x8FD8;&amp;#x7B97;&amp;#x662F;&amp;#x6BD4;&amp;#x8F83;&amp;#x70ED;&amp;#x95E8;&amp;#x7684;&amp;#x65B9;&amp;#x5411;&amp;#x3002;&amp;#x60F3;&amp;#x5F53;&amp;#x521D;&amp;#xFF0C;&amp;#x4E00;&amp;#x8BB2;&amp;#x4EBA;&amp;#x5DE5;&amp;#x667A;&amp;#x80FD;&amp;#x5C31;&amp;#x662F;&amp;#x6DF1;&amp;#x5EA6;&amp;#x5B66;&amp;#x4E60;&amp;#xFF0C;&amp;#x7136;&amp;#x540E;&amp;#x5C31;&amp;#x662F;&amp;#x8FD9;NN&amp;#xFF0C;&amp;#x90A3;NN&amp;#xFF0C;&amp;#x4EC0;&amp;#x4E48;&amp;#x4EC0;&amp;#x4E48;NN&amp;#x7684;&amp;#xFF0C;&amp;#x5F53;&amp;#x521D;&amp;#x5565;&amp;#x4E5F;&amp;#x4E0D;&amp;#x61C2;&amp;#xFF0C;&amp;#x5149;&amp;#x542C;&amp;#x8FD9;&amp;#x4E9B;NN&amp;#x5C31;&amp;#x89C9;&amp;#x5F97;&amp;#x597D;&amp;#x9AD8;&amp;#x7AEF;&amp;#x597D;&amp;#x9AD8;&amp;#x7AEF;&amp;#x7684;&amp;#x3002;&amp;#x4E0D;&amp;#x8FC7;&amp;#x73B0;&amp;#x5728;&amp;#x6709;&amp;#x4E86;&amp;#x4E00;&amp;#x5B9A;&amp;#x4E86;&amp;#x89E3;&amp;#x4E4B;&amp;#x540E;&amp;#xFF0C;&amp;#x5176;&amp;#x5B9E;&amp;#x53EF;&amp;#x4EE5;&amp;#x53D1;&amp;#x73B0;&amp;#xFF0C;NN&amp;#x5176;&amp;#x5B9E;&amp;#x5C31;&amp;#x662F;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#xFF08;Neural Network&amp;#xFF09;&amp;#x7684;&amp;#x7F29;&amp;#x5199;&amp;#xFF0C;&amp;#x5B83;&amp;#x4EEC;&amp;#x5176;&amp;#x5B9E;&amp;#x4E5F;&amp;#x5C31;&amp;#x662F;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x4E2D;&amp;#x7684;&amp;#x4E00;&amp;#x79CD;&amp;#x800C;&amp;#x5DF2;&amp;#x3002;&amp;#x800C;&amp;#x6240;&amp;#x8C13;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#xFF0C;&amp;#x5176;&amp;#x5B9E;&amp;#x53EA;&amp;#x662F;&amp;#x5BF9;&amp;#x4E00;&amp;#x7C7B;&amp;#x7B97;&amp;#x6CD5;&amp;#x7684;&amp;#x547D;&amp;#x540D;&amp;#x800C;&amp;#x5DF2;&amp;#xFF0C;&amp;#x8DDF;&amp;#x751F;&amp;#x7269;&amp;#x5B66;&amp;#x610F;&amp;#x4E49;&amp;#x4E0A;&amp;#x771F;&amp;#x6B63;&amp;#x7684;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x5E76;&amp;#x6CA1;&amp;#x6709;&amp;#x4EC0;&amp;#x4E48;&amp;#x5173;&amp;#x7CFB;&amp;#x3002;
&amp;#x90A3;&amp;#x8FD9;&amp;#x6B21;&amp;#x6B63;&amp;#x597D;&amp;#x5C31;&amp;#x603B;&amp;#x7ED3;&amp;#x4E0B;&amp;#x8FD9;&amp;#x4E9B;NN&amp;#x91CC;&amp;#x7684;CNN&amp;#xFF0C;&amp;#x5377;&amp;#x79EF;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#xFF08;Convolutional Neural Network&amp;#xFF09;&amp;#x3002;&amp;#x56E0;&amp;#x4E3A;&amp;#x5377;&amp;#x79EF;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x5176;&amp;#x5B9E;&amp;#x53EA;&amp;#x662F;&amp;#x5F88;&amp;#x5BBD;&amp;#x6CDB;&amp;#x7684;&amp;#x4E00;&amp;#x4E2A;&amp;#x5927;&amp;#x7C7B;&amp;#xFF0C;&amp;#x771F;&amp;#x6B63;&amp;#x6BD4;&amp;#x8F83;&amp;#x6709;&amp;#x610F;&amp;#x4E49;&amp;#x7684;&amp;#x662F;&amp;#x4E0B;&amp;#x9762;&amp;#x5177;&amp;#x4F53;&amp;#x7684;&amp;#x5404;&amp;#x79CD;&amp;#x7ED3;&amp;#x6784;&amp;#xFF0C;&amp;#x6240;&amp;#x4EE5;&amp;#x8FD9;&amp;#x91CC;&amp;#x5C31;&amp;#x7B80;&amp;#x5355;&amp;#x8BB2;&amp;#x8BB2;&amp;#xFF0C;&amp;#x5377;&amp;#x79EF;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x662F;&amp;#x4E2A;&amp;#x5565;&amp;#x5427;&amp;#x3002;">
  

  
  
  <meta name="keywords" content="模式识别,神经网络,深度学习,卷积神经网络（CNN）">
  

  <meta id="viewport" name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no, minimal-ui">
  <meta name="apple-mobile-web-app-capable" content="yes">
  <meta name="apple-mobile-web-app-status-bar-style" content="black">

  <meta property="og:title" content="简单讲讲，卷积神经网络是啥？"/>

  <meta property="og:site_name" content="_kawaiiQ&#39;s blog"/>

  
  <meta property="og:image" content="/favicon.ico"/>
  

  <link href="/favicon.ico" rel="icon">
  <link rel="alternate" href="/atom.xml" title="_kawaiiQ&#39;s blog" type="application/atom+xml">
  <link rel="stylesheet" href="/css/style.css" media="screen" type="text/css">

  <link rel="dns-prefetch" href="https://cdnjs.cloudflare.com" />

</head>


<body>
<div class="blog">
  <div class="content">

    <header>
  <div class="site-branding">
    <h1 class="site-logo">
      <div>
        <a href="/"><img src="/images/logo.png" /></a>
        
          <a href="/"><img id="logo-widget" src="/images/widget.png" /></a>
        
      </div>
    </h1>
    <p class="site-description">Blind Busy All Day</p>
  </div>
  <nav class="site-navigation">
    <ul>
      
        <li><a href="/">主页</a></li>
      
        <li><a href="/categories">分类</a></li>
      
        <li><a href="/archives">所有文章</a></li>
      
        <li><a href="/about">关于我</a></li>
      
    </ul>
  </nav>
</header>

    <main class="site-main posts-loop">
    <article>

  
    
    <h3 class="article-title"><span>简单讲讲，卷积神经网络是啥？</span></h3>
    
  

  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/articles/14/" rel="bookmark">
        <time class="entry-date published" datetime="2018-05-15T03:34:56.000Z">
          2018-05-15
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <p>&#x4E0D;&#x77E5;&#x4E0D;&#x89C9;&#x4E24;&#x4E2A;&#x591A;&#x6708;&#x8FC7;&#x53BB;&#x4E86;&#x3002;&#x56DE;&#x60F3;&#x8D77;&#x4E0A;&#x6B21;&#x66F4;&#x65B0;&#x7684;&#x65F6;&#x5019;&#x6253;&#x7B97;&#x5728;&#x4E2A;&#x4EBA;&#x4ECB;&#x7ECD;&#x7684;&#x9875;&#x9762;&#x91CC;&#x7684;&#x8FD1;&#x671F;&#x8BA1;&#x5212;&#x91CC;&#x7ACB;&#x5FD7;&#x8981;&#x5468;&#x66F4;&#xFF0C;&#x81F3;&#x5C11;&#x4E5F;&#x8981;&#x6708;&#x66F4;&#xFF0C;&#x73B0;&#x5728;&#x770B;&#x6765;&#x2026;&#x2026;&#x591A;&#x4E8F;&#x6211;&#x673A;&#x667A;&#x5730;&#x5728;&#x6700;&#x540E;&#x4E00;&#x523B;&#x628A;&#x5B83;&#x5220;&#x6389;&#x4E86;(&#x9003;</p>
<p><img src="/images/05.gif" alt=""></p>
<p>&#x8BDD;&#x8BF4;&#x6700;&#x8FD1;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x90A3;&#x662F;&#x76F8;&#x5F53;&#x706B;&#x554A;&#xFF0C;&#x5443;&#x2026;&#x2026;&#x81F3;&#x5C11;&#x6211;&#x5F53;&#x521D;&#x60F3;&#x5199;&#x8FD9;&#x7BC7;&#x7684;&#x65F6;&#x5019;&#x8FD8;&#x6BD4;&#x8F83;&#x706B;&#xFF0C;&#x73B0;&#x5728;&#x597D;&#x50CF;&#x98CE;&#x53E3;&#x5DF2;&#x7ECF;&#x5230;&#x533A;&#x5757;&#x94FE;&#x4E0A;&#x53BB;&#x4E86;&#x3002;&#x4E0D;&#x8FC7;&#x8D77;&#x7801;&#x73B0;&#x5728;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x8FD8;&#x7B97;&#x662F;&#x6BD4;&#x8F83;&#x70ED;&#x95E8;&#x7684;&#x65B9;&#x5411;&#x3002;&#x60F3;&#x5F53;&#x521D;&#xFF0C;&#x4E00;&#x8BB2;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x5C31;&#x662F;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x662F;&#x8FD9;NN&#xFF0C;&#x90A3;NN&#xFF0C;&#x4EC0;&#x4E48;&#x4EC0;&#x4E48;NN&#x7684;&#xFF0C;&#x5F53;&#x521D;&#x5565;&#x4E5F;&#x4E0D;&#x61C2;&#xFF0C;&#x5149;&#x542C;&#x8FD9;&#x4E9B;NN&#x5C31;&#x89C9;&#x5F97;&#x597D;&#x9AD8;&#x7AEF;&#x597D;&#x9AD8;&#x7AEF;&#x7684;&#x3002;&#x4E0D;&#x8FC7;&#x73B0;&#x5728;&#x6709;&#x4E86;&#x4E00;&#x5B9A;&#x4E86;&#x89E3;&#x4E4B;&#x540E;&#xFF0C;&#x5176;&#x5B9E;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#xFF0C;NN&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF08;Neural Network&#xFF09;&#x7684;&#x7F29;&#x5199;&#xFF0C;&#x5B83;&#x4EEC;&#x5176;&#x5B9E;&#x4E5F;&#x5C31;&#x662F;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x4E00;&#x79CD;&#x800C;&#x5DF2;&#x3002;&#x800C;&#x6240;&#x8C13;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x5176;&#x5B9E;&#x53EA;&#x662F;&#x5BF9;&#x4E00;&#x7C7B;&#x7B97;&#x6CD5;&#x7684;&#x547D;&#x540D;&#x800C;&#x5DF2;&#xFF0C;&#x8DDF;&#x751F;&#x7269;&#x5B66;&#x610F;&#x4E49;&#x4E0A;&#x771F;&#x6B63;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5E76;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x5173;&#x7CFB;&#x3002;</p>
<p>&#x90A3;&#x8FD9;&#x6B21;&#x6B63;&#x597D;&#x5C31;&#x603B;&#x7ED3;&#x4E0B;&#x8FD9;&#x4E9B;NN&#x91CC;&#x7684;CNN&#xFF0C;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF08;Convolutional Neural Network&#xFF09;&#x3002;&#x56E0;&#x4E3A;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5176;&#x5B9E;&#x53EA;&#x662F;&#x5F88;&#x5BBD;&#x6CDB;&#x7684;&#x4E00;&#x4E2A;&#x5927;&#x7C7B;&#xFF0C;&#x771F;&#x6B63;&#x6BD4;&#x8F83;&#x6709;&#x610F;&#x4E49;&#x7684;&#x662F;&#x4E0B;&#x9762;&#x5177;&#x4F53;&#x7684;&#x5404;&#x79CD;&#x7ED3;&#x6784;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x5C31;&#x7B80;&#x5355;&#x8BB2;&#x8BB2;&#xFF0C;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x662F;&#x4E2A;&#x5565;&#x5427;&#x3002;</p>
<a id="more"></a>
<p><br></p>
<h2 id="&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;"><a href="#&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;" class="headerlink" title="&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;"></a>&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;</h2><p>&#x5176;&#x5B9E;&#x76EE;&#x524D;&#x6240;&#x8BB2;&#x7684;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#xFF0C;&#x629B;&#x5F00;&#x5C11;&#x6570;&#x5C16;&#x7AEF;&#x9886;&#x57DF;&#x7684;&#x7814;&#x7A76;&#xFF0C;&#x90FD;&#x662F;&#x5728;&#x8BB2;&#x673A;&#x5668;&#x5B66;&#x4E60;&#xFF0C;&#x6240;&#x4EE5;&#x4E00;&#x822C;&#x6211;&#x4E0D;&#x592A;&#x613F;&#x610F;&#x8DDF;&#x4EBA;&#x8BF4;&#x6211;&#x662F;&#x7814;&#x7A76;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x89C9;&#x5F97;&#x8FD9;&#x50CF;&#x4E2A;&#x5671;&#x5934;&#x3002;&#x800C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x672C;&#x8D28;&#x4E0A;&#x5E72;&#x7684;&#x4E8B;&#x60C5;&#x5176;&#x5B9E;&#x8FD8;&#x662F;&#x627E;&#x51FD;&#x6570;&#x62DF;&#x5408;&#x6216;&#x8005;&#x5212;&#x5206;&#x6837;&#x672C;&#x70B9;&#x3002;</p>
<p>&#x4E4B;&#x524D;&#x5728;Coursera&#x4E0A;&#x5165;&#x95E8;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x603B;&#x7ED3;&#x4E86;<a href="/articles/3/">&#x666E;&#x901A;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;</a>&#x7684;&#x7ED3;&#x6784;&#x3002;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x76F8;&#x5BF9;&#x4E8E;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x6216;&#x8005;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x8FD9;&#x79CD;&#x539F;&#x59CB;&#x7684;&#x65B9;&#x6CD5;&#x4E00;&#x4E2A;&#x5F88;&#x5927;&#x7684;&#x4F18;&#x52BF;&#x662F;&#x5B83;&#x5BF9;&#x4E8E;&#x975E;&#x7EBF;&#x6027;&#x51FD;&#x6570;&#x7684;&#x62DF;&#x5408;&#x80FD;&#x529B;&#x975E;&#x5E38;&#x5F3A;&#x3002;&#x5728;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x91CC;&#xFF0C;&#x5BF9;&#x4E8E;&#x975E;&#x7EBF;&#x6027;&#x51FD;&#x6570;&#xFF0C;&#x5927;&#x5BB6;&#x9700;&#x8981;&#x60F3;&#x529E;&#x6CD5;<a href="/articles/1/">&#x6DFB;&#x52A0;&#x65B0;&#x7279;&#x5F81;&#x9879;&#x8F6C;&#x4E3A;&#x66F4;&#x9AD8;&#x7EF4;&#x5EA6;&#x95EE;&#x9898;</a>&#x6765;&#x8BA9;&#x5B83;&#x53D8;&#x6210;&#x7EBF;&#x6027;&#x7684;&#xFF0C;&#x8FD9;&#x5C31;&#x5F88;&#x9EBB;&#x70E6;&#xFF0C;&#x56E0;&#x4E3A;&#x5F88;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#x6211;&#x4EEC;&#x6839;&#x672C;&#x4E0D;&#x77E5;&#x9053;&#x9700;&#x8981;&#x62DF;&#x5408;&#x7684;&#x6A21;&#x578B;&#x3002;&#x800C;&#x5728;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x91CC;&#xFF0C;&#x6240;&#x8C13;&#x201C;&#x4E09;&#x4E2A;&#x81ED;&#x76AE;&#x5320;&#xFF0C;&#x9876;&#x4E2A;&#x8BF8;&#x845B;&#x4EAE;&#x201D;&#xFF0C;&#x867D;&#x7136;&#x5355;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x611F;&#x77E5;&#x5668;&#x8868;&#x73B0;&#x5F88;&#x5F31;&#xFF0C;&#x4F46;&#x662F;&#x5927;&#x5BB6;&#x5728;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x5C42;&#x5C42;&#x5408;&#x4F5C;&#xFF0C;&#x6700;&#x540E;&#x603B;&#x4F53;&#x7684;&#x6548;&#x679C;&#x5C31;&#x975E;&#x5E38;&#x597D;&#x3002;</p>
<p><img src="/articles/2/pic7.png" alt=""></p>
<p>&#x65E2;&#x7136;&#x201C;&#x4E09;&#x4E2A;&#x81ED;&#x76AE;&#x5320;&#xFF0C;&#x9876;&#x4E2A;&#x8BF8;&#x845B;&#x4EAE;&#x201D;&#xFF0C;&#x90A3;&#x663E;&#x7136;&#x201C;&#x597D;&#x591A;&#x81ED;&#x76AE;&#x5320;&#xFF0C;&#x5E72;&#x6B7B;&#x8BF8;&#x845B;&#x4EAE;&#x201D;&#xFF0C;&#x90A3;&#x81EA;&#x7136;&#xFF0C;&#x589E;&#x52A0;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x6DF1;&#x5EA6;&#xFF08;&#x5C42;&#x6570;&#xFF09;&#x548C;&#x5BBD;&#x5EA6;&#xFF0C;&#x80FD;&#x591F;&#x63D0;&#x9AD8;&#x5176;&#x6548;&#x679C;&#x3002;&#x4E8E;&#x662F;&#xFF0C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8D8A;&#x6765;&#x8D8A;&#x6DF1;&#xFF0C;&#x5C31;&#x53D8;&#x6210;&#x4E86;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E86;&#xFF0C;&#x4E5F;&#x5C31;&#x6709;&#x4E86;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x8BF4;&#xFF0C;&#x6DF1;&#x5EA6;&#x7F51;&#x7EDC;&#x5C31;&#x662F;&#x6DF1;&#x5EA6;&#x5F88;&#x9AD8;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;</p>
<p>&#x7136;&#x800C;&#xFF0C;&#x867D;&#x7136;&#x9053;&#x7406;&#x662F;&#x8FD9;&#x4E48;&#x8BB2;&#xFF0C;&#x663E;&#x7136;&#x6DF1;&#x5EA6;&#x7F51;&#x7EDC;&#x4E5F;&#x4E0D;&#x662F;&#x4E00;&#x5C42;&#x5C42;&#x5730;&#x645E;&#x795E;&#x7ECF;&#x5143;&#x5C31;&#x642D;&#x8D77;&#x6765;&#x4E86;&#x3002;&#x5728;&#x666E;&#x901A;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x4E5F;&#x5C31;&#x6709;&#x4E2A;&#x4E24;&#x4E09;&#x5C42;&#x7684;&#x795E;&#x7ECF;&#x5143;&#xFF0C;&#x7528;<a href="https://en.wikipedia.org/wiki/Sigmoid_function" target="_blank" rel="external">sigmoid&#x51FD;&#x6570;</a>&#x6FC0;&#x6D3B;&#x4E0B;&#xFF0C;&#x4E00;&#x5C42;&#x51E0;&#x767E;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x4E5F;&#x5C31;&#x591F;&#x591A;&#x4E86;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x52A8;&#x8F84;&#x5C31;&#x662F;&#x5341;&#x51E0;&#x5C42;&#x7684;&#x6DF1;&#x5EA6;&#x8DDF;&#x4E00;&#x5C42;&#x51E0;&#x5343;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x5BBD;&#x5EA6;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5C31;&#x4F1A;&#x5E26;&#x6765;&#x4E24;&#x4E2A;&#x6F5C;&#x5728;&#x7684;&#x9690;&#x60A3;&#xFF1A;&#x68AF;&#x5EA6;&#x6D88;&#x5931;&#x548C;&#x68AF;&#x5EA6;&#x7206;&#x70B8;&#x3002;</p>
<p>&#x7B80;&#x5355;&#x5730;&#x8BB2;&#xFF0C;&#x68AF;&#x5EA6;&#x6D88;&#x5931;&#x548C;&#x68AF;&#x5EA6;&#x7206;&#x70B8;&#x5C31;&#x662F;</p>
<script type="math/tex; mode=display">0.9 \times 0.9 \times 0.9 \times \cdots \approx 0</script><script type="math/tex; mode=display">1.1 \times 1.1 \times 1.1 \times \cdots \approx \infty</script><p>&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5728;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x6C42;&#x68AF;&#x5EA6;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7531;&#x4E8E;&#x7279;&#x5F81;&#x6BCF;&#x4F20;&#x4E00;&#x5C42;&#x90FD;&#x8981;&#x4E58;&#x4EE5;&#x5BF9;&#x5E94;&#x7684;&#x6743;&#x91CD;&#x548C;&#x5BFC;&#x6570;&#xFF0C;&#x56E0;&#x6B64;&#x5982;&#x679C;&#x6BCF;&#x5C42;&#x90FD;&#x6BD4;$1$&#x5C0F;&#x4E00;&#x70B9;&#xFF0C;&#x6700;&#x540E;&#x5C31;&#x63A5;&#x8FD1;&#x4E8E;0&#xFF0C;&#x4E8E;&#x662F;&#x5C31;&#x201C;&#x6D88;&#x5931;&#x201D;&#x4E86;&#xFF1B;&#x800C;&#x5982;&#x679C;&#x6BD4;$1$&#x5927;&#x4E86;&#xFF0C;&#x90A3;&#x6700;&#x540E;&#x5C31;&#x6EDA;&#x96EA;&#x7403;&#x8D8A;&#x6765;&#x8D8A;&#x5927;&#xFF0C;&#x5C31;&#x201C;&#x7206;&#x70B8;&#x201D;&#x4E86;&#x3002;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x4F1A;&#x628A;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x6362;&#x6210;<a href="https://en.wikipedia.org/wiki/Rectifier_(neural_networks)" target="_blank" rel="external">ReLU</a>&#x8FD9;&#x6837;&#x7684;&#x975E;&#x7EBF;&#x6027;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF0C;&#x68AF;&#x5EA6;&#x8981;&#x4E48;&#x662F;$1$&#xFF08;&#x6709;&#x635F;&#x5931;&#xFF09;&#xFF0C;&#x8981;&#x4E48;&#x662F;$0$&#xFF08;&#x6CA1;&#x6709;&#x635F;&#x5931;&#xFF09;&#xFF0C;&#x5C31;&#x907F;&#x514D;&#x4E86;&#x56E0;&#x4E3A;&#x5BFC;&#x6570;&#x5BFC;&#x81F4;&#x7684;&#x68AF;&#x5EA6;&#x6D88;&#x5931;&#x6216;&#x7206;&#x70B8;&#x95EE;&#x9898;&#x4E86;&#x3002;&#x800C;&#x5BF9;&#x4E8E;&#x6743;&#x91CD;&#xFF0C;&#x5219;&#x901A;&#x8FC7;Batchnorm&#x6216;&#x8005;&#x6B8B;&#x5DEE;&#x6765;&#x89E3;&#x51B3;&#xFF0C;&#x4E0D;&#x8FC7;&#x8FD9;&#x4E2A;&#x5C31;&#x76F8;&#x5BF9;&#x590D;&#x6742;&#x70B9;&#x4E86;&#x3002;</p>
<p>&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x65B9;&#x9762;&#x5219;&#x662F;&#x7ED3;&#x6784;&#x4E0A;&#x7684;&#x3002;&#x5728;&#x666E;&#x901A;&#x7684;&#x6D45;&#x5C42;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x91CC;&#xFF0C;&#x9664;&#x4E86;&#x8F93;&#x51FA;&#x5C42;&#xFF0C;&#x6BCF;&#x4E00;&#x5C42;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x90FD;&#x4E0E;&#x4E0B;&#x4E00;&#x5C42;&#x7684;&#x6240;&#x6709;&#x795E;&#x7ECF;&#x5143;&#x8FDE;&#x63A5;&#x7740;&#xFF0C;&#x8FD9;&#x53EB;&#x5168;&#x8FDE;&#x63A5;&#x3002;&#x5168;&#x8FDE;&#x63A5;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5E26;&#x6765;&#x4E86;&#x5F88;&#x5F3A;&#x7684;&#x51FD;&#x6570;&#x62DF;&#x5408;&#x80FD;&#x529B;&#xFF0C;&#x4F46;&#x5176;&#x8BAD;&#x7EC3;&#x4F1A;&#x66F4;&#x56F0;&#x96BE;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x6709;&#x4E86;&#x8FC7;&#x62DF;&#x5408;&#x7684;&#x98CE;&#x9669;&#x3002;&#x4E3E;&#x4E2A;&#x6817;&#x5B50;&#xFF0C;&#x6211;&#x62FF;&#x5404;&#x79CD;&#x81EA;&#x62CD;&#x7684;&#x7167;&#x7247;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#xFF0C;&#x7ED3;&#x679C;&#x8BAD;&#x7EC3;&#x534A;&#x5929;&#x8BAD;&#x7EC3;&#x4E0D;&#x51FA;&#x6765;&#xFF0C;&#x4E0D;&#x8BA4;&#x6211;&#xFF0C;&#x8FD9;&#x662F;&#x8BAD;&#x7EC3;&#x56F0;&#x96BE;&#xFF0C;&#x6B20;&#x62DF;&#x5408;&#xFF1B;&#x90A3;&#x6211;&#x9000;&#x4E00;&#x6B65;&#xFF0C;&#x53EA;&#x62FF;&#x6211;&#x7684;&#x8BC1;&#x4EF6;&#x7167;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#xFF0C;&#x7ED3;&#x679C;&#x8BAD;&#x7EC3;&#x51FA;&#x6765;&#x6211;&#x7A0D;&#x5FAE;&#x4FA7;&#x4E2A;&#x8138;&#x5C31;&#x8BA4;&#x4E0D;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x8BC6;&#x522B;&#x7684;&#x6297;&#x5E72;&#x6270;&#x80FD;&#x529B;&#x5DEE;&#xFF0C;&#x8FD9;&#x662F;&#x8FC7;&#x62DF;&#x5408;&#x3002;</p>
<img src="/articles/14/pic1.jpg" alt="pic1.jpg" title="">
<p>&#x53E6;&#x5916;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5168;&#x8FDE;&#x63A5;&#x610F;&#x5473;&#x7740;&#x5927;&#x91CF;&#x7684;&#x6743;&#x91CD;&#x4E0E;&#x8BA1;&#x7B97;&#xFF0C;&#x8FD9;&#x5F80;&#x5F80;&#x4F1A;&#x52A0;&#x91CD;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x8D1F;&#x62C5;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5F53;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x6DF1;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#x90FD;&#x6781;&#x5927;&#x5730;&#x52A0;&#x5927;&#x4E4B;&#x540E;&#xFF0C;&#x8F93;&#x5165;&#x7279;&#x5F81;&#x540E;&#x9700;&#x8981;&#x8BA1;&#x7B97;&#x7684;&#x89C4;&#x6A21;&#x662F;&#x96BE;&#x4EE5;&#x60F3;&#x8C61;&#x7684;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x8FD8;&#x9700;&#x8981;&#x5BF9;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x7ED3;&#x6784;&#x8FDB;&#x884C;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x7684;&#x7B80;&#x5316;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x66F4;&#x5E0C;&#x671B;&#x6211;&#x4EEC;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x80FD;&#x591F;&#x5728;&#x66F4;&#x9AD8;&#x7684;&#x5C42;&#x6B21;&#x4E0A;&#x628A;&#x63E1;&#x4E00;&#x4E9B;&#x62BD;&#x8C61;&#x7684;&#x672C;&#x8D28;&#x7279;&#x5F81;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5728;&#x4E00;&#x4E9B;&#x7EC6;&#x679D;&#x672B;&#x8282;&#x4E0A;&#x94BB;&#x725B;&#x89D2;&#x5C16;&#x3002;&#x51FA;&#x4E8E;&#x8FD9;&#x4E2A;&#x76EE;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x5728;&#x666E;&#x901A;&#x7684;&#x5168;&#x8FDE;&#x63A5;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x9010;&#x6E10;&#x53D1;&#x5C55;&#x51FA;&#x4E86;&#x5176;&#x4ED6;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;&#x5728;&#x56FE;&#x50CF;&#x8BC6;&#x522B;&#x9886;&#x57DF;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x6709;&#x4E86;&#x7ECF;&#x5178;&#x7684;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;</p>
<p><br></p>
<h2 id="&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;"><a href="#&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;" class="headerlink" title="&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;"></a>&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;</h2><p>&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5E76;&#x4E0D;&#x662F;&#x7279;&#x5B9A;&#x7684;&#x54EA;&#x4E00;&#x79CD;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7ED3;&#x6784;&#xFF0C;&#x800C;&#x662F;&#x5E26;&#x6709;&#x5377;&#x79EF;&#x5C42;&#x7684;&#x4E00;&#x7C7B;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x603B;&#x79F0;&#x3002;&#x5B83;&#x4EEC;&#x5171;&#x540C;&#x7684;&#x7279;&#x70B9;&#x662F;&#xFF0C;&#x8F93;&#x5165;&#x7684;&#x7279;&#x5F81;&#x8981;&#x5728;&#x4E00;&#x5F00;&#x59CB;&#x7ECF;&#x8FC7;&#x6570;&#x4E2A;<strong>&#x5377;&#x79EF;&#x5C42;</strong>&#x548C;<strong>&#x6C60;&#x5316;&#x5C42;</strong>&#xFF0C;&#x6765;&#x5BF9;&#x56FE;&#x50CF;&#x4ECE;&#x6574;&#x4F53;&#x4E0A;&#x8FDB;&#x884C;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x7684;&#x628A;&#x63E1;&#x3002;&#x603B;&#x4F53;&#x4E0A;&#xFF0C;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5728;&#x6570;&#x4E2A;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x4E4B;&#x524D;&#xFF0C;&#x4F1A;&#x4EA4;&#x66FF;&#x52A0;&#x5165;&#x591A;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x548C;&#x6C60;&#x5316;&#x5C42;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x5F97;&#x5230;&#x7684;&#x7279;&#x5F81;&#x8F93;&#x5165;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x4E2D;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#x3002;</p>
<h3 id="&#x7075;&#x611F;"><a href="#&#x7075;&#x611F;" class="headerlink" title="&#x7075;&#x611F;"></a>&#x7075;&#x611F;</h3><p>&#x540C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E00;&#x6837;&#xFF0C;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x7075;&#x611F;&#x4E5F;&#x662F;&#x6765;&#x81EA;&#x4E8E;&#x751F;&#x7269;&#x5B66;&#x3002;&#x5728;&#x751F;&#x7269;&#x5B66;&#x4E2D;&#xFF0C;&#x4EBA;&#x4EEC;&#x53D1;&#x73B0;&#xFF0C;&#x4EBA;&#x7C7B;&#x7684;&#x67D0;&#x4E9B;&#x7279;&#x6B8A;&#x7684;&#x89C6;&#x795E;&#x7ECF;&#x7EC6;&#x80DE;&#x53EA;&#x5BF9;&#x7279;&#x5B9A;&#x7684;&#x89C6;&#x89C9;&#x7279;&#x5F81;&#x5174;&#x594B;&#xFF0C;&#x6BD4;&#x5982;&#x6709;&#x4E9B;&#x53EA;&#x5BF9;&#x5782;&#x76F4;&#x7684;&#x8FB9;&#x7F18;&#x4EA7;&#x751F;&#x5174;&#x594B;&#xFF0C;&#x6709;&#x4E9B;&#x5BF9;&#x8FB9;&#x8FB9;&#x89D2;&#x89D2;&#x611F;&#x5174;&#x8DA3;&#x3002;&#x53D7;&#x6B64;&#x542F;&#x53D1;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x56FE;&#x5F62;&#x5B66;&#x4E2D;&#x901A;&#x8FC7;&#x5377;&#x79EF;&#xFF0C;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x5377;&#x79EF;&#x6838;&#x6216;&#x8005;&#x6EE4;&#x6CE2;&#x5668;&#xFF0C;&#x6765;&#x6A21;&#x62DF;&#x89C6;&#x795E;&#x7ECF;&#xFF0C;&#x5BF9;&#x4E0D;&#x540C;&#x7684;&#x7279;&#x5F81;&#x4EA7;&#x751F;&#x5BF9;&#x5E94;&#x7684;&#x6FC0;&#x6D3B;&#x3002;&#x4EE5;&#x6B64;&#x6765;&#x628A;&#x63E1;&#x4E00;&#x4E9B;&#x66F4;&#x9AD8;&#x5C42;&#x6B21;&#x7684;&#x62BD;&#x8C61;&#x7279;&#x5F81;&#x3002;</p>
<h3 id="&#x5377;&#x79EF;&#x5C42;&#xFF08;Convolution-Layer&#xFF09;"><a href="#&#x5377;&#x79EF;&#x5C42;&#xFF08;Convolution-Layer&#xFF09;" class="headerlink" title="&#x5377;&#x79EF;&#x5C42;&#xFF08;Convolution Layer&#xFF09;"></a>&#x5377;&#x79EF;&#x5C42;&#xFF08;Convolution Layer&#xFF09;</h3><p>&#x5728;&#x5377;&#x79EF;&#x5C42;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x901A;&#x8FC7;&#x6570;&#x4E2A;<strong>&#x5377;&#x79EF;&#x6838;&#xFF08;Convolution Kernel&#xFF09;</strong>&#xFF08;&#x4E5F;&#x53EB;<strong>&#x6EE4;&#x6CE2;&#x5668;&#xFF08;Filter&#xFF09;</strong>&#xFF09;&#x6765;&#x5BF9;&#x8F93;&#x5165;&#x8BE5;&#x5C42;&#x7684;&#x7279;&#x5F81;&#x8FDB;&#x884C;&#x5377;&#x79EF;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x901A;&#x5E38;&#xFF0C;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#xFF0C;&#x4E00;&#x5F20;&#x56FE;&#x7247;&#x662F;&#x6309;&#x50CF;&#x7D20;&#x8FDB;&#x884C;&#x5B58;&#x50A8;&#x7684;&#x3002;&#x867D;&#x7136;&#x4E0D;&#x540C;&#x683C;&#x5F0F;&#x8FDB;&#x884C;&#x4E86;&#x4E0D;&#x540C;&#x7684;&#x538B;&#x7F29;&#xFF0C;&#x4F46;&#x5F52;&#x6839;&#x7ED3;&#x5E95;&#xFF0C;&#x4E00;&#x4E2A;&#x56FE;&#x7247;&#x6587;&#x4EF6;&#x4FDD;&#x5B58;&#x4E86;&#x6BCF;&#x4E2A;&#x50CF;&#x7D20;&#x7684;&#x989C;&#x8272;&#xFF0C;&#x8FD9;&#x4E9B;&#x989C;&#x8272;&#x4F7F;&#x7528;&#x7EA2;&#x7EFF;&#x84DD;&#x4E09;&#x539F;&#x8272;&#x6309;&#x7167;&#x4E0D;&#x540C;&#x7684;&#x6BD4;&#x4F8B;&#x6784;&#x6210;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x8BF4;&#x7684;&#xFF08;RGB&#xFF09;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;$a \times b$&#x7684;&#x56FE;&#x50CF;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x56FE;&#x50CF;&#x5BF9;&#x5E94;&#x5230;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x7279;&#x5F81;&#x7684;&#x5C3A;&#x5BF8;&#x5C31;&#x662F;$a \times b \times 3$&#x3002;&#x6211;&#x4EEC;&#x628A;&#x8FD9;$a \times b \times 3$&#x6309;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x7EF4;&#x5EA6;&#x62C6;&#x5F00;&#xFF0C;&#x5C31;&#x5F97;&#x5230;&#x4E86;&#x4E09;&#x4E2A;$a \times b$&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x8FD9;&#x6837;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;$a \times b$&#x7684;&#x7279;&#x5F81;&#x79F0;&#x4F5C;&#x662F;&#x4E00;&#x4E2A;<strong>&#x7279;&#x5F81;&#x56FE;&#xFF08;Feature Map&#xFF09;</strong>&#xFF0C;&#x800C;&#x4E14;&#x6211;&#x4EEC;&#x8BF4;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x7279;&#x5F81;&#x56FE;&#x90FD;&#x662F;&#x5C5E;&#x4E8E;&#x4E00;&#x4E2A;<strong>&#x9891;&#x9053;&#xFF08;Channel&#xFF09;</strong>&#x7684;&#x3002;</p>
<p>&#x90A3;&#x5377;&#x79EF;&#x600E;&#x4E48;&#x5377;&#x5462;&#xFF1F;&#x7528;&#x4E00;&#x4E2A;&#x5B9E;&#x9645;&#x7684;&#x4F8B;&#x5B50;&#x6BD4;&#x8F83;&#x597D;&#x8BF4;&#x660E;&#x3002;</p>
<p>&#x5047;&#x5982;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x6709;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;$4 \times 4$&#x7684;&#x7279;&#x5F81;&#x56FE;&#xFF0C;&#x6570;&#x662F;&#x6211;&#x778E;&#x586B;&#x7684;</p>
<script type="math/tex; mode=display">
\begin{bmatrix}
1 & 2 & 3 & 4\\
5 & 6 & 7 & 8\\
9 & 10 & 11 & 12\\
13 & 14 & 15 & 16
\end{bmatrix}</script><p>&#x8981;&#x505A;&#x5377;&#x79EF;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x6838;&#xFF0C;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x5C31;&#x7528;&#x4E00;&#x4E2A;$2 \times 2$&#x7684;&#x5377;&#x79EF;&#x6838;&#xFF0C;&#x6570;&#x8FD8;&#x662F;&#x6211;&#x778E;&#x586B;&#x7684;</p>
<script type="math/tex; mode=display">
\begin{bmatrix}
1 & 3\\
2 & 4
\end{bmatrix}</script><p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x7528;&#x4E00;&#x4E2A;&#x548C;&#x5377;&#x79EF;&#x6838;&#x4E00;&#x6837;&#x5927;&#x5C0F;&#x7684;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x5728;&#x7279;&#x5F81;&#x56FE;&#x4E0A;&#x6ED1;&#x52A8;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#xFF0C;&#x4ECE;&#x6700;&#x5DE6;&#x4E0A;&#x89D2;&#x5F00;&#x59CB;&#xFF0C;&#x6846;&#x4E00;&#x4E2A;$2 \times 2$&#x7684;&#x533A;&#x57DF;&#x51FA;&#x6765;&#xFF0C;&#x90A3;&#x4E00;&#x5F00;&#x59CB;&#x7684;&#x7A97;&#x53E3;&#x5185;&#x7684;&#x7279;&#x5F81;&#x56FE;&#x5C31;&#x662F;&#x52A0;&#x4E0B;&#x5212;&#x7EBF;&#x7684;&#x8FD9;&#x4E2A;&#x533A;&#x57DF;</p>
<script type="math/tex; mode=display">
\begin{bmatrix}
\underline{1} & \underline{2} & 3 & 4\\
\underline{5} & \underline{6} & 7 & 8\\
9 & 10 & 11 & 12\\
13 & 14 & 15 & 16
\end{bmatrix}</script><p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x628A;&#x8FD9;&#x4E2A;&#x533A;&#x57DF;&#x5185;&#x7684;&#x6570;&#x4E0E;&#x5377;&#x79EF;&#x6838;&#x5185;&#x5BF9;&#x5E94;&#x4F4D;&#x7F6E;&#x7684;&#x6570;&#x76F8;&#x4E58;&#xFF0C;&#x7136;&#x540E;&#x6C42;&#x548C;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5BF9;&#x4E0B;&#x9762;&#x4E24;&#x4E2A;&#x77E9;&#x9635;&#x505A;&#x70B9;&#x4E58;&#x7136;&#x540E;&#x628A;&#x6240;&#x6709;&#x5143;&#x7D20;&#x6C42;&#x548C;</p>
<script type="math/tex; mode=display">
\begin{bmatrix}
1 & 2\\
5 & 6
\end{bmatrix},\begin{bmatrix}
1 & 3\\
2 & 4
\end{bmatrix}</script><p>&#x7B97;&#x51FA;&#x6765;&#x7ED3;&#x679C;$1 \times 1 + 2 \times 3 + 5 \times 2 + 6 \times 4 = 41$&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x8BA9;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x4ECE;&#x5DE6;&#x5411;&#x53F3;&#xFF0C;&#x81EA;&#x4E0A;&#x5411;&#x4E0B;&#x5730;&#x6ED1;&#x52A8;&#xFF0C;&#x7136;&#x540E;&#x4F9D;&#x6B21;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#xFF0C;&#x6700;&#x540E;&#x5C06;&#x8FD9;&#x4E2A;&#x7ED3;&#x679C;&#x6309;&#x7167;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x7684;&#x4F4D;&#x7F6E;&#x6392;&#x5217;&#xFF0C;&#x5C31;&#x80FD;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x77E9;&#x9635;&#x4F5C;&#x4E3A;&#x7279;&#x5F81;&#x56FE;&#x4E86;</p>
<script type="math/tex; mode=display">
\begin{bmatrix}
41 & 51 & 61\\
81 & 91 & 101\\
121 & 131 & 141
\end{bmatrix}</script><p>&#x8FD9;&#x5C31;&#x662F;&#x5377;&#x79EF;&#x7684;&#x7ED3;&#x679C;&#x4E86;&#x3002;&#x6CE8;&#x610F;&#x5230;&#x8FD9;&#x4E2A;&#x77E9;&#x9635;&#x6BD4;&#x539F;&#x6765;&#x7684;&#x7279;&#x5F81;&#x56FE;&#x5C0F;&#x4E00;&#x70B9;&#xFF0C;&#x6240;&#x4EE5;&#x6709;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x4F1A;&#x901A;&#x8FC7;&#x5728;&#x539F;&#x7279;&#x5F81;&#x56FE;&#x8FB9;&#x7F18;&#x518D;&#x52A0;&#x4E00;&#x5708;$0$&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x4FDD;&#x6301;&#x5927;&#x5C0F;&#x4E0D;&#x53D8;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x5728;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x6BCF;&#x6B21;&#x6ED1;&#x52A8;&#x65F6;&#x662F;&#x79FB;&#x52A8;&#x4E00;&#x4E0B;&#x7684;&#xFF0C;&#x800C;&#x5B9E;&#x9645;&#x4E0A;&#x6709;&#x4E9B;&#x65F6;&#x5019;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x53EF;&#x80FD;&#x6BCF;&#x6B21;&#x6ED1;&#x52A8;&#x4E24;&#x4E0B;&#xFF0C;&#x6BCF;&#x6B21;&#x6ED1;&#x52A8;&#x51E0;&#x4E0B;&#x8FD9;&#x4E2A;&#x6570;&#x5B57;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x6B65;&#x957F;&#xFF08;stride&#xFF09;</strong>&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x6B65;&#x957F;&#x662F;$1$&#x3002;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#xFF0C;&#x8FD9;&#x4E2A;&#x65B0;&#x7279;&#x5F81;&#x56FE;&#x91CC;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x90FD;&#x662F;&#x539F;&#x5148;&#x7279;&#x5F81;&#x91CC;&#x5BF9;&#x5E94;&#x7684;&#x4E00;&#x4E2A;&#x533A;&#x57DF;&#x5185;&#x5143;&#x7D20;&#x5171;&#x540C;&#x4F5C;&#x7528;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x8FD9;&#x4E2A;&#x533A;&#x57DF;&#x5927;&#x5C0F;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x611F;&#x53D7;&#x91CE;&#xFF08;receptive field&#xFF09;</strong>&#x3002;</p>
<p>&#x5377;&#x79EF;&#x8BA1;&#x7B97;&#x80FD;&#x591F;&#x6A21;&#x62DF;&#x89C6;&#x795E;&#x7ECF;&#x7EC6;&#x80DE;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x53EA;&#x5BF9;&#x7279;&#x5B9A;&#x7684;&#x7279;&#x5F81;&#x8FDB;&#x884C;&#x6FC0;&#x6D3B;&#xFF0C;&#x6BD4;&#x5982;&#x6C34;&#x5E73;&#x7684;&#x8FB9;&#x7F18;&#xFF0C;&#x5782;&#x76F4;&#x7684;&#x8FB9;&#x7F18;&#xFF0C;&#x8FB9;&#x8FB9;&#x89D2;&#x89D2;&#x554A;&#x8FD9;&#x4E9B;&#x7684;&#x3002;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x56FE;&#x5F62;&#x5B66;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x4F1A;&#x5229;&#x7528;&#x5377;&#x79EF;&#x7684;&#x8FD9;&#x4E2A;&#x7279;&#x6027;&#x6765;&#x5BF9;&#x56FE;&#x50CF;&#x8FDB;&#x884C;&#x4E00;&#x5B9A;&#x7684;&#x9510;&#x5316;&#x5904;&#x7406;&#x3002;</p>
<p>&#x4E0A;&#x9762;&#x662F;&#x9488;&#x5BF9;&#x4E8C;&#x7EF4;&#x77E9;&#x9635;&#x7684;&#x5377;&#x79EF;&#xFF0C;&#x800C;&#x5728;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#xFF0C;&#x7531;&#x4E8E;&#x6211;&#x4EEC;&#x7684;&#x7279;&#x5F81;&#x5F80;&#x5F80;&#x662F;&#x6709;&#x5F88;&#x591A;&#x9891;&#x9053;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x7684;&#x6BCF;&#x4E2A;&#x5377;&#x79EF;&#x6838;&#x4F1A;&#x5BF9;&#x6240;&#x6709;&#x7684;&#x9891;&#x9053;&#x8FDB;&#x884C;&#x5377;&#x79EF;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x7684;&#x5377;&#x79EF;&#x6838;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x4E2A;&#x4E09;&#x7EF4;&#x7684;&#xFF0C;&#x800C;&#x5B83;&#x7B2C;&#x4E09;&#x4E2A;&#x7EF4;&#x5EA6;&#x7684;&#x957F;&#x5EA6;&#x5C31;&#x7B49;&#x4E8E;&#x9891;&#x9053;&#x6570;&#x3002;&#x8FDB;&#x884C;&#x5377;&#x79EF;&#x65F6;&#xFF0C;&#x5377;&#x79EF;&#x6838;&#x4ECD;&#x7136;&#x662F;&#x5728;&#x7279;&#x5F81;&#x56FE;&#x7684;&#x65B9;&#x5411;&#x8FDB;&#x884C;&#x4E8C;&#x7EF4;&#x6ED1;&#x52A8;&#xFF0C;&#x53EA;&#x662F;&#x5728;&#x8BA1;&#x7B97;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x5BF9;&#x6240;&#x6709;&#x9891;&#x9053;&#x5BF9;&#x5E94;&#x7A97;&#x53E3;&#x5BF9;&#x5E94;&#x4F4D;&#x7F6E;&#x7684;&#x6570;&#x5B57;&#x8FDB;&#x884C;&#x76F8;&#x4E58;&#x6C42;&#x548C;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x5F15;&#x7528;&#x4E00;&#x5F20;&#x52A8;&#x56FE;<small>[1]</small>&#x6765;&#x5F62;&#x8C61;&#x5730;&#x8BF4;&#x660E;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;&#x8FD9;&#x91CC;&#x662F;&#x7528;&#x4E86;&#x4E24;&#x4E2A;&#x5377;&#x79EF;&#x6838;&#x5BF9;&#x62E5;&#x6709;&#x4E09;&#x4E2A;&#x9891;&#x9053;&#x7684;&#x7279;&#x5F81;&#x56FE;&#x8FDB;&#x884C;&#x5377;&#x79EF;&#xFF0C;&#x5F97;&#x5230;&#x4E86;&#x4E24;&#x4E2A;&#x65B0;&#x7684;&#x7279;&#x5F81;&#x56FE;&#xFF0C;&#x7EC4;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x62E5;&#x6709;&#x4E24;&#x4E2A;&#x9891;&#x9053;&#x7684;&#x65B0;&#x7279;&#x5F81;&#xFF1A;</p>
<img src="/articles/14/pic2.gif" alt="pic2.gif" title="">
<p>&#x901A;&#x5E38;&#xFF0C;&#x5728;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x7528;&#x5F88;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x5377;&#x79EF;&#x6838;&#xFF08;&#x5C11;&#x5219;&#x51E0;&#x5341;&#xFF0C;&#x591A;&#x5219;&#x51E0;&#x767E;&#xFF09;&#xFF0C;&#x6BCF;&#x4E2A;&#x5377;&#x79EF;&#x6838;&#x5377;&#x79EF;&#x4E00;&#x6B21;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x7279;&#x5F81;&#x56FE;&#x4F5C;&#x4E3A;&#x8BE5;&#x5C42;&#x8F93;&#x51FA;&#x7684;&#x65B0;&#x7279;&#x5F81;&#x7684;&#x4E00;&#x4E2A;&#x9891;&#x9053;&#x3002;&#x8FD9;&#x4E2A;&#x65B0;&#x7279;&#x5F81;&#x5C31;&#x4F1A;&#x88AB;&#x9001;&#x5F80;&#x4E0B;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x6216;&#x8005;&#x6C60;&#x5316;&#x5C42;&#x4E86;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x7528;&#x591A;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x5462;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x4E2A;&#x5377;&#x79EF;&#x6838;&#x53EA;&#x5BF9;&#x5E94;&#x4E00;&#x79CD;&#x6F5C;&#x5728;&#x7279;&#x5F81;&#x7684;&#x6FC0;&#x6D3B;&#xFF0C;&#x6240;&#x4EE5;&#x8981;&#x60F3;&#x5BF9;&#x56FE;&#x50CF;&#x4E2D;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x6F5C;&#x5728;&#x7279;&#x5F81;&#x8FDB;&#x884C;&#x628A;&#x63E1;&#xFF0C;&#x5C31;&#x8981;&#x7528;&#x5F88;&#x591A;&#x5377;&#x79EF;&#x6838;&#x6765;&#x8FDB;&#x884C;&#x63D0;&#x53D6;&#x3002;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x8F93;&#x51FA;&#x7684;&#x9891;&#x9053;&#x6570;&#x4E00;&#x5B9A;&#x7B49;&#x4E8E;&#x5377;&#x79EF;&#x5C42;&#x5185;&#x5377;&#x79EF;&#x6838;&#x7684;&#x6570;&#x91CF;&#x3002;</p>
<p>&#x8FD9;&#x6837;&#xFF0C;&#x7ECF;&#x8FC7;&#x6570;&#x9053;&#x5377;&#x79EF;&#x5C42;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x80FD;&#x591F;&#x5BF9;&#x56FE;&#x50CF;&#x7531;&#x6D45;&#x53CA;&#x6DF1;&#x5730;&#x4ECE;&#x9AD8;&#x5C42;&#x6B21;&#x4E0A;&#x8FDB;&#x884C;&#x4E00;&#x4E2A;&#x62BD;&#x8C61;&#x5730;&#x628A;&#x63E1;&#xFF0C;&#x800C;&#x8FD9;&#x4E9B;&#x62BD;&#x8C61;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x5C06;&#x7528;&#x4E8E;&#x6700;&#x540E;&#x7684;&#x5206;&#x7C7B;&#x8BA1;&#x7B97;&#x3002;</p>
<h3 id="&#x6C60;&#x5316;&#x5C42;&#xFF08;Pooling-Layer&#xFF09;"><a href="#&#x6C60;&#x5316;&#x5C42;&#xFF08;Pooling-Layer&#xFF09;" class="headerlink" title="&#x6C60;&#x5316;&#x5C42;&#xFF08;Pooling Layer&#xFF09;"></a>&#x6C60;&#x5316;&#x5C42;&#xFF08;Pooling Layer&#xFF09;</h3><p>&#x524D;&#x9762;&#x63D0;&#x5230;&#x4E86;&#x5BF9;&#x4E8E;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6765;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x5C42;&#x7684;&#x7279;&#x5F81;&#x6570;&#x91CF;&#x592A;&#x591A;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x8BA1;&#x7B97;&#x7684;&#x89C4;&#x6A21;&#x5C31;&#x4F1A;&#x5F88;&#x5927;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x6709;&#x65F6;&#x5019;&#x9700;&#x8981;&#x51CF;&#x5C11;&#x8BA1;&#x7B97;&#x91CF;&#x3002;&#x53E6;&#x5916;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x63D0;&#x5230;&#x4E86;&#xFF0C;&#x56FE;&#x50CF;&#x8F7B;&#x5FAE;&#x7684;&#x53D8;&#x52A8;&#x53EF;&#x80FD;&#x4F1A;&#x6781;&#x5927;&#x5730;&#x5E72;&#x6270;&#x8BC6;&#x522B;&#xFF0C;&#x56E0;&#x4E3A;&#x867D;&#x7136;&#x4ECE;&#x4EBA;&#x773C;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#x56FE;&#x50CF;&#x53EF;&#x80FD;&#x53D8;&#x5316;&#x5F88;&#x5C0F;&#xFF0C;&#x4F46;&#x662F;&#x54EA;&#x6015;&#x7A0D;&#x5FAE;&#x7684;&#x5E73;&#x79FB;&#x90FD;&#x4F1A;&#x5BFC;&#x81F4;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x7684;&#x50CF;&#x7D20;&#x90FD;&#x6539;&#x53D8;&#x4E86;&#xFF0C;&#x8FD9;&#x5BF9;&#x8BA1;&#x7B97;&#x673A;&#x6765;&#x8BF4;&#x51E0;&#x4E4E;&#x5C31;&#x662F;&#x5168;&#x65B0;&#x7684;&#x7279;&#x5F81;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x7528;&#x6C60;&#x5316;&#x5C42;&#x8FDB;&#x884C;&#x5904;&#x7406;&#xFF0C;&#x4E00;&#x65B9;&#x9762;&#x964D;&#x4F4E;&#x6570;&#x636E;&#x91CF;&#xFF0C;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x4E5F;&#x5E26;&#x6765;&#x4E86;&#x4E00;&#x5B9A;&#x7684;&#x6297;&#x5E72;&#x6270;&#x80FD;&#x529B;&#x3002;</p>
<p>&#x90A3;&#x6C60;&#x5316;&#x5C42;&#x662F;&#x600E;&#x4E48;&#x4E2A;&#x6C60;&#x5316;&#x6CD5;&#x5462;&#xFF1F;</p>
<p>&#x548C;&#x5377;&#x79EF;&#x5C42;&#x7C7B;&#x4F3C;&#xFF0C;&#x6C60;&#x5316;&#x5C42;&#x4E5F;&#x662F;&#x91C7;&#x7528;&#x4E00;&#x4E2A;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x6765;&#x8FDB;&#x884C;&#x6ED1;&#x52A8;&#x3002;&#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF0C;&#x5377;&#x79EF;&#x5C42;&#x7684;&#x6B65;&#x957F;&#x901A;&#x5E38;&#x4E3A;1&#xFF0C;&#x800C;&#x6C60;&#x5316;&#x5C42;&#x7684;&#x6B65;&#x957F;&#x901A;&#x5E38;&#x7B49;&#x4E8E;&#x7A97;&#x53E3;&#x8FB9;&#x957F;&#x6216;&#x8005;&#x63A5;&#x8FD1;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x7B49;&#x4E8E;&#x5C06;&#x7279;&#x5F81;&#x56FE;&#x5212;&#x5206;&#x4E3A;&#x51E0;&#x5757;&#xFF0C;&#x6BCF;&#x4E00;&#x5757;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x65B0;&#x7279;&#x5F81;&#x3002;&#x800C;&#x6BCF;&#x4E00;&#x4E2A;&#x7A97;&#x53E3;&#x5185;&#x7684;&#x8BA1;&#x7B97;&#x4E5F;&#x5F88;&#x7B80;&#x5355;&#x7C97;&#x66B4;&#xFF0C;&#x901A;&#x5E38;&#x4E3A;&#x53D6;&#x6700;&#x5927;&#x503C;&#x6216;&#x8005;&#x53D6;&#x5E73;&#x5747;&#x503C;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x4E0E;&#x5377;&#x79EF;&#x5BF9;&#x6240;&#x6709;&#x9891;&#x9053;&#x8FDB;&#x884C;&#x5377;&#x79EF;&#x4E0D;&#x540C;&#xFF0C;&#x6C60;&#x5316;&#x5C42;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x9891;&#x9053;&#x662F;&#x5355;&#x72EC;&#x8FDB;&#x884C;&#x8BA1;&#x7B97;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x8F93;&#x5165;&#x7684;&#x7279;&#x5F81;&#x6709;&#x51E0;&#x4E2A;&#x9891;&#x9053;&#xFF0C;&#x8F93;&#x51FA;&#x7684;&#x7279;&#x5F81;&#x5C31;&#x4F1A;&#x6709;&#x51E0;&#x4E2A;&#x9891;&#x9053;&#xFF0C;&#x800C;&#x4E14;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x7684;&#x9891;&#x9053;&#x4E5F;&#x662F;&#x4E00;&#x4E00;&#x5BF9;&#x5E94;&#x7684;&#x3002;</p>
<p>&#x4E3E;&#x4F8B;&#x6765;&#x8BF4;&#xFF0C;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&#x7279;&#x5F81;&#x56FE;</p>
<script type="math/tex; mode=display">
\begin{bmatrix}
0 & 1 & 0 & 0\\
0 & 2 & 0 & 0\\
0 & 3 & 0 & 0\\
0 & 4 & 0 & 0
\end{bmatrix}</script><p>&#x6211;&#x4EEC;&#x7528;&#x5C3A;&#x5BF8;&#x4E3A;$2 \times 2$&#xFF0C;&#x6B65;&#x957F;&#x4E3A;$2$&#xFF0C;&#x53D6;&#x6700;&#x5927;&#x503C;&#x7684;&#x6C60;&#x5316;&#x5C42;&#x8FDB;&#x884C;&#x5904;&#x7406;&#x540E;&#x5F97;&#x5230;&#x7684;&#x7ED3;&#x679C;&#x5C31;&#x662F;</p>
<script type="math/tex; mode=display">
\begin{bmatrix}
2 & 0\\
4 & 0
\end{bmatrix}</script><p>&#x51CF;&#x5C11;&#x8BA1;&#x7B97;&#x91CF;&#x597D;&#x7406;&#x89E3;&#x4E86;&#xFF0C;&#x90A3;&#x6297;&#x5E72;&#x6270;&#x80FD;&#x529B;&#x600E;&#x4E48;&#x4F53;&#x73B0;&#x7684;&#x5462;&#xFF1F;&#x90A3;&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x7279;&#x5F81;&#x56FE;&#x6574;&#x4F53;&#x5DE6;&#x79FB;&#x4E00;&#x4E2A;&#x5355;&#x4F4D;&#xFF0C;&#x7279;&#x5F81;&#x56FE;&#x5C31;&#x6210;&#x4E86;</p>
<script type="math/tex; mode=display">
\begin{bmatrix}
1 & 0 & 0 & 0\\
2 & 0 & 0 & 0\\
3 & 0 & 0 & 0\\
4 & 0 & 0 & 0
\end{bmatrix}</script><p>&#x7136;&#x800C;&#xFF0C;&#x6211;&#x4EEC;&#x518D;&#x6B21;&#x8BA1;&#x7B97;&#x6C60;&#x5316;&#x5C42;&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x7ED3;&#x679C;&#x4ECD;&#x7136;&#x662F;</p>
<script type="math/tex; mode=display">
\begin{bmatrix}
2 & 0\\
4 & 0
\end{bmatrix}</script><p>&#x7ED3;&#x679C;&#x4ECD;&#x7136;&#x4E0D;&#x53D8;&#xFF0C;&#x8FD9;&#x4E5F;&#x5C31;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x6297;&#x5E72;&#x6270;&#x80FD;&#x529B;&#x4E86;&#x3002;&#x90A3;&#x4E48;&#x95EE;&#x9898;&#x53C8;&#x6765;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x5E72;&#x6270;&#x662F;&#x6574;&#x4F53;&#x5DE6;&#x79FB;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x90A3;&#x6211;&#x8981;&#x53F3;&#x79FB;&#x5462;&#xFF1F;&#x8FD9;&#x53C8;&#x662F;&#x65B0;&#x7684;&#x7279;&#x5F81;&#x4E86;&#x561B;&#xFF01;&#x7684;&#x786E;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x4F1A;&#x6709;&#x5F88;&#x591A;&#x6C60;&#x5316;&#x5C42;&#xFF0C;&#x8FD9;&#x4E00;&#x5C42;&#x53D8;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x5F88;&#x53EF;&#x80FD;&#x4E0B;&#x4E00;&#x6B21;&#x7ECF;&#x8FC7;&#x6C60;&#x5316;&#x5C42;&#x5904;&#x7406;&#x540E;&#x53D8;&#x5316;&#x53C8;&#x4F1A;&#x53D8;&#x5F97;&#x5F88;&#x5C0F;&#x4E86;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5C31;&#x80FD;&#x591F;&#x5BB9;&#x5FCD;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x7684;&#x8F7B;&#x5FAE;&#x53D8;&#x5316;&#x5BF9;&#x5206;&#x7C7B;&#x9884;&#x6D4B;&#x7684;&#x5E72;&#x6270;&#x4E86;&#x3002;</p>
<p>&#x5173;&#x4E8E;&#x8BE6;&#x7EC6;&#x7684;&#x8BF4;&#x660E;&#xFF0C;&#x53EF;&#x4EE5;&#x53C2;&#x8003;<a href="https://www.zhihu.com/question/36686900/answer/130890492" target="_blank" rel="external">&#x77E5;&#x4E4E;&#x4E0A;&#x7684;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;</a>&#xFF0C;&#x6587;&#x4E2D;&#x4E3E;&#x4E86;&#x8BE6;&#x7EC6;&#x7684;&#x4F8B;&#x5B50;&#x6765;&#x8BF4;&#x660E;&#x6C60;&#x5316;&#x5C42;&#x7684;&#x4F5C;&#x7528;&#x3002;</p>
<h3 id="&#x6574;&#x4F53;&#x67B6;&#x6784;"><a href="#&#x6574;&#x4F53;&#x67B6;&#x6784;" class="headerlink" title="&#x6574;&#x4F53;&#x67B6;&#x6784;"></a>&#x6574;&#x4F53;&#x67B6;&#x6784;</h3><p>&#x524D;&#x9762;&#x4E5F;&#x8BF4;&#x4E86;&#xFF0C;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x5927;&#x7684;&#x7C7B;&#x522B;&#xFF0C;&#x5177;&#x4F53;&#x5230;&#x4E00;&#x4E9B;&#x7F51;&#x7EDC;&#x4E0A;&#x65F6;&#x7ED3;&#x6784;&#x5343;&#x5DEE;&#x4E07;&#x522B;&#x3002;&#x4E0D;&#x8FC7;&#x603B;&#x4F53;&#x4E0A;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x7684;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x90FD;&#x9075;&#x5FAA;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x67B6;&#x6784;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x6570;&#x4E2A;&#x5377;&#x79EF;&#x6C60;&#x5316;&#x5C42;&#x63D0;&#x53D6;&#x7279;&#x5F81;&#x56FE;&#xFF0C;&#x7136;&#x540E;&#x9001;&#x5165;&#x6570;&#x4E2A;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x4E2D;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#x3002;</p>
<p>&#x4EE5;VGG&#x7F51;&#x7EDC;&#x4E3A;&#x4F8B;&#xFF0C;&#x5176;&#x5C55;&#x793A;&#x4E86;&#x516D;&#x79CD;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x7ED3;&#x6784;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x7684;&#x8868;&#x683C;<small>[2]</small>&#x6240;&#x793A;&#x3002;</p>
<img src="/articles/14/pic3.jpg" alt="pic3.jpg" title="">
<p>&#x7F51;&#x7EDC;&#x7ED3;&#x6784;&#x662F;&#x81EA;&#x4E0A;&#x5411;&#x4E0B;&#x7684;&#xFF0C;&#x6BCF;&#x4E00;&#x5217;&#x4EE3;&#x8868;&#x4E86;&#x4E00;&#x79CD;&#x7F51;&#x7EDC;&#xFF0C;&#x5176;&#x4E2D;&#x201C;convx-y&#x201D;&#x8868;&#x793A;&#x4F7F;&#x7528;$x \times x$&#x7684;&#x7A97;&#x53E3;&#x5927;&#x5C0F;&#xFF0C;&#x6709;$y$&#x4E2A;&#x5377;&#x79EF;&#x6838;&#x7684;&#x5377;&#x79EF;&#x5C42;&#xFF1B;&#x201C;maxpool&#x201D;&#x8868;&#x793A;&#x53D6;&#x6700;&#x5927;&#x503C;&#x7684;&#x6C60;&#x5316;&#x5C42;&#xFF1B;&#x201C;FC-x&#x201D;&#x8868;&#x793A;&#x6709;$x$&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#xFF1B;&#x201C;LRN&#x201D;&#x662F;&#x8FDB;&#x884C;&#x4E86;&#x5C40;&#x90E8;&#x54CD;&#x5E94;&#x5F52;&#x4E00;&#x5316;&#xFF08;&#x8FD9;&#x7BC7;&#x8BBA;&#x6587;&#x91CC;&#x7528;&#x5B83;&#x662F;&#x4E3A;&#x4E86;&#x8BC1;&#x660E;&#x5B83;&#x5176;&#x5B9E;&#x6CA1;&#x4EC0;&#x4E48;&#x4F5C;&#x7528;&#x2026;&#x2026;&#xFF09;&#x8BA1;&#x7B97;&#xFF1B;&#x201C;softmax&#x201D;&#x662F;&#x8FDB;&#x884C;&#x4E86;&#x4E00;&#x79CD;&#x53EB;softmax&#x7684;&#x8BA1;&#x7B97;&#xFF0C;&#x5176;&#x6838;&#x5FC3;&#x5728;&#x4E8E;&#x4F7F;&#x5F97;&#x8F93;&#x51FA;&#x7684;&#x5BF9;&#x4E8E;&#x5404;&#x7C7B;&#x7684;&#x9884;&#x6D4B;&#x503C;&#x52A0;&#x8D77;&#x6765;&#x7B49;&#x4E8E;1&#xFF0C;&#x4EE5;&#x4FBF;&#x4E8E;&#x8FDB;&#x884C;&#x4E00;&#x4E9B;&#x7EDF;&#x8BA1;&#x4E0E;&#x8BA1;&#x7B97;&#xFF0C;&#x4F8B;&#x5982;&#x8BA1;&#x7B97;&#x635F;&#x5931;&#x7B49;&#x3002;</p>
<p><br></p>
<h2 id="&#x53C2;&#x8003;&#x53CA;&#x5F15;&#x7528;"><a href="#&#x53C2;&#x8003;&#x53CA;&#x5F15;&#x7528;" class="headerlink" title="&#x53C2;&#x8003;&#x53CA;&#x5F15;&#x7528;"></a>&#x53C2;&#x8003;&#x53CA;&#x5F15;&#x7528;</h2><p>[1] &#x6587;&#x4E2D;&#x6F14;&#x793A;&#x5377;&#x79EF;&#x64CD;&#x4F5C;&#x7684;&#x52A8;&#x56FE;&#x6765;&#x81EA;<a href="https://blog.csdn.net/v_july_v/article/details/51812459" target="_blank" rel="external">CNN&#x7B14;&#x8BB0;&#xFF1A;&#x901A;&#x4FD7;&#x7406;&#x89E3;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;</a>&#x4E00;&#x6587;&#x4E2D;&#x535A;&#x4E3B;&#x5236;&#x4F5C;&#x7684;GIF&#x3002;</p>
<p>[2] &#x8868;&#x683C;&#x6765;&#x81EA;&#x8BBA;&#x6587;<a href="https://arxiv.org/abs/1409.1556" target="_blank" rel="external">&#x300A;Very Deep Convolutional Networks for Large-Scale Image Recognition&#x300B;</a></p>

      
    </div>

  </div>

  <div class="article-footer">
    <div class="article-meta pull-left">

    
      

    <span class="post-categories">
      <i class="icon-categories"></i>
        <a href="/categories/简单讲讲/">简单讲讲</a>
    </span>
    

    
    

    <span class="post-tags">
      <i class="icon-tags"></i>
        <a href="/tags/模式识别/">模式识别</a><a href="/tags/神经网络/">神经网络</a><a href="/tags/深度学习/">深度学习</a><a href="/tags/卷积神经网络（CNN）/">卷积神经网络（CNN）</a>
    </span>
    

    </div>

    
  </div>
</article>


    </main>

    <footer class="site-footer">
  <p class="site-info">
    Proudly powered by <a href="https://hexo.io/" target="_blank">Hexo</a> and
    Theme by <a href="https://github.com/kawaiiQ/kawaiiHacker" target="_blank">kawaiiHacker</a>
    </br>
    
    &copy; 2018 _kawaiiQ
    
  </p>
</footer>
    
    
<script>
  widget_settings = {
    maxDistance: 15,
    sensitive: 0.01
  };
</script>
<script src="/js/logo-widget.js"></script>



<script type="text/x-mathjax-config">
  MathJax.Hub.Config({
    tex2jax: {
      inlineMath: [['$','$'], ["\\(","\\)"] ],
      processEscapes: true
    }
  });
</script>
<script type="text/javascript" async
  src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/MathJax.js?config=TeX-MML-AM_CHTML">
</script>


  </div>
</div>
</body>
</html>